import Vue from 'vue';
import Vuex from 'vuex';

Vue.use(Vuex);

const homePage = {
  state: {
    portfolio: {
      caption: {
        text: 'ПОРТФОЛИО'
      },
      btn: {
        text: 'все работы'
      },
      items: [
        {
          title: 'karree',
          description: 'интернет-магазин женской одежды',
          category: 'web',
          img: '/img/portfolio-1.jpg',
          url: '/portfolio/karree'
        },
        {
          title: 'lisoped',
          description: 'интернет-магазин женской одежды',
          category: 'web',
          img: '/img/portfolio-2.jpg',
          url: '/portfolio/lisoped'
        },
        {
          title: '4pets',
          description: 'интернет-магазин женской одежды',
          category: 'web',
          img: '/img/portfolio-3.jpg',
          url: '/portfolio/pets'
        },
        {
          title: 'm1',
          description: 'интернет-магазин одежды',
          category: 'web',
          img: '/img/portfolio-4.jpg',
          url: '/portfolio/mshop'
        }
      ]
    },
    banner: {
      title: 'art marks',
      subtitle: 'Web development, SMM, SEO',
      img: '/img/hero.jpg'
    },
    services: {
      caption: {
        text: 'направления работы'
      },
      presentation: {
        btn: {
          text: 'смотреть презентацию Art marks',
          icon:
            '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
          link: '#'
        },
        titleimg: {
          src: 'img/s-services_art-marks.png',
          alt: 'ArtMarks'
        },
        img: {
          src: 'img/s-services_mockup.png',
          alt: 'Alt'
        }
      },
      blocks: {
        web: {
          title: 'Web',
          btn: {
            text: 'Узнать больше',
            icon:
              '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
            link: '/services/web'
          },
          titleColor: '#f1f0fd',
          menu: [
            {
              text: 'Комплексное решение',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Разработка интернет-магазина',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Разработка сайта компании',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Разработка каталога',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Разработка landing page',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Техническая поддержка',
              link: '/services/web/ecommerce'
            }
          ]
        },
        seo: {
          title: 'seo',
          btn: {
            text: 'Узнать больше',
            icon:
              '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
            link: '/services/web'
          },
          titleColor: '#e4f8f1',
          menu: [
            {
              text: 'Комплексное продвижение',
              link: '/services/web/ecommerce'
            },
            {
              text: 'SEO аудит',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Юзабилити аудит',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Вывод из под фильтра',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Аналитик ниша',
              link: '/services/web/ecommerce'
            }
          ]
        },
        smm: {
          title: 'smm',
          btn: {
            text: 'Узнать больше',
            icon:
              '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
            link: '/services/web'
          },
          titleColor: '#e2f6fd',
          menu: [
            {
              text: 'Продвижение в instagram и facebok',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Продвижение в Youtube',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Таргетированая реклама',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Создание контента',
              link: '/services/web/ecommerce'
            },
            {
              text: 'Аналитика и аудит',
              link: '/services/web/ecommerce'
            }
          ]
        }
      }
    },
    clients: {
      caption: {
        text: 'наши клиенты',
        subtext:
          'Гордимся сотрудничеством с лидерами своих отраслей и счастливы быть их digital-партнером'
      },
      items: [
        {
          src: 'img/client-4.png',
          alt: 'karree',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/karree'
            },
            {
              text: 'Smm',
              link: '/clients/smm/karree'
            },
            {
              text: 'Seo',
              link: '/clients/seo/karree'
            }
          ]
        },
        {
          src: 'img/client-3.png',
          alt: 'frime',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/frime'
            },
            {
              text: 'Smm',
              link: '/clients/smm/frime'
            },
            {
              text: 'Seo',
              link: '/clients/seo/frime'
            }
          ]
        },
        {
          src: 'img/client-2.png',
          alt: 'twist',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/twist'
            },
            {
              text: 'Smm',
              link: '/clients/smm/twist'
            },
            {
              text: 'Seo',
              link: '/clients/seo/twist'
            }
          ]
        },
        {
          src: 'img/client-1.png',
          alt: 'bono',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/fayna.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/4pets.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/kartina.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/barbaris.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/varenik.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/orthocon.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/textile.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/techno.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/ovishotel.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/beef.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/network.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/adonis.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/zlato.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        },
        {
          src: 'img/mamont.png',
          alt: 'fayna',
          buttons: [
            {
              text: 'Web',
              link: '/clients/web/bono'
            },
            {
              text: 'Smm',
              link: '/clients/smm/bono'
            },
            {
              text: 'Seo',
              link: '/clients/seo/bono'
            }
          ]
        }
      ]
    },
    team: {
      caption: {
        text: 'наша команда',
        subtext:
          'Мы следуем лучшим мировым трендам. Умеем слушать и слышать наших клиентов. Видим суть и находим яркие решения для каждого проекта.'
      },
      items: [
        {
          name: 'артур',
          position: 'Учредитель, <br>руководитель компании',
          img: 'img/team-1.jpg'
        },
        {
          name: 'ваня',
          position: 'Соучредитель, СEO',
          img: 'img/team-2.jpg'
        },
        {
          name: 'дима',
          position: 'Руководитель отдела <br>web-разработки',
          img: 'img/team-3.jpg'
        },
        {
          name: 'артем',
          position: 'Руководитель отдела SMM',
          img: 'img/team-4.jpg'
        }
      ],
      advantages: [
        {
          number: '3',
          text: 'отдела компании'
        },
        {
          number: '2+',
          text: 'лет опыта работы'
        },
        {
          number: '50+',
          text: 'человек в команде'
        },
        {
          number: '150+',
          text: 'выполненых проектов'
        },
        {
          number: '№5',
          text: 'в рейтинге web-студий Харькова'
        }
      ],
      btn: {
        text: 'вся команда',
        link: '/about/team'
      }
    },
    calculator: {
      titleImg: {
        src: 'img/s-calculator_art-marks.png',
        alt: 'alt'
      },
      stepText: {
        step: 'шаг',
        of: 'с'
      },
      stepNavigation: {
        headTitle: 'Ваш проект'
      },
      stepsData: [
        {
          caption: {
            text: 'выберите направление <br>работы'
          },
          stepStatus: {
            title: 'Направление работы'
          },
          items: [
            {
              title: 'web',
              color: '#cec8f8',
              icon:
                '<svg class="s-calculator--web" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M60.4 48.2c-.3 0-.5-.2-.5-.5s.2-.5.5-.5h14c.3 0 .5.2.5.5s-.2.5-.5.5h-14zM66 12.4c.3 0 .5.2.5.5s-.2.5-.5.5h-2.3l1.2 2c.1.2.1.5-.2.5-.2.1-.5.1-.5-.2l-1.2-2-1.1 2c-.1.2-.4.3-.5.2-.2-.1-.3-.4-.2-.5l1.1-2H60c-.3 0-.5-.2-.5-.5s.2-.5.5-.5h2.3l-1.1-2c-.1-.2-.1-.4.2-.5.2-.1.5-.1.5.2l1.1 2 1.2-1.9c.1-.2.4-.3.5-.2.2.1.3.4.2.5l-1.2 2 2.3-.1zM94.6 53l-3-1.2 1.2 3 .5-1.2c0-.1.1-.1.1-.2.1-.1.1-.1.2-.1l1-.3zM91 50.7l4.9 1.8c.2.1.4.4.3.5l-.3.3-1.5.7 2.5 2.5c.2.2.2.5 0 .6-.2.2-.5.2-.6 0l-2.5-2.5-.6 1.5c-.1.2-.4.4-.5.3l-.3-.3-1.8-4.9c-.1-.2 0-.5.3-.5h.1zm-17.2-.8H60.7v4.5h13l.1-4.5zm-13.4-.8h13.9c.3 0 .5.2.5.5V55c0 .3-.2.5-.5.5H60.4c-.3 0-.5-.2-.5-.5v-5.5c0-.2.2-.4.5-.4zm0-2.8c-.3 0-.5-.2-.5-.5s.2-.5.5-.5h14c.3 0 .5.2.5.5s-.2.5-.5.5h-14zm-4 0h-8.1v8.1h8.1v-8.1zm-8.6-.8h9c.3 0 .5.2.5.5v9c0 .3-.2.5-.5.5h-9c-.3 0-.5-.2-.5-.5v-9c.1-.4.3-.5.5-.5zm30.2-2H45.7v13.3h32.2l.1-13.3zM37.4 32.3H31v6.4h6.4v-6.4zM78 40.2v-4.4H38.3V39c0 .3-.2.5-.5.5h-7.3c-.3 0-.5-.2-.5-.5v-3.2h-2v4.4h50zm0-13.5H28.1V35h2v-3.2c0-.3.2-.5.5-.5h7.2c.3 0 .5.2.5.5V35H78v-8.3zM28.1 56.9h13.7V43.5H28.1v13.4zm54.2 0V26.7h-3.5V40.6c0 .3-.2.5-.5.5H27.7c-.3 0-.5-.2-.5-.5V26.7h-3v30.2h3V43.2c0-.3.2-.5.5-.5h14.5c.3 0 .5.2.5.5v13.7h2.2V43.2c0-.3.2-.5.5-.5h33.1c.3 0 .5.2.5.5v13.7h3.3zm0-34h-58v3h58v-3zM23.8 22h58.9c.3 0 .5.2.5.5v34.8c0 .3-.2.5-.5.5H23.9c-.3 0-.5-.2-.5-.5V22.6c0-.3.2-.6.4-.6zm40.3 39.6H42.4v.5H64V62l.1-.4zm22.4 0H64.9v.4c0 .3-.1.5-.3.6-.2.2-.5.3-.6.3H42.6c-.3 0-.5-.1-.6-.3-.2-.2-.3-.5-.3-.6v-.4H13.8V64c0 .5.2.7.5 1 .3.3.6.5 1 .5h76.1c.4 0 .7-.2 1-.5.3-.3.5-.6.5-1v-2.4h-6.4zm-1.6-42.5H21.6c-.4 0-.6.2-.8.4-.2.2-.4.5-.4.8v40.5H86V20.3c0-.4-.2-.6-.4-.8-.1-.3-.3-.4-.7-.4zm-63.3-.9h63.3c.5 0 1.1.3 1.5.6.4.4.6.9.6 1.5v40.5h6.3c.3 0 .5.2.5.5V64c0 .6-.3 1.2-.6 1.6-.5.4-1.1.5-1.7.5H15.2c-.6 0-1.2-.3-1.6-.6-.5-.5-.6-1-.6-1.6v-2.8c0-.2.3-.4.5-.4h6.2V20.3c0-.5.3-1.1.6-1.5.2-.3.8-.6 1.3-.6z"/></svg>'
            },
            {
              title: 'smm',
              color: '#94dff8',
              icon:
                '<svg class="s-calculator--smm" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M16 58l-1.7 4.8-.7-.3 1.7-4.8.7.3zm12.7 3.6v-8.3H21l-4.1 13.3h34.9l-4.1-13.3H38V61.9h-9.3v-.3zm.8-10.5V61.3h7.6V50.5l.1-.3 6.9-7.2c.3-.3.5-.6.6-.8.1-.3 0-.6-.3-.7-.2-.2-.5-.3-.6-.3-.3 0-.5.1-.6.3l-.2.2-.3.3-.4-.3-.5-.5-.3-.3.3-.3.8-.8.1-.1c.2-.2.3-.5.3-.6 0-.3-.1-.5-.3-.6-.2-.2-.5-.3-.6-.3-.3 0-.5.1-.6.3l-.9 1-.3.3-.3-.4-.4-.4-.3-.3.3-.3 1.4-1.5.3-.3c.2-.2.3-.5.3-.6 0-.3-.1-.5-.3-.6s-.5-.3-.6-.3c-.3 0-.5.1-.6.3l-1.7 1.7-.3.3-.4-.3-.5-.5-.3-.3.3-.3 2.2-2.3.2-.2c.2-.2.3-.5.3-.6 0-.3-.1-.5-.3-.6-.3-.2-.6-.3-.8-.3-.3 0-.5.1-.6.3l-1.7 1.9-.3.3-.2.1-.3.3-4.7 4.6-.6.6-.3.3-.3-.3-1.6-1.5v6.2l1.2 1.7.1.2v4.4zM63 68.6s-.1 0 0 0c-.4.2-.6.3-.9.3H8.9c-.3 0-.6-.1-.8-.2 0 0-.1 0-.1-.1v1c0 .5.3.7.6 1.1.6.4 1.2.6 1.7.6h50.2c.6 0 1.2-.2 1.7-.6.5-.3.6-.6.6-1.1v-1h.2zM44.7 51.9H38v.6H48.2l.1.3 4.3 14.1.2.6H15.6l.2-.6 4.4-14.1.1-.3h8.3v-.6H17.7c-.9 0-1.6.2-2.1.4-.6.3-.9.6-1.1 1.1l-6.6 14v.1c0 .1 0 .2.1.2.1.1.2.2.4.3.2.1.3.1.5.1H62c.2 0 .3 0 .5-.1.1-.1.3-.2.4-.3.1-.1.1-.2.1-.2v-.1l-6.6-14c-.2-.5-.6-.8-1.1-1.1-.6-.3-1.2-.4-2.1-.4h-8.5zm-4.9-37.3l2.1 2.3.5.5c.2-.3.3-.6.4-1 0-.5-.2-.9-.6-1.4-.4-.4-.8-.6-1.3-.6-.3-.1-.7 0-1.1.2zm-8-7L30.3 9c-.1.1-.1.1-.1.2s0 .2.1.2l9.5 10.1L47 27c.1.1.1.1.2.1s.2 0 .2-.1l1.5-1.4c.1-.1.1-.1.1-.2s0-.2-.1-.2l-6.4-6.9-.3-.3-.6-.7-2.4-2.6H39l-.2-.2-6.5-6.9c-.1-.1-.1-.1-.2-.1s-.2.1-.3.1zm-3.1 29.8c-.1.1-.3.2-.4.3l1.7 1.7.3-.3-1.6-1.7zm5-4.7l-4.4 4.1 1.7 1.7 4.2-4.2-1.5-1.6zm-8.3-10.6l8.7 9.1 3.3-3c1.6-1.5 3.9-1.4 6.2-1.2.8 0 1.6.1 2.3.1l-6.5-6.9-8.9-9.6c-.1.7-.1 1.6-.1 2.3 0 2.3 0 4.6-1.6 6.1l-3.4 3.1zm-.6.6l-5.2 4.9c-.7.7-1.2 1.7-1.3 2.8 0 1 .3 2 1 2.9l3.2 3.5c.7.7 1.7 1.2 2.8 1.2.6 0 1.4-.1 2-.5v-.3l.2.2c.2-.1.4-.3.6-.5l.2-.2 5-4.7-8.5-9.3zm-5.7 4.2l5.2-4.9.3-.3 3.6-3.3c1.4-1.3 1.4-3.4 1.4-5.5 0-1 0-2.1.2-3.1-.2-.2-.3-.4-.3-.6 0-.3.1-.6.4-.7l1.5-1.4c.2-.2.6-.3.8-.3.3 0 .6.1.7.4l6.4 6.8c.5-.4 1-.6 1.7-.5.6 0 1.4.3 1.9.8.6.6.7 1.3.7 1.9 0 .6-.2 1.1-.6 1.6l6.5 6.9c.2.2.3.6.3.8 0 .3-.1.6-.4.7l-1.6 1.4c-.2.2-.6.3-.8.3-.2 0-.5-.1-.6-.2-1 .1-2 0-3.1 0-2.1-.1-4.2-.3-5.6 1l-3.6 3.4 1.5 1.5 1.7-1.9c.3-.4.7-.6 1.2-.6s.9.2 1.3.5.6.7.6 1.2c0 .4-.1.7-.3 1l-.2.2-.2.2c.2-.1.4-.1.6-.1.5 0 .9.2 1.3.5s.6.7.6 1.2c0 .3-.1.6-.3.9l-.3.3-.1.4c.2-.1.4-.1.6-.1.5 0 .9.2 1.3.5s.6.7.6 1.2-.2.9-.5 1.3l-.2.2c.2-.1.4-.1.6-.1.5 0 .9.2 1.3.5.6.6.6 1 .6 1.5-.1.5-.4.8-.7 1.3l-6.8 7.1v.4h15.2c1 0 1.7.2 2.4.5.7.4 1.3.9 1.5 1.5l6.6 14c.1.1.1.3.1.5v2.1c0 .6-.5 1.3-1 1.7-.6.5-1.5.7-2.2.7H10.4c-.7 0-1.6-.3-2.2-.7s-1-1-1-1.7v-1.9-.2c0-.1 0-.3.1-.5l6.6-14c.3-.6.7-1.1 1.5-1.5.6-.3 1.4-.5 2.4-.5h10.9V47l-1.2-1.7-.1-.2v-6.8c-.6.3-1.4.5-2 .4-1.2 0-2.4-.6-3.3-1.5l-3.2-3.5c-.9-.9-1.3-2.2-1.3-3.4 0-1.3.6-2.5 1.5-3.4zm34 9.7l-1.6-.6.3 1 .3 1 1-1.4zM51.5 35l2.1.8c.1 0 .2.1.3.2.1.1.1.2.1.3v.3c0 .1-.1.2-.1.3l-1.4 1.7c-.1.1-.3.2-.4.3h-.3c-.1 0-.2-.1-.3-.1-.1-.1-.2-.2-.2-.3l-.4-1.4-.4-1.4v-.4c0-.1.1-.2.2-.2.1-.1.2-.1.3-.1.2-.1.3-.1.5 0zm4.3-1.8l-7.9 2h-.1v.1l1.3 5v.1h.1l7.8-2h.1v-.1l-1.3-4.9c.1-.1 0-.1 0-.2zm-8.1 1.2l7.8-2c.2-.1.5 0 .6.1.2.1.4.3.5.6l1.3 4.9c.1.2 0 .5-.1.6-.1.2-.3.4-.6.5l-7.8 2c-.2.1-.5 0-.6-.1-.2-.1-.4-.3-.5-.6L47 35.5c-.1-.2 0-.5.1-.6.2-.2.4-.4.6-.5zm-35.5 1.5l-2.8 3.4 3.3-.1-.5-3.3zm-2.5 4.2l5.3 4.3-.6-3.1H13v-.4l-.1-1-3.2.2zm6.2 4.4l2.8-3.4-3.3.1.5 3.3zm2.6-4.2L13 35.9l.8 4.5 4.7-.1zM13 35l6.4 5.1c.2.2.3.4.3.6 0 .2 0 .5-.2.6l-3.2 4c-.2.2-.4.3-.6.3-.2 0-.5 0-.6-.2l-6.4-5.1c-.2-.2-.3-.4-.3-.6 0-.2 0-.5.2-.6l3.1-4c.2-.2.4-.3.6-.3.3-.1.5 0 .7.2zm40.6 11.9H52v1.7h1.6v-1.7zm-2.1-.7h2.8V49.4H51.1v-3.3h.4v.1zm6.5-1.6h-1.6v4H58v-4zm-2.1-.7h2.8V49.4H55.5V43.8h.4v.1zm6.4-2.1h-1.6v6.7h1.6v-6.7zm-1.9-.7h2.8v8.3H60V41l.4.1zM16.3 16.4h-1.9l.9 1.7-.6.4-.9-1.7-.9 1.7-.7-.4.9-1.7h-1.9v-.8H13l-.9-1.7.6-.4.9 1.7.9-1.7.6.4-.9 1.7h1.9l.2.8zm39.8 7.9h-1.9l.9 1.7-.6.4-.9-1.7-.9 1.7-.8-.4.9-1.7h-1.9v-.8h1.9l-.9-1.7.6-.4.9 1.7.9-1.7.6.4-.9 1.7h2l.1.8zM25.4 47.1h-1.9l.9 1.7-.6.4-.9-1.7-.9 1.7-.6-.4.9-1.7h-1.9v-.8h1.9l-.9-1.7.6-.4.9 1.7.9-1.7.6.4-.9 1.7h1.9v.8zm20.1-33.5l8.3-1.7.2.7-8.3 1.7-.2-.7zM43 11.4l2.3-8.2.7.2-2.3 8.2-.7-.2zm1.1 1.2l5-4.7.6.6-5 4.7-.6-.6z"/></svg>'
            },
            {
              title: 'seo',
              color: '#95eacd',
              icon:
                '<svg class="s-calculator--seo" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M53.4 24.1c-.5-.5-1.2-.8-1.8-.8-.8 0-1.5.3-1.8.8-.5.5-.8 1.2-.8 1.8 0 .8.3 1.5.8 1.8.5.4 1.2.8 1.8.8.8 0 1.5-.3 1.8-.8.4-.5.8-1.2.8-1.8-.1-.7-.4-1.4-.8-1.8m-4.6-.9c-1.1.6-2.1 1.5-3.3 2.7 1.2 1.3 2.2 2.1 3.3 2.7-.7-.6-1.1-1.6-1.1-2.6-.1-1 .4-2 1.1-2.8zm2.6-1.7c2.3.1 4.6 1.5 7 4.1l.3.4-.3.4c-2.5 2.6-4.8 4.1-7 4.1-2.2.1-4.6-1.3-7.1-4.1L44 26l.3-.4c2.6-2.8 4.9-4.1 7.1-4.1zm5.9 4.5c-1.1-1.1-2-1.8-3-2.4.6.7.9 1.6.9 2.4 0 .9-.3 1.7-.9 2.4 1-.6 2-1.4 3-2.4zM30.7 40.2c-.3-.3-.7-.4-1.1-.4s-.8.2-1.1.4c-.3.3-.4.7-.4 1.1s.2.8.4 1.1c.3.3.7.4 1.1.4s.8-.2 1.1-.4c.3-.3.4-.7.4-1.1 0-.4-.1-.8-.4-1.1zm-1.1-1.5c.8 0 1.4.3 1.8.8.5.5.8 1.2.8 1.8 0 .8-.3 1.4-.8 1.8-.5.5-1.2.8-1.8.8s-1.4-.3-1.8-.8c-.5-.4-.8-1.1-.8-1.8 0-.8.3-1.4.8-1.8.4-.5 1.1-.8 1.8-.8zM31 47l-1 1-.4.4-.3-.4-1-1c-1.6-1.6-3.6-3.4-3.6-5.7 0-1.4.6-2.6 1.5-3.5s2.1-1.5 3.5-1.5 2.6.6 3.5 1.5c.9.9 1.5 2.1 1.5 3.5-.2 2.3-2 4.2-3.7 5.7zm-1.4-.2c.2-.2.4-.4.7-.6 1.6-1.5 3.2-3.1 3.2-4.9 0-1.1-.4-2-1.1-2.7-.7-.7-1.6-1.1-2.7-1.1s-2 .4-2.7 1.1-1.1 1.6-1.1 2.7c0 1.8 1.7 3.5 3.2 4.9.1.2.3.4.5.6zm1.7-38.4l-2.9-1.7v3.6l2.9-1.9zm-3.2-3.2l4.6 2.7.8.5-.8.5-4.6 2.7-.9.6V4.7l.9.5zm4.9-.6c-1-1-2.2-1.6-3.7-1.6s-2.7.6-3.7 1.6S24 6.8 24 8.3s.6 2.7 1.6 3.7 2.2 1.6 3.7 1.6S32 13 33 12s1.6-2.2 1.6-3.7c-.1-1.4-.7-2.7-1.6-3.7zM29.3 2c1.7 0 3.3.7 4.5 1.8C35 5 35.6 6.5 35.6 8.3c0 1.7-.7 3.3-1.8 4.5-1.2 1.2-2.7 1.8-4.5 1.8s-3.3-.7-4.5-1.8c-1.2-1.2-1.8-2.7-1.8-4.5s.7-3.3 1.8-4.5C26 2.7 27.5 2 29.3 2zm41 38.9h-5.6v5.6h5.6v-5.6zm-6.2-1.1H71.5V47.7H63.5V39.7l.6.1zM76 19.1l.5-.4c1.6-1.6 3.3-3 3.3-4.8 0-.4-.2-.7-.4-1-.2-.2-.6-.4-.9-.4-.4 0-.8.1-1.2.3-.3.2-.6.4-.8.8l-.5 1-.5-1c-.2-.3-.4-.7-.8-.8-.3-.2-.8-.3-1.2-.3-.4 0-.7.1-.9.4-.2.2-.4.6-.4 1-.1 1.8 1.6 3.3 3.3 4.8l.5.4zM51.8 44.3h-.7c-.8.1-1.5.4-1.9 1-.6.6-1 1.5-1 2.4v21.8c0 1 .4 1.7 1 2.4.6.6 1.5 1 2.4 1 1 0 1.7-.4 2.4-1s1-1.5 1-2.4V47.6c0-.9-.4-1.7-1-2.4-.7-.5-1.4-.8-2.2-.9zM58.4 19c-1.7-1.7-4.3-2.9-7-2.9s-5.2 1.1-7 2.9c-1.7 1.7-2.9 4.3-2.9 7s1.1 5.2 2.9 7c1.7 1.7 4.3 2.9 7 2.9s5.2-1.1 7-2.9c1.7-1.7 2.9-4.3 2.9-7s-1.1-5.3-2.9-7zm-7-4c3 0 5.8 1.3 7.8 3.2s3.2 4.8 3.2 7.8-1.3 5.8-3.2 7.8c-1.9 1.9-4.8 3.2-7.8 3.2s-5.8-1.3-7.8-3.2c-1.9-1.9-3.2-4.8-3.2-7.8s1.3-5.8 3.2-7.8c2.1-2 4.8-3.2 7.8-3.2zm1.4 26.5c-.3 0-.7.1-1.1.1h-.5c-.3 0-.7 0-1-.1v1.8c.2-.1.3-.1.5-.1h1.5c.2 0 .3.1.5.1l.1-1.8zm8.9-25.8c-2.6-2.6-6.2-4.3-10.3-4.3s-7.7 1.6-10.3 4.3c-2.6 2.6-4.3 6.2-4.3 10.3 0 4.1 1.6 7.7 4.3 10.3 2.2 2.2 5.2 3.7 8.5 4.2H51.4c.4 0 .9 0 1.3-.1h.1c3.3-.4 6.2-1.9 8.4-4.2 2.6-2.6 4.3-6.2 4.3-10.3.4-3.9-1.2-7.6-3.8-10.2zm-10.3-5.4c4.3 0 8.2 1.7 11.1 4.6l.7.7h8.3c-.2-.6-.4-1.2-.3-1.8 0-.7.3-1.3.8-1.7.4-.4 1.1-.7 1.7-.7.6 0 1.2.1 1.7.5.2.1.5.3.7.6.2-.2.4-.4.7-.6.6-.3 1.1-.5 1.7-.5.7 0 1.3.3 1.6.7.4.4.7 1.1.8 1.7 0 .7-.1 1.3-.3 1.8h17.1v1.1h-18c-.7 1-1.6 1.8-2.6 2.7-.3.3-.6.6-.9.8l-.2.2-.4-.3c-.3-.2-.6-.5-.9-.8-1-.9-1.9-1.7-2.6-2.7h-8.2c1.9 2.6 3 5.8 3 9.3v.4h12.6v1.1H67c-.2 2.6-1.2 5-2.5 7.2h39.7v1.1H63.5c-.3.4-.8.9-1.2 1.3-2.3 2.3-5.2 3.9-8.6 4.4v2.5c.3.2.6.4.8.6.8.8 1.3 1.9 1.3 3.2V53h49.7v1.1H55.9v15.2c0 1.3-.5 2.3-1.3 3.2-.8.8-1.9 1.3-3.2 1.3-1.3 0-2.3-.5-3.2-1.3-.8-.8-1.3-1.9-1.3-3.2V54.2H14.6v-1.1h32.3v-5.4c0-1.3.5-2.3 1.3-3.2.2-.2.5-.4.8-.6v-2.5c-3.3-.6-6.3-2-8.6-4.4-.4-.4-.8-.9-1.2-1.3H10v-1.1h28.4c-1.4-2-2.3-4.6-2.5-7.2H24.1v-1.2h11.8V26c0-3.5 1.2-6.7 3-9.3H4.7v-1.1h35l.7-.7c2.9-2.8 6.7-4.6 11-4.6z"/></svg>'
            }
          ]
        },
        {
          caption: {
            text: 'выберите тип проекта'
          },
          stepStatus: {
            title: 'Тип проекта'
          },
          items: [
            {
              title: 'Сайт компании',
              color: '',
              icon:
                '<svg class="s-calculator--company" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path class="st0" d="M17.3 28.4h11.3v35.8H17.3zM30.9 16.6h13.6v20.9H34.1v26.7h-3.2z"/><path class="st0" d="M37 40.6h11.1v23.6H37z"/><path class="st0" d="M47.5 23H64v41.2H51V37.5h-3.5zM66.8 33.3h12v10.6h-5.9v20.3h-6.1z"/><path class="st0" d="M75.4 47.1h8.9v17.1h-8.9zM70.6 30.7h6.6v2.6h-6.6zM32.5 13.7h6.8v2.9h-6.8zM52.1 20.2h7.3V23h-7.3z"/><path class="st1" d="M4 64.2h93.7"/><path class="st0" d="M11.5 57.9v.1c0 1.4-1 2.7-2.1 2.7-1.2 0-2.1-1.2-2.1-2.7v-.1c-.5-.7-.7-1.6-.7-2.4 0-2.1 1.2-3.6 2.8-3.6s2.8 1.6 2.8 3.6c0 .8-.2 1.7-.7 2.4zM9.4 60.7v3.5M93.3 57.9v.1c0 1.4-.8 2.7-2.1 2.7-1.1 0-2.1-1.2-2.1-2.7v-.1c-.5-.7-.7-1.6-.7-2.4 0-2.1 1.2-3.6 2.8-3.6s2.8 1.6 2.8 3.6c0 .8-.2 1.7-.7 2.4zM91.2 60.7v3.5M39.2 44h2.5v2.5h-2.5zM43.4 44h2.5v2.5h-2.5zM39.2 54.3h2.5v2.5h-2.5zM43.4 54.3h2.5v2.5h-2.5zM39.2 49.1h2.5v2.5h-2.5zM43.4 49.1h2.5v2.5h-2.5zM39.2 59.2h2.5v2.5h-2.5zM43.4 59.2h2.5v2.5h-2.5zM77 49h2.2v2.2H77zM80.6 49h2.2v2.2h-2.2zM77 53.3h2.2v2.2H77zM80.6 53.3h2.2v2.2h-2.2zM77 57.7h2.2v2.2H77zM80.6 57.7h2.2v2.2h-2.2z"/></svg>'
            },
            {
              title: 'Интернет-магазин',
              color: '',
              icon:
                '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M27.7 23c-.2.2-.3.6-.2.9L32.3 36c.1.3.4.6.8.6.3 0 .7-.2.8-.7l1.4-5.2 5.3-1.5c.3-.1.6-.4.6-.8s-.2-.7-.6-.8l-12.1-4.8c-.3-.2-.6-.1-.8.2zm10.1 5.2l-3.4 1c-.3.1-.4.3-.6.6L33 33l-3.2-8 8 3.2z"/><path d="M67.7 14h-8.6V3.1c0-.4-.3-.9-.9-.9H15.8c-.4 0-.9.3-.9.9V14H6.4c-2.1 0-3.9 1.8-3.9 3.9v40.4c0 2.1 1.8 3.9 3.9 3.9h21.7v9h-5.7c-.4 0-.9.3-.9.9s.4.7.9.7h29.3c.4 0 .9-.3.9-.9s-.3-.9-.9-.9H46v-9h21.7c2.1 0 3.9-1.8 3.9-3.9V17.9c-.2-2.2-1.8-3.9-3.9-3.9zm0 1.7c1.2 0 2.2 1 2.2 2.2v33.3H59.1V15.7h8.6zM4.2 58.3v-5.5h65.5v5.5c0 1.2-1 2.2-2.2 2.2H6.3c-1.1-.1-2.1-1-2.1-2.2zm53.1-7.1H16.6V11.4h40.8v39.8zM16.7 3.9h40.8v5.8H16.7V3.9zM6.4 15.7H15v35.5H4.2V17.9c0-1.2 1-2.2 2.2-2.2zm37.9 55.4H29.7v-9h14.7v9z"/><path d="M21.4 5.8h-2.8c-.4 0-.9.3-.9.9s.3.9.9.9h2.8c.4 0 .9-.3.9-.9s-.5-.9-.9-.9zM27.4 5.8h-2.8c-.4 0-.9.3-.9.9s.3.9.9.9h2.8c.4 0 .9-.3.9-.9s-.5-.9-.9-.9zM33.2 5.8h-2.8c-.4 0-.9.3-.9.9s.3.9.9.9h2.8c.4 0 .9-.3.9-.9s-.5-.9-.9-.9zM29.7 35.1c.4 0 .9-.3.9-.9s-.3-.9-.9-.9c-4.7 0-8.5-3.9-8.5-8.5s3.9-8.5 8.5-8.5c4.7 0 8.5 3.9 8.5 8.5 0 .4.3.9.9.9s.9-.3.9-.9c0-5.6-4.5-10.1-10.1-10.1s-10.1 4.5-10.1 10.1 4.3 10.3 9.9 10.3zM48 19.5h6.6c.4 0 .9-.3.9-.9s-.3-.9-.9-.9H48c-.4 0-.9.3-.9.9s.4.9.9.9zM45.1 27.7h9.5c.4 0 .9-.3.9-.9s-.3-.9-.9-.9h-9.5c-.4 0-.9.3-.9.9 0 .5.5.9.9.9zM54.6 34.1H39.9c-.4 0-.9.3-.9.9s.3.9.9.9h14.7c.4 0 .9-.3.9-.9s-.5-.9-.9-.9zM54.6 42.2H32c-.4 0-.9.3-.9.9s.3.9.9.9h22.6c.4 0 .9-.3.9-.9-.2-.5-.5-.9-.9-.9zM37 60c1.9 0 3.3-1.4 3.3-3.3s-1.4-3.3-3.3-3.3-3.3 1.4-3.3 3.3c0 1.7 1.5 3.3 3.3 3.3zm0-5c.9 0 1.7.8 1.7 1.7 0 .9-.8 1.7-1.7 1.7s-1.7-.8-1.7-1.7c.1-1 .8-1.7 1.7-1.7z"/></svg>'
            },
            {
              title: 'Landing page',
              color: '',
              icon:
                '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M66.5 40.6l5.5-5.1-5.5-5-1 1.1 4.1 3.9-4.1 4zM9.4 30.5l-5.5 5 5.5 5.1 1-1.1-4.1-4 4.1-3.9zM60.3 21.2H16v28.7h44.4c-.1 0-.1-28.7-.1-28.7zm-1.6 1.6v21.5l-9.8-9.5-4.6 4.4-6.4-7.2-11.1 10.9-4.6-4.4-4.6 4.4v-20h41.1zM17.6 48.3v-3.1l4.6-4.4 4.6 4.4L38 34.4l6.4 7.2 4.6-4.5 9.8 9.5v1.6H17.6z"/><path d="M26.4 34.1c1.6 0 3-1.3 3-3s-1.3-3-3-3c-1.6 0-3 1.3-3 3 0 1.8 1.4 3 3 3zm0-4.2c.7 0 1.4.6 1.4 1.4 0 .7-.6 1.4-1.4 1.4-.7 0-1.4-.6-1.4-1.4 0-.9.7-1.4 1.4-1.4zM25.6 25.4h1.6v1.7h-1.6zM21.713 27.696l1.132-1.131 1.202 1.202-1.132 1.131zM20.7 30.4h1.7V32h-1.7zM21.794 34.694l1.202-1.202 1.132 1.13-1.202 1.203zM25.6 35.2h1.6v1.7h-1.6zM28.705 34.59l1.131-1.13 1.202 1.201-1.131 1.132zM30.5 30.4h1.7V32h-1.7zM28.68 27.867l1.202-1.203 1.132 1.132-1.203 1.202zM50.6 61.8v-6.4h-6.4v6.4h6.4zm-4.7-4.7h3.2v3.2h-3.2v-3.2zM41.4 61.8v-6.4H35v6.4h6.4zm-4.8-4.7h3.2v3.2h-3.2v-3.2zM32 61.8v-6.4h-6.4v6.4H32zm-4.7-4.7h3.2v3.2h-3.2v-3.2zM3.1 2.6v17.8h1.6V4.2h66.6v16.2h1.6V2.6z"/><path d="M71.3 70.8H4.7V54.5H3.1v17.9h69.8V54.5h-1.6z"/></svg>'
            },
            {
              title: 'Логотип',
              color: '',
              icon:
                '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M39.5 3.4V5h13.6c.3-1.1 1.3-1.6 2.3-1.7 1.4 0 2.5 1.1 2.5 2.5s-1.1 2.5-2.5 2.5c-1.4-.1-1.9-.7-2.4-1.8h-6.2c10.5 3.1 18.8 11.5 22 22v-6.1c-1.1-.3-1.6-1.2-1.7-2.4 0-1.4 1.1-2.5 2.5-2.5s2.5 1.1 2.5 2.5c-.1 1.3-.6 1.9-1.7 2.4V36H72v4.9h-1.7v13.6c1.1.3 1.7 1.2 1.7 2.4 0 1.4-1.1 2.5-2.5 2.5S67 58.3 67 56.9c.1-1.3.6-1.9 1.7-2.4v-6.2c-4 13.6-16.9 23.1-31.1 23.5h-34V37.5c.2-14.1 10-26.8 23.5-31h-6.2c-.3 1.1-1.2 1.7-2.4 1.8-1.4 0-2.5-1.1-2.5-2.5.1-1.4 1.1-2.4 2.5-2.5l.5.1c1 .2 1.4.8 1.9 1.6h13.6V3.4h5zM5.3 48.2v22h22c-10.5-3.2-18.8-11.6-22-22zM65 23c.5 2.5.4 1.3.5 3.6 0 9.2-7.4 16.6-16.6 16.6C45 43 40.8 41.9 38 39v31c16.4-.3 28.9-13.4 30.8-29.2h-1.4V36H69c-.5-4.6-2-8.9-4-13zM36.4 39.1H5.3c.2 16.8 14.4 30.6 31.1 31.1V39.1zm12.4-27.5c-8.4 0-15.1 6.8-15.1 15.1s6.8 15.1 15.1 15.1S63.9 35 63.9 26.7s-6.8-15.1-15.1-15.1zm21.8 27.7v-1.7h-1.8v1.8l1.8-.1zM34.7 6.7C18.5 8 6.2 21.5 5.3 37.5h31c-2.9-2.9-4-7-4.2-10.9 0-9.2 7.4-16.6 16.6-16.6 2.4.2 1.1 0 3.6.5-4.1-2.4-8.3-3.3-12.9-3.8v1.5h-4.9l.2-1.5zM38 4.9h-1.8v1.8H38V4.9z"/></svg>'
            },
            {
              title: 'Другое',
              color: '',
              icon:
                '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M45.8 44.9c-3.6 0-6.2-2.7-6.2-6.2s2.7-6.2 6.2-6.2 6.2 2.7 6.2 6.2-2.7 6.2-6.2 6.2zm0-10.5c-2.3 0-4.3 1.8-4.3 4.3s1.8 4.3 4.3 4.3 4.3-1.8 4.3-4.3-2.1-4.3-4.3-4.3zm-17 10.5c-3.6 0-6.2-2.7-6.2-6.2s2.7-6.2 6.2-6.2 6.2 2.7 6.2 6.2-2.6 6.2-6.2 6.2zm0-10.5c-2.3 0-4.3 1.8-4.3 4.3s1.8 4.3 4.3 4.3 4.3-1.8 4.3-4.3-2-4.3-4.3-4.3zM11.9 44.9c-3.6 0-6.2-2.7-6.2-6.2s2.7-6.2 6.2-6.2 6.2 2.7 6.2 6.2c.2 3.5-2.5 6.2-6.2 6.2zm0-10.5c-2.3 0-4.3 1.8-4.3 4.3S9.4 43 11.9 43c2.3 0 4.3-1.8 4.3-4.3s-1.8-4.3-4.3-4.3z"/></svg>'
            }
          ]
        },
        {
          caption: {
            text: 'выберите состояние <br>проекта'
          },
          stepStatus: {
            title: 'Состояние проекта'
          },
          items: [
            {
              title: 'Новый проект',
              color: '',
              icon:
                '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M4.3 65.5c0 3.6 3 6.6 6.6 6.6h44.3c3.7 0 6.6-3 6.6-6.6v-56c0-3.6-3-6.6-6.6-6.6H17.7c-.2 0-.2 0-.4.1h-.1c-.2 0-.2.1-.3.2h-.1l-.3.3h-.1L4.6 17.9c-.2.2-.2.5-.3.7v46.9zm54.3-56v56c0 1.9-1.6 3.5-3.5 3.5H10.9c-1.9 0-3.5-1.6-3.5-3.5v-45h10.3c.9 0 1.6-.7 1.6-1.6V6h35.8c2 0 3.5 1.6 3.5 3.5zm-42.5-.7v8.5h-7l7-8.5z"/></svg>'
            },
            {
              title: 'Существующий проект',
              color: '',
              icon:
                '<svg class="s-calculator--exist-project" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M4.4 65.6c0 3.6 3 6.6 6.6 6.6h44c3.7 0 6.6-3 6.6-6.6V10c0-3.6-3-6.6-6.6-6.6H17.8c-.2 0-.2 0-.4.1h-.1c-.2 0-.2.1-.3.2h-.1l-.3.3h-.1L4.7 18.3c-.2.2-.2.5-.3.7V65.6zM58.5 10v55.7c0 1.9-1.6 3.4-3.4 3.4H11c-1.9 0-3.4-1.6-3.4-3.4V20.9h10.3c.9 0 1.6-.7 1.6-1.6V6.5H55c2 0 3.5 1.5 3.5 3.5zm-42.3-.7v8.5h-7l7-8.5z"/><path class="st0" d="M17.2 35h33.4M17.2 44.4h33.4"/></svg>'
            }
          ]
        },
        {
          caption: {
            text: 'ВЫБЕРИТЕ ПЛАНИРУЕМЫЙ <br>СТАРТ РАБОТ'
          },
          stepStatus: {
            title: 'Старт работ'
          },
          items: [
            {
              title: 'Сейчас',
              color: '',
              icon:
                '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M83.8 7.5c-5.2 0-9.7 4.5-9.7 9.7s4.5 9.7 9.7 9.7 9.7-4.5 9.7-9.7-4.4-9.7-9.7-9.7zm0 16.9a6.7 6.7 0 1 1 6.7-6.7c0 3.7-2.9 6.7-6.7 6.7z"/><path d="M91.7 37.1c-4.9.7-10.9.7-12.4 0-2.2-1.5-4.1-5.2-6-9.4-3.7-7.9-8.2-17.2-17.6-17.2-5.6 0-19.9-.7-20.2-.7h-.4-.8l-.4.4v1.6c6 7.5 11.2 10.5 16.9 9.7 3.7-.4 4.9.7 6 2.2s.4 2.2.4 2.6l-7.9 7.5c-2.6 2.2-3.7 4.5-4.1 7.1-.4 3 1.1 6 3.7 9.4 1.5 1.9 6 6 8.2 8.2L44 64.1c-.7.4-1.1 1.1-.7 1.9.4.7.7.7 1.5.7h.7l15-6.4c.4-.4.7-.7.7-1.1s0-1.1-.4-1.5c0 0-7.5-7.1-9.7-9.7-2.2-2.6-3.4-4.9-3-7.1 0-1.9 1.1-3.4 3-5.2l7.9-7.5c1.5-1.9 1.5-4.1 0-6.4-1.5-2.2-3.4-4.1-9-3.4-2.6.4-6.4 0-11.6-6 4.5 0 12.7.4 16.9.4 7.5 0 11.6 8.2 15 15.7 3 4.9 4.9 9 7.5 10.9 2.2 1.5 7.1 1.5 10.9 1.1-1.9 2.2-4.9 5.2-8.6 5.6-2.2.4-4.1-.4-6-2.2-.7-.7-2.2-3-3.4-4.9-1.5-2.2-1.9-2.6-2.2-3-.4-.4-1.1-.7-4.1 1.1-1.5.7-5.6 3.7-5.2 7.9.4 3.4 3.7 7.1 7.1 10.9l.7.7c1.1 1.1 1.5 2.2 1.5 3 0 .7-.7 1.1-1.5 1.5-4.9 2.6-21 7.5-21 7.5-.7.4-1.1 1.1-1.1 1.9.4.7.7 1.1 1.5 1.1h.4c.7-.4 16.5-4.9 21.7-7.9 1.9-1.1 3-2.2 3-3.7.4-2.2-1.1-4.1-2.2-5.2l-.8-.8c-1.9-2.2-6.4-6.4-6.4-9-.4-2.6 3.4-5.2 5.2-6 .4.4.7 1.1 1.1 1.9 1.1 1.9 2.6 4.1 3.7 5.2 2.6 2.2 5.2 3.4 8.2 3 7.1-1.1 12.4-9.4 12.7-9.7.4-.4.4-1.1 0-1.5-.2-.8-.5-.8-1.3-.8z"/><path d="M17.5 65.6l25.1-19.9c.7-.4.7-1.5.4-2.2s-1.5-.7-2.2-.4L15.6 63.4c-.7.4-.7 1.5-.4 2.2.4.4.7.7 1.1.7.5-.3.8-.3 1.2-.7zM48.3 52.9c-.4-.7-1.1-1.1-1.9-.7l-28.9 15c-.7.4-1.1 1.1-.7 1.9.4.4.7.7 1.5.7h.7l28.9-15c.4-.1.7-1.2.4-1.9zM14.5 20.6c0 .7.7 1.5 1.5 1.5h21.4c.7 0 1.5-.7 1.5-1.5s-.7-1.5-1.5-1.5H16c-.7 0-1.5.8-1.5 1.5zM25 3.4c-.7 0-1.5.7-1.5 1.5s.7 1.5 1.5 1.5h21.4c.7 0 1.5-.7 1.5-1.5s-.4-1.5-1.5-1.5H25zM37.4 39.4c.7 0 1.5-.7 1.5-1.5s-.7-1.5-1.5-1.5H16c-.7 0-1.5.7-1.5 1.5s.7 1.5 1.5 1.5h21.4zM30.3 30.4c0-.7-.7-1.5-1.5-1.5H7c-.7 0-1.5.7-1.5 1.5 0 .7.7 1.5 1.5 1.5h21.4c1.1 0 1.9-.8 1.9-1.5zM27.3 13.5c.7 0 1.5-.7 1.5-1.5s-.7-1.5-1.5-1.5H5.9c-.7 0-1.5.7-1.5 1.5s.7 1.5 1.5 1.5h21.4z"/></svg>'
            },
            {
              title: 'В течении месяца',
              color: '',
              icon:
                '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M20.7 3.738c-.5.1-.8.5-.8 1.1v7.4H6c-.5 0-1 .5-1 1.1v57.2c0 .6.4 1.1 1.1 1.1h89c.6 0 1.1-.4 1.1-1.1V13.238c-.1-.5-.5-1-1.1-1H81.3v-7.4c0-.5-.3-1-.8-1.1H73.9c-.6 0-1.1.4-1.1 1.1v7.4H28.3v-7.4c0-.6-.4-1.1-1.1-1.1h-6.4-.1zm1.2 2.1h4.2v12.7h-4.2v-12.7zm53 0h4.2v12.7h-4.2v-12.7zm-67.8 8.5h12.7v5.3c0 .6.4 1.1 1.1 1.1h6.4c.6 0 1.1-.4 1.1-1.1v-5.3h44.5v5.3c0 .6.4 1.1 1.1 1.1h6.4c.6 0 1.1-.4 1.1-1.1v-5.3H94v12.7H7.1v-12.7zm0 14.8H23v11.7H7.1v-11.7zm18 0H41v11.7H25.1v-11.7zm18 0H58v11.7H43.1v-11.7zm17 0H76v11.7H60.1v-11.7zm18 0H94v11.7H78.1v-11.7zm-71 13.8H23v12.7H7.1v-12.7zm18 0H41v12.7H25.1v-12.7zm18 0H58v12.7H43.1v-12.7zm17 0H76v12.7H60.1v-12.7zm18 0H94v12.7H78.1v-12.7zm-71 14.8H23v11.7H7.1v-11.7zm18 0H41v11.7H25.1v-11.7zm18 0H58v11.7H43.1v-11.7zm17 0H76v11.7H60.1v-11.7zm18 0H94v11.7H78.1v-11.7z"/></svg>'
            },
            {
              title: 'Готов подождать',
              color: '',
              icon:
                '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 110 75"><path d="M38 3.3c-2.5 0-4.5 2-4.5 4.5v15.7c0 2.5 2 4.5 4.5 4.5s4.5-2 4.5-4.5V7.8c0-2.5-2-4.5-4.5-4.5zm2.8 20.1c0 1.6-1.3 2.8-2.8 2.8-1.6 0-2.8-1.3-2.8-2.8V7.8C35.2 6.2 36.5 5 38 5c1.6 0 2.8 1.3 2.8 2.8v15.6zM38 47.1c-2.5 0-4.5 2-4.5 4.5v15.7c0 2.5 2 4.5 4.5 4.5s4.5-2 4.5-4.5V51.6c0-2.5-2-4.5-4.5-4.5zm2.8 20.1c0 1.6-1.3 2.8-2.8 2.8-1.6 0-2.8-1.3-2.8-2.8V51.6c0-1.6 1.3-2.8 2.8-2.8 1.6 0 2.8 1.3 2.8 2.8v15.6zM28.4 37.5c0-2.5-2-4.5-4.5-4.5H8.3c-2.5 0-4.5 2-4.5 4.5s2 4.5 4.5 4.5H24c2.4 0 4.4-2 4.4-4.5zm-23 0c0-1.6 1.3-2.8 2.8-2.8H24c1.6 0 2.8 1.3 2.8 2.8 0 1.6-1.3 2.8-2.8 2.8H8.3c-1.6 0-2.9-1.2-2.9-2.8zM67.7 33H52.1c-2.5 0-4.5 2-4.5 4.5s2 4.5 4.5 4.5h15.7c2.5 0 4.5-2 4.5-4.5S70.2 33 67.7 33zm0 7.3H52.1c-1.6 0-2.8-1.3-2.8-2.8 0-1.6 1.3-2.8 2.8-2.8h15.7c1.6 0 2.8 1.3 2.8 2.8.1 1.6-1.3 2.8-2.9 2.8zM20.1 13.3c-.8-.8-2-1.3-3.2-1.3-1.2 0-2.3.5-3.2 1.3-.8.8-1.3 2-1.3 3.2 0 1.2.5 2.3 1.3 3.2l11.1 11.1c.8.8 2 1.3 3.2 1.3s2.3-.5 3.2-1.3c.8-.8 1.3-2 1.3-3.2 0-1.2-.5-2.3-1.3-3.2L20.1 13.3zm10 16.3c-1 1-3 1-4 0L15 18.5c-.5-.5-.8-1.3-.8-2s.3-1.5.8-2 1.3-.8 2-.8 1.4.3 2 .8l11.1 11.1c.5.5.8 1.3.8 2-.1.7-.3 1.4-.8 2zM28.1 43c-1.2 0-2.3.5-3.2 1.3l-11.1 11c-.8.8-1.3 2-1.3 3.2 0 1.2.5 2.3 1.3 3.2.8.8 2 1.3 3.2 1.3 1.2 0 2.3-.5 3.2-1.3l11.1-11.1c.8-.8 1.3-2 1.3-3.2s-.5-2.3-1.3-3.2c-.9-.8-2.1-1.2-3.2-1.2zm2 6.5L19 60.6c-1 1-3 1-4 0-.5-.5-.8-1.3-.8-2 0-.8.3-1.4.8-2l11.1-11.1c.5-.5 1.3-.8 2-.8s1.5.3 2 .8.8 1.3.8 2c-.1.7-.3 1.4-.8 2zM51.1 30.7l11.1-11.1c.8-.8 1.3-2 1.3-3.2s-.5-2.3-1.3-3.2c-.8-.8-2-1.3-3.2-1.3-1.2 0-2.3.5-3.2 1.3l-11 11.2c-1.8 1.8-1.8 4.6 0 6.3.8.8 2 1.3 3.2 1.3 1.2 0 2.3-.4 3.1-1.3zm-5.2-1.1c-1.1-1.1-1.1-2.9 0-4L57 14.5c.5-.5 1.3-.8 2-.8.8 0 1.4.3 2 .8.5.5.8 1.3.8 2s-.3 1.4-.8 2L50 29.6c-1.1 1-3 1-4.1 0z"/></svg>'
            }
          ]
        },

        {
          caption: {
            text: 'ЗАПОЛНИТЕ ПЕРСОНАЛЬНУЮ <br>ИНФОРМАЦИЮ'
          },
          stepStatus: {
            title: 'Персональные данные'
          },
          inputs: {
            name: {
              placeholder: 'Имя',
              required: true
            },
            phone: {
              placeholder: 'Телефон',
              required: true,
              mask: '+38 (0##)-###-##-##'
            },
            email: {
              placeholder: 'E-mail',
              required: true
            },
            text: {
              placeholder: 'Расскажите об идеи',
              required: true
            },
            file: {
              placeholder: 'Добавить файл',
              required: false,
              multiple: true,
              label: 'Добавить файл',
              loaded: 'Загружено'
            }
          },
          btn: {
            text: 'ОТПРАВИТЬ'
          }
        }
      ]
    }
  }
};

const servicesPage = {
  state: {
    pageTitle: 'Услуги',
    caption: {
      text: 'Услуги',
      content: `
            <p>Мы не просто создаем сайты, мы проводим полный комплекс услуг: заряжаем сайты разработкой, дизайном и рекламой.</p>
            <p>Полное отслеживание всех трендов и инновационных решений.</p>
          `
    },
    img: {
      src: 'img/s-services_art-marks.png',
      alt: 'ArtMarks'
    },
    blocks: {
      web: {
        title: 'Web',
        titleColor: '#f1f0fd',
        menu: [
          {
            text: 'Комплексное решение',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Разработка интернет-магазина',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Разработка сайта компании',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Разработка каталога',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Разработка landing page',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Техническая поддержка',
            link: '/services/web/ecommerce'
          }
        ]
      },
      seo: {
        title: 'seo',
        titleColor: '#e4f8f1',
        menu: [
          {
            text: 'Комплексное продвижение',
            link: '/services/web/ecommerce'
          },
          {
            text: 'SEO аудит',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Юзабилити аудит',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Вывод из под фильтра',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Аналитик ниша',
            link: '/services/web/ecommerce'
          }
        ]
      },
      smm: {
        title: 'smm',
        titleColor: '#e2f6fd',
        menu: [
          {
            text: 'Продвижение в instagram и facebok',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Продвижение в Youtube',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Таргетированая реклама',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Создание контента',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Аналитика и аудит',
            link: '/services/web/ecommerce'
          }
        ]
      },
      ppc: {
        title: 'ppc',
        titleColor: '#f7f0dc',
        menu: [
          {
            text: 'Комплексная реклама',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Контекстная реклама',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Медийная реклама',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Ремаркетинг',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Аудит',
            link: '/services/web/ecommerce'
          }
        ]
      },
      marketing: {
        title: 'Marketing',
        titleColor: '#f6e3e3',
        menu: [
          {
            text: 'Анализ конкурентов',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Аудит',
            link: '/services/web/ecommerce'
          },
          {
            text: 'Креативная реклама',
            link: '/services/web/ecommerce'
          }
        ]
      }
    }
  }
};

const global = {
  state: {
    isScrollBlocked: false,
    logo: `
      <svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 1189.5 252" style="enable-background:new 0 0 1189.5 252;" xml:space="preserve"><polygon points="5.5,47.3 121.8,3 240,47.3 122.8,100.8 "/><polygon points="4,55.5 118.8,108.8 118.8,249 4,192.8 "/><polygon points="125,108.3 240,55.5 240,192 125,249 "/><g><path d="M356,92.2h11.8l47.4,74.5c1.2,1.9-0.2,4.3-2.4,4.3h-11.3c-1.1,0-2.2-0.6-2.8-1.5l-13.8-21.4l-46.2-0.2l-13.7,22 c-0.4,0.7-1.1,1-1.9,1h-12.3c-2.3,0-3.7-2.6-2.5-4.5L356,92.2z M379.1,135.8L361.4,109l-16.3,26.9L379.1,135.8z"/><path d="M425.7,167.4V92.2h48.8c5.1,0,9.8,0.8,14.1,2.3c4.3,1.5,8,3.5,11.1,6s5.5,5.3,7.3,8.4s2.6,6.3,2.6,9.5 c0,5.1-1.8,9.8-5.4,13.9c-3.6,4.2-8.4,7.2-14.5,9l23.8,25c1.7,1.8,0.4,4.7-2,4.7H498c-0.8,0-1.6-0.3-2.1-0.9l-24.1-25.5h-28.6 l0.1,23.1c0,1.8-1.5,3.3-3.3,3.3h-10.6C427.3,171,425.7,169.4,425.7,167.4z M443.1,131.2H474c2,0,9.8-0.3,11.5-1s3.2-1.6,4.4-2.7 c1.2-1.1,2.2-2.5,3-4.1c0.7-1.6,1.1-3.2,1.1-5s-0.4-3.6-1.2-5.1c-0.8-1.6-1.9-2.9-3.3-4.1c-1.4-1.1-3-2-4.8-2.7 c-1.8-0.6-9.7-0.9-11.5-0.9H443L443.1,131.2z"/><path d="M899.7,167.4V92.2h48.8c5.1,0,9.8,0.8,14.1,2.3s8,3.5,11.1,6s5.5,5.3,7.3,8.4s2.6,6.3,2.6,9.5c0,5.1-1.8,9.8-5.4,13.9 c-3.6,4.2-8.4,7.2-14.5,9l23.8,25c1.7,1.8,0.4,4.7-2,4.7H972c-0.8,0-1.6-0.3-2.1-0.9l-24.1-25.5h-28.6l0.1,23.1 c0,1.8-1.5,3.3-3.3,3.3h-10.6C901.3,171,899.7,169.4,899.7,167.4z M917.1,131.2H948c2,0,9.8-0.3,11.5-1s3.2-1.6,4.4-2.7 c1.2-1.1,2.2-2.5,3-4.1c0.7-1.6,1.1-3.2,1.1-5s-0.4-3.6-1.2-5.1c-0.8-1.6-1.9-2.9-3.3-4.1c-1.4-1.1-3-2-4.8-2.7 c-1.8-0.6-9.7-0.9-11.5-0.9H917L917.1,131.2z"/><path d="M606.5,104.2l-35.3,0.2l0.1,63c0,2-1.7,3.7-3.7,3.7h-9.8c-2,0-3.6-1.6-3.6-3.6l0.2-63.2l-35.3,0.2c-2.3,0-4.3-0.6-4.3-2.8 v-5.9c0-1.9,1.5-3.4,3.4-3.4h89.3c1.9,0,3.5,1.6,3.5,3.5v5.5C610.8,103.6,609,104.2,606.5,104.2z"/><path d="M754.3,167.8v-51.3l-34.7,39.7c-0.8,1-2,1.5-3.3,1.5h-4.1c-1.3,0-2.5-0.6-3.4-1.5l-35-39l-0.2,50.8c0,1.7-1.4,3.1-3.1,3.1 h-10.1c-1.7,0-3-1.3-3-3V94.8c0-1.4,1.2-2.6,2.6-2.6h13.1l41.5,46.6l41-46.6h13.1c1.7,0,3.1,1.4,3.1,3.1v72.3 c0,1.9-1.5,3.4-3.4,3.4h-11C755.8,171,754.3,169.6,754.3,167.8z"/><path d="M831.3,92.2h9.4c0.9,0,1.8,0.5,2.3,1.3l45.5,72.3c1.4,2.3-0.2,5.3-2.9,5.3h-8.7c-2.1,0-4.1-1.1-5.3-2.8L859,148.7 c-0.5-0.8-1.4-1.2-2.3-1.2l-43.1-0.2c-1,0-1.9,0.5-2.4,1.4l-12.3,21c-0.5,0.8-1.4,1.4-2.4,1.4H785c-2.3,0-3.7-2.5-2.4-4.5L829,93.5 C829.5,92.7,830.4,92.2,831.3,92.2z M852,135.3l-16.1-26c0-0.1-0.1-0.1-0.1,0l-16.2,26.2c-0.1,0.2,0,0.4,0.2,0.4l31.9-0.1 C852,135.8,852.1,135.5,852,135.3z"/><path d="M1000.8,167.4l0.3-71.5c0-2,1.6-3.6,3.6-3.6h10.1c1.8,0,3.3,1.5,3.3,3.3l0.2,36l56.8-39.4h14.1c2.5,0,3.6,3.2,1.5,4.7 l-42,30.2l43.8,37.8c2.4,2.1,0.9,6-2.2,6h-10.7c-1.1,0-2.2-0.4-3.1-1.2l-39.9-35.3l-18,12.3v20.5c0,2-1.6,3.7-3.7,3.7h-10.6 C1002.4,171,1000.8,169.4,1000.8,167.4z"/><path d="M1179.3,110.1c-1,1.1-2.5,1.5-3.9,1.1c-1-0.3-2.2-0.7-3.2-1.1c-1.9-0.9-4.2-1.8-7-2.6c-2.7-0.8-5.7-1.6-8.9-2.2 c-3.2-0.6-11.5-0.9-14.8-0.9c-5.9,0-10.2,1.1-13.2,2.3c-3.7,1.5-6.9,3.6-7.4,6.5c-0.2,1.6,0.5,4.1,1.6,5.1 c3.8,3.1,10.6,4.2,12.7,4.8c2.4,0.7,5.8,1.2,9,1.9c3.2,0.7,6.4,1.1,10.5,1.8c5.4,1,10.1,1.6,14.5,2.8s7.6,1.8,10.7,3.6 s5.4,3.9,7.1,6.4s2.5,5.5,2.5,9.2c0,4.2-1.1,7.8-3.3,10.8c-2.2,3-5.2,5.4-9,7.3c-3.8,1.9-8.1,3.2-13.1,4.1 c-4.9,0.8-10.1,1.3-15.5,1.3c-8.3,0-16.5-0.9-24.5-2.7c-7.3-1.6-16.4-5.4-22.8-8.6c-1.7-0.8-2.3-3-1.2-4.6l3.8-5.4 c1.6-2.3,3.4-2.9,8.2-1c0.3,0.1,0.5,0.2,0.8,0.4c2.4,1.1,9.3,3.1,12.6,4.2c3.3,1.1,7,2,11,2.7s8.2,1.1,12.4,1.1 c11.8,0,23.7-2.7,23.7-8.1c0-1.7-0.7-3.1-2-4.3s-3.3-2.2-5.7-3.1c-2.5-0.9-5.5-1.7-9-2.4s-7.7-1.1-12-2c-5.3-1-15.7-2.6-19.5-3.8 c-3.9-1.2-10.1-2.7-12.7-4.3c-2.6-1.7-4.5-3.6-5.8-5.8c-1.3-2.2-1.9-4.8-1.9-7.8c0-4,1-7.5,3.1-10.7c2.1-3.1,5.6-6.3,9.3-8.4 c3.7-2.1,8.4-3.7,13.3-4.8c4.9-1.1,11.2-1.3,16.8-1.3c7.8,0,15.6,1.2,22.2,3c5,1.3,10.6,3.6,15.1,5.6c1.9,0.9,2.8,3,1,4.9 L1179.3,110.1z"/></g></svg>
    `,
    modals: {
      showCallbackModal: false,
      showProjectModal: false,
      showQuestionModal: false,
      showRequestModal: false,
      requestThankModal: {
        show: false,
        msg: {
          title: 'Заявка принята!',
          descr:
            '<p>В ближайшее время с Вами свяжется администратор. Спасибо, что выбрали Art-Marks!</p>'
        }
      }
    },
    footer: {
      info: {
        copyright: {
          values: [
            '© 2016-2018 Web-студия Art-Marks<br> Создание и продвижение сайтов.'
          ]
        },
        address: {
          title: 'Адрес:',
          values: ['г. Харьков, ул. Кузнечная, 9']
        },
        schedule: {
          title: 'график работы:',
          values: ['Пн-Пт: 09:00-18:00', 'Сб-Вс: выходные']
        }
      },
      contacts: {
        title: 'контакты',
        phones: {
          title: 'телефоны:',
          items: ['(096) 600-47-56', '(099) 517-60-86', '(063) 944-54-90']
        },
        email: {
          title: 'email:',
          values: [
            {
              type: 'link',
              value: 'info@art-marks.net',
              href: 'mailto:info@art-marks.net'
            }
          ]
        },
        skype: {
          title: 'skype:',
          values: [
            {
              type: 'link',
              value: 'artmarks.ua',
              href: 'skype:artmarks.ua?chat'
            }
          ]
        }
      },
      services: {
        title: 'Услуги',
        menu: [
          {
            text: 'Web разработка',
            link: '/services/web'
          },
          {
            text: 'SEO продвижение',
            link: '/services/web'
          },
          {
            text: 'SMM продвижение',
            link: '/services/web'
          },
          {
            text: 'PPC',
            link: '/services/web'
          },
          {
            text: 'Маркетинг',
            link: '/services/web'
          }
        ]
      },
      briefs: {
        title: 'брифы',
        menu: [
          {
            text: 'Бриф на разработку сайта',
            link: '#'
          },
          {
            text: 'Бриф на разработку интернет-магазина',
            link: '#'
          },
          {
            text: 'Бриф на разработку landing page',
            link: '#'
          },
          {
            text: 'Бриф на фирменный стиль',
            link: '#'
          },
          {
            text: 'Бриф на контекстную рекламу',
            link: '#'
          },
          {
            text: 'Бриф на SEO продвижение',
            link: '#'
          },
          {
            text: 'Бриф на SMM продвижение',
            link: '#'
          }
        ]
      },
      informations: {
        title: 'Информация',
        menu: [
          {
            text: 'Портфолио',
            link: '/portfolio'
          },
          {
            text: 'Клиенты',
            link: '/clients'
          },
          {
            text: 'О студии',
            link: '/about'
          },
          {
            text: 'Контакты',
            link: '/contacts'
          },
          {
            text: 'Брифы',
            link: '/briefs'
          }
        ]
      }
    },
    siteMap: {
      services: {
        text: 'Услуги',
        link: '/services',
        inner: {
          web: {
            text: 'WEB разработка',
            link: '#1',
            inner: {
              ecommerce: {
                text: 'Ecommerce',
                link: '/ecommerce'
              }
            }
          },
          seo: {
            text: 'WEB разработка',
            link: '#1'
          },
          smm: {
            text: 'WEB разработка',
            link: '#1'
          },
          ppc: {
            text: 'WEB разработка',
            link: '#1'
          },
          marketing: {
            text: 'WEB разработка',
            link: '#1'
          }
        }
      },
      portfolio: {
        text: 'Портфолио',
        link: '/portfolio'
      },
      blog: {
        text: 'Блог',
        link: '/blog'
      },
      about: {
        text: 'О студии',
        link: '/about'
      },
      contacts: {
        text: 'Контакты',
        link: '/contacts'
      }
    },
    sidebar: {
      isOpened: false,
      data: {
        socials: [
          {
            icon:
              '<svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 24 24" style="enable-background:new 0 0 24 24;" xml:space="preserve"><linearGradient id="blue-gradient"><stop offset="0%" stop-color="#2f8bda"/><stop offset="100%" stop-color="#00abd3"/></linearGradient><path d="M19,0H5C2.2,0,0,2.3,0,5v14c0,2.8,2.2,5,5,5h14c2.8,0,5-2.2,5-5V5C24,2.3,21.8,0,19,0z M16,7h-1.9C13.5,7,13,7.3,13,7.9V9h3 l-0.2,3H13v8h-3v-8H8V9h2V7.1c0-2,1.1-3.1,3.5-3.1H16V7z"/></svg>',
            url: 'https://www.facebook.com/artmarks.net/'
          },
          {
            icon:
              '<svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 24 24" style="enable-background:new 0 0 24 24;" xml:space="preserve"><path d="M15.2,5.5c-0.8,0-1.1,0-3.2,0s-2.4,0-3.2,0C6.6,5.6,5.6,6.7,5.5,8.8c0,0.8,0,1.1,0,3.2s0,2.4,0,3.2c0.1,2.1,1.1,3.2,3.3,3.3 c0.8,0,1.1,0,3.2,0c2.1,0,2.4,0,3.2,0c2.2-0.1,3.2-1.1,3.3-3.3c0-0.8,0-1.1,0-3.2s0-2.4,0-3.2C18.4,6.7,17.4,5.6,15.2,5.5z M12,16.2 c-2.3,0-4.1-1.8-4.1-4.1S9.7,7.9,12,7.9s4.1,1.8,4.1,4.1S14.3,16.2,12,16.2z M16.3,8.7c-0.5,0-1-0.4-1-1s0.4-1,1-1c0.5,0,1,0.4,1,1 C17.2,8.3,16.8,8.7,16.3,8.7z M14.7,12c0,1.5-1.2,2.7-2.7,2.7S9.3,13.5,9.3,12s1.2-2.7,2.7-2.7S14.7,10.6,14.7,12z M19,0H5 C2.2,0,0,2.3,0,5v14c0,2.8,2.2,5,5,5h14c2.8,0,5-2.2,5-5V5C24,2.3,21.8,0,19,0z M20,15.3c-0.1,2.9-1.8,4.5-4.7,4.7 c-0.9,0-1.1,0-3.3,0s-2.4,0-3.3,0c-2.9-0.1-4.5-1.7-4.7-4.7c0-0.9,0-1.1,0-3.3c0-2.2,0-2.4,0-3.3c0.1-2.9,1.7-4.5,4.7-4.7 c0.9,0,1.1,0,3.3,0s2.4,0,3.3,0c2.9,0.1,4.5,1.8,4.7,4.7c0,0.9,0,1.1,0,3.3C20,14.2,20,14.5,20,15.3z"/></svg>',
            url: 'https://www.instagram.com/artmarks.ua/'
          },
          {
            icon:
              '<svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 24 24.1" style="enable-background:new 0 0 24 24.1;" xml:space="preserve"><path d="M19,0.1H5c-2.8,0-5,2.2-5,5v14c0,2.8,2.2,5,5,5h14c2.8,0,5-2.2,5-5v-14C24,2.3,21.8,0.1,19,0.1z M8,19.1H5v-11h3V19.1z M6.5,6.8c-1,0-1.8-0.8-1.8-1.8s0.8-1.8,1.8-1.8s1.8,0.8,1.8,1.8S7.5,6.8,6.5,6.8z M20,19.1h-3v-5.6c0-3.4-4-3.1-4,0v5.6h-3v-11h3 v1.8c1.4-2.6,7-2.8,7,2.5V19.1z"/></svg>',
            url: 'https://www.linkedin.com/company/artmarks-net/about/'
          },
          {
            icon:
              '<svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 24 24.1" style="enable-background:new 0 0 24 24.1;" xml:space="preserve"><path d="M8.2,15.1H6v-2h2.3C10.1,13.1,10.3,15.1,8.2,15.1z M15,12.4h3C17.9,10.7,15.3,10.4,15,12.4z M8.2,9.1H6v2h2.4 C10.1,11.1,10.3,9.1,8.2,9.1z M24,5.1v14c0,2.8-2.2,5-5,5H5c-2.8,0-5-2.2-5-5v-14c0-2.8,2.2-5,5-5h14C21.8,0.1,24,2.3,24,5.1z M14,8.1h5v-1h-5V8.1z M10.4,11.7c1.9-1,1.8-4.6-1.8-4.6H4v10h4.3C12.8,17.1,12.8,12.5,10.4,11.7z M19.9,12.3 c-0.3-1.8-1.5-2.9-3.6-2.9c-2.1,0-3.4,1.3-3.4,3.9c0,2.6,1.4,3.8,3.4,3.8s3.1-1.1,3.4-2h-2.1c-0.7,0.9-2.9,0.5-2.8-1.4H20 C20,13.1,20,12.6,19.9,12.3z"/></svg>',
            url: 'https://www.behance.net/ArtMarksweb-studio'
          }
        ],
        menu: [
          {
            text: 'Услуги',
            link: '/services',
            size: 'big',
            showMobile: true,
            inner: [
              {
                text: 'WEB разработка',
                link: '/services/web'
              },
              {
                text: 'SEO продвижение',
                link: '/services/web'
              },
              {
                text: 'SMM продвижение',
                link: '/services/web'
              },
              {
                text: 'PPC',
                link: '/services/web'
              },
              {
                text: 'Маркетинг',
                link: '/services/web'
              }
            ]
          },
          {
            text: 'Портфолио',
            link: '/portfolio',
            size: 'big',
            showMobile: true,
            inner: [
              {
                text: 'Кейсы WEB',
                link: '/portfolio'
              },
              {
                text: 'Кейсы SEO',
                link: '/portfolio'
              },
              {
                text: 'Кейсы SMM',
                link: '/portfolio'
              }
            ]
          },
          {
            text: 'Контакты',
            link: '/contacts',
            size: 'big'
          },
          {
            text: 'Брифы',
            link: '/briefs',
            size: 'small'
          },
          {
            text: 'Блог',
            link: '/blog',
            size: 'small',
            showMobile: true,
            inner: [
              {
                text: 'Статьи WEB',
                link: '/blog'
              },
              {
                text: 'Статьи SEO',
                link: '/blog'
              },
              {
                text: 'Статьи SMM',
                link: '/blog'
              }
            ]
          },
          {
            text: 'О студии',
            link: '/about',
            size: 'small',
            showMobile: true,
            inner: [
              {
                text: 'Наша команда',
                link: '/about/team'
              },
              {
                text: 'Наши офисы',
                link: '/about/office'
              },
              {
                text: 'Наши награды',
                link: '/about/awards'
              }
            ]
          }
        ],
        toggler: {
          text: 'меню'
        },
        arrow: {
          text: 'вверх'
        },
        buttons: {
          sideBarButtons: {
            messenger: {
              text: 'messenger',
              icon:
                '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path d="M256.064 0h-.128C114.784 0 0 114.816 0 256c0 56 18.048 107.904 48.736 150.048l-31.904 95.104 98.4-31.456C155.712 496.512 204 512 256.064 512 397.216 512 512 397.152 512 256S397.216 0 256.064 0zm148.96 361.504c-6.176 17.44-30.688 31.904-50.24 36.128-13.376 2.848-30.848 5.12-89.664-19.264-75.232-31.168-123.68-107.616-127.456-112.576-3.616-4.96-30.4-40.48-30.4-77.216s18.656-54.624 26.176-62.304c6.176-6.304 16.384-9.184 26.176-9.184 3.168 0 6.016.16 8.576.288 7.52.32 11.296.768 16.256 12.64 6.176 14.88 21.216 51.616 23.008 55.392 1.824 3.776 3.648 8.896 1.088 13.856-2.4 5.12-4.512 7.392-8.288 11.744-3.776 4.352-7.36 7.68-11.136 12.352-3.456 4.064-7.36 8.416-3.008 15.936 4.352 7.36 19.392 31.904 41.536 51.616 28.576 25.44 51.744 33.568 60.032 37.024 6.176 2.56 13.536 1.952 18.048-2.848 5.728-6.176 12.8-16.416 20-26.496 5.12-7.232 11.584-8.128 18.368-5.568 6.912 2.4 43.488 20.48 51.008 24.224 7.52 3.776 12.48 5.568 14.304 8.736 1.792 3.168 1.792 18.048-4.384 35.52z"/></svg>',
              href: 'https://wa.me/1583024635344026'
            },
            telegram: {
              text: 'telegram',
              icon:
                '<svg version="1.1" xmlns:serif="http://www.serif.com/" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 24 20" style="enable-background:new 0 0 24 20;" xml:space="preserve"><path d="M23.7,0.2c-0.2-0.2-0.5-0.2-0.8-0.1C18.7,1.6,5.8,6.4,0.5,8.4C0.2,8.5,0,8.8,0,9.2C0,9.6,0.3,9.9,0.6,10 c2.4,0.7,5.5,1.7,5.5,1.7s1.5,4.4,2.2,6.6c0.1,0.3,0.3,0.5,0.6,0.6c0.3,0.1,0.6,0,0.8-0.2c1.2-1.1,3.1-2.9,3.1-2.9s3.6,2.6,5.6,4.1 c0.3,0.2,0.7,0.3,1.1,0.1c0.4-0.1,0.6-0.5,0.7-0.8c0.9-4.1,3-14.4,3.8-18.1C24,0.7,23.9,0.4,23.7,0.2z M19.6,3.9 c-3.7,3.3-10.2,9.2-10.2,9.2l-0.4,3.5l-1.7-5.5c0,0,7.6-4.9,11.9-7.6c0.1-0.1,0.3-0.1,0.4,0.1C19.7,3.7,19.7,3.8,19.6,3.9z"/></svg>',
              href: 'https://t.me/wezombot'
            },
            message: {
              text: 'message',
              icon:
                '<svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 67 60.1" style="enable-background:new 0 0 67 60.1;" xml:space="preserve"><path d="M64.1,26.1H51.6V3.2c0-1.8-1.5-3.2-3.2-3.2H3.2C1.4,0,0,1.4,0,3.2v31.9c0,1.8,1.4,3.2,3.2,3.2h1.5c0.1,0,0.2,0.1,0.2,0.2 L5.1,43c0.1,1.2,0.8,2.3,2,2.8C7.5,46,7.9,46,8.4,46c0.8,0,1.5-0.3,2.1-0.8l0.1-0.2l5.6-6.7c0,0,0.1,0,0.1,0h8.8v13.4 c0,1.5,1.3,2.8,2.8,2.8c0,0,0,0,0.1,0h25.5l4.4,4.7l0.2,0.2c0.5,0.4,1.2,0.6,1.8,0.6c0.4,0,0.9-0.1,1.3-0.3c0.9-0.4,1.6-1.3,1.7-2.3 l0.1-2.9h1.1c1.5,0,2.8-1.2,2.9-2.7c0,0,0,0,0-0.1v-23C66.9,27.3,65.7,26.1,64.1,26.1z M14.2,36.2l-0.2,0.2L8.5,43 c-0.1,0-0.1,0-0.2,0c-0.1,0-0.1-0.1-0.1-0.2L8,38.4c-0.1-1.7-1.5-3-3.2-3H3.2c-0.1,0-0.2-0.1-0.2-0.2c0,0,0,0,0,0V3.2 C3,3.1,3.1,3,3.2,3h45.1c0.1,0,0.2,0.1,0.2,0.2c0,0,0,0,0,0v31.9c0,0.1-0.1,0.2-0.2,0.2c0,0,0,0,0,0h-32 C15.6,35.4,14.8,35.6,14.2,36.2z M64,51.5h-1.1c-1.5,0-2.8,1.1-2.9,2.6l-0.1,2.8l-4.3-4.6l-0.2-0.1c-0.5-0.4-1.2-0.7-1.9-0.7H28.2 V38.3h20.2c1.8,0,3.2-1.5,3.2-3.2v-6H64V51.5z"/></svg>',
              href: '#'
            },
            phone: {
              text: 'phone',
              icon:
                '<svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 19 19" style="enable-background:new 0 0 19 19;" xml:space="preserve"><g><g><rect x="-2.5" y="-2.5" style="fill: none;" width="24" height="24"/><path d="M11.6,13.1c0.3-0.3,0.3-0.3,0.7-0.7c0.3-0.3,0.6-0.6,0.8-0.8c0.9-0.8,2-0.9,2.9,0c0.8,0.8,1.6,1.6,2.4,2.4 c0.9,0.9,0.9,2,0,2.9c-0.2,0.2-0.5,0.4-0.8,0.6c-0.1,0.1-0.2,0.1-0.3,0.2c-0.3,0.2-0.5,0.3-0.8,0.5c-0.2,0.1-0.3,0.2-0.4,0.2 c-1,0.6-2.6,0.7-3.6,0.3c-0.1,0-0.3-0.1-0.5-0.2c-0.4-0.2-0.9-0.4-1.4-0.6c-1.4-0.7-2.9-1.6-4.2-2.7c-0.5-0.4-1-0.9-1.5-1.4 c-0.4-0.4-0.8-0.8-1.1-1.3c-1.2-1.4-2.1-3-2.8-4.5C0.7,7.5,0.5,7,0.4,6.6C0.3,6.3,0.2,6.1,0.2,6C-0.2,5,0,3.3,0.7,2.4 c0-0.1,0.1-0.2,0.2-0.3C1,1.9,1.2,1.6,1.4,1.4c0.1-0.1,0.1-0.2,0.2-0.3C1.7,0.9,1.9,0.8,2,0.6c0.9-0.8,2-0.8,2.9,0 C5.2,1,6.7,2.5,7.3,3c0.9,0.9,0.9,2,0,2.9C7.2,6.1,6.9,6.4,6.5,6.8C6.1,7.1,6.1,7.1,5.9,7.4C5.7,7.6,5.7,7.6,5.6,7.6 C5.7,7.8,5.8,8,5.9,8.3c0.2,0.5,0.5,1.1,0.8,1.6c0.3,0.5,0.7,1,1.1,1.4c0.3,0.3,0.7,0.6,1.2,0.9c0.5,0.4,1.1,0.7,1.7,0.9 c0.3,0.1,0.5,0.2,0.7,0.3C11.4,13.4,11.4,13.3,11.6,13.1z M5.6,7.6C5.6,7.6,5.6,7.6,5.6,7.6C5.6,7.6,5.6,7.6,5.6,7.6z M17.6,14.8 c-0.8-0.8-1.6-1.6-2.4-2.4c-0.5-0.5-1-0.5-1.5,0c-0.2,0.2-0.4,0.4-0.8,0.8c-0.4,0.4-0.4,0.4-0.7,0.7c-0.2,0.2-0.2,0.2-0.3,0.3 c-0.2,0.2-0.7,0.3-1,0.2c-0.2-0.1-0.5-0.2-0.8-0.4c-0.6-0.3-1.2-0.6-1.8-1c-0.5-0.3-0.9-0.7-1.3-1.1c-0.4-0.4-0.8-0.9-1.2-1.5 C5.6,9.8,5.3,9.3,5,8.7C4.8,8.4,4.7,8.1,4.7,7.9c-0.1-0.3,0-0.7,0.2-1c0.1-0.1,0.1-0.1,0.3-0.3c0.3-0.3,0.3-0.3,0.6-0.6 c0.4-0.4,0.7-0.7,0.8-0.8c0.5-0.5,0.5-1,0-1.5C6,3.2,4.5,1.7,4.2,1.3c-0.5-0.5-1-0.5-1.5,0C2.6,1.4,2.5,1.6,2.3,1.8 C2.3,1.9,2.2,1.9,2.2,2C2,2.2,1.8,2.4,1.7,2.7C1.6,2.8,1.5,2.9,1.5,3C1,3.7,0.9,4.9,1.1,5.7c0,0.1,0.1,0.3,0.2,0.5 c0.1,0.4,0.3,0.9,0.6,1.4c0.7,1.5,1.5,2.9,2.6,4.3c0.3,0.4,0.7,0.8,1.1,1.2C6,13.7,6.5,14.1,7,14.5c1.3,1.1,2.6,1.9,4,2.6 c0.5,0.2,0.9,0.4,1.3,0.6c0.2,0.1,0.4,0.1,0.5,0.2c0.8,0.3,2.1,0.2,2.8-0.2c0.1,0,0.2-0.1,0.3-0.2c0.3-0.1,0.5-0.3,0.8-0.5 c0.1-0.1,0.2-0.1,0.3-0.2c0.3-0.2,0.6-0.4,0.7-0.5C18.1,15.8,18.1,15.3,17.6,14.8z"/></g></g></svg>',
              href: '#'
            }
          }
        },
        languages: [
          {
            text: 'ru',
            isActive: true
          },
          {
            text: 'ua',
            isActive: false
          },
          {
            text: 'en',
            isActive: false
          }
        ]
      }
    },
    header: {
      headerFormContent: {
        caption: {
          text: 'Оставить заявку'
        },
        inputs: {
          name: {
            placeholder: 'Имя',
            required: true
          },
          phone: {
            placeholder: 'Телефон',
            required: true,
            mask: '+38 (0##)-###-##-##'
          },
          email: {
            placeholder: 'E-mail',
            required: true
          },
          text: {
            placeholder: 'Расскажите об идеи',
            required: true
          },
          file: {
            placeholder: 'Добавить файл',
            required: false,
            multiple: true,
            label: 'Добавить файл',
            loaded: 'Загружено'
          }
        },
        btn: {
          text: 'ОТПРАВИТЬ'
        }
      },
      sidebarFormContent: {
        caption: {
          text: 'Хотите мы Вам перезвоним?'
        },
        inputs: {
          name: {
            placeholder: 'Имя',
            required: true
          },
          phone: {
            placeholder: 'Телефон',
            required: true,
            mask: '+38 (0##)-###-##-##'
          }
        },
        btn: {
          text: 'жду звонка'
        }
      },
      menu: [
        {
          text: 'Услуги',
          link: '/services',
          inner: [
            {
              text: 'WEB разработка',
              link: '/services/web'
            },
            {
              text: 'SEO продвижение',
              link: '/services/web'
            },
            {
              text: 'SMM продвижение',
              link: '/services/web'
            },
            {
              text: 'PPC',
              link: '/services/web'
            },
            {
              text: 'Маркетинг',
              link: '/services/web'
            }
          ]
        },
        {
          text: 'Портфолио',
          link: '/portfolio',
          inner: [
            {
              text: 'Кейсы WEB',
              link: '/portfolio'
            },
            {
              text: 'Кейсы SEO',
              link: '/portfolio'
            },
            {
              text: 'Кейсы SMM',
              link: '/portfolio'
            }
          ]
        },
        {
          text: 'Блог',
          link: '/blog',
          inner: [
            {
              text: 'Статьи WEB',
              link: '/blog'
            },
            {
              text: 'Статьи SEO',
              link: '/blog'
            },
            {
              text: 'Статьи SMM',
              link: '/blog'
            }
          ]
        },
        {
          text: 'О студии',
          link: '/about',
          inner: [
            {
              text: 'Наша команда',
              link: '/about/team'
            },
            {
              text: 'Наши офисы',
              link: '/about/office'
            },
            {
              text: 'Наши награды',
              link: '/about/awards'
            }
          ]
        },
        {
          text: 'Контакты',
          link: '/contacts'
        }
      ],
      phones: ['(096) 600-47-56', '(063) 944-54-90'],
      btn: {
        type: 'button',
        text: 'оставить заявку'
      }
    }
  },
  mutations: {
    showProjectModal(state) {
      state.modals.showProjectModal = true;
    },
    closeProjectModal(state) {
      state.modals.showProjectModal = false;
    },

    showQuestionModal(state) {
      state.modals.showQuestionModal = true;
    },
    closeQuestionModal(state) {
      state.modals.showQuestionModal = false;
    },

    showCallbackModal(state) {
      state.modals.showCallbackModal = true;
    },
    closeCallbackModal(state) {
      state.modals.showCallbackModal = false;
    },

    showRequestModal(state) {
      state.modals.showRequestModal = true;
    },
    closeRequestModal(state) {
      state.modals.showRequestModal = false;
    },

    blockScroll(state) {
      state.isScrollBlocked = true;
    },
    toggleScroll(state) {
      state.isScrollBlocked = !state.isScrollBlocked;
    },
    allowScroll(state) {
      state.isScrollBlocked = false;
    },

    closeSidebar(state) {
      state.sidebar.isOpened = false;
    },
    toggleSidebar(state) {
      state.sidebar.isOpened = !state.sidebar.isOpened;
    },

    hideRequestThankModal(state) {
      state.modals.requestThankModal.show = false;
    },
    showRequestThankModal(state) {
      state.modals.requestThankModal.show = true;
    }
  }
};

const discussProject = {
  state: {
    caption: {
      text: 'обсудить проект',
      subtext: 'Все крутые проекты начинаются с заполнения этой формы'
    },
    inputs: {
      name: {
        placeholder: 'Имя',
        required: true
      },
      phone: {
        placeholder: 'Телефон',
        required: true,
        mask: '+38 (0##)-###-##-##'
      },
      email: {
        placeholder: 'E-mail',
        required: true
      },
      text: {
        placeholder: 'Опишите свою идею',
        required: true
      },
      file: {
        placeholder: 'Добавить файл',
        required: false,
        multiple: true,
        label: 'Добавить файл',
        loaded: 'Загружено'
      }
    },
    btn: {
      text: 'ОТПРАВИТЬ'
    }
  }
};

const servicesCategoryPage = {
  state: {
    pageTitle: 'WEB',
    img: {
      src: 'img/s-services_art-marks.png',
      alt: 'ArtMarks'
    },
    caption: {
      text: 'WEB',
      content: `
            <p>Мы разрабатываем проекты с нуля, а также берем на редизайн и развитие сайты, от которых вы хотели бы большего. Наши специалисты внимательно следят за развитием современных технологий. Они постоянно повышают знания в этой отрасли, чтобы быть в курсе всех тенденций в мире IT.</p>
            <p>Постоянно поддерживаем связь с клиентами и учитываем все их пожелания. Наши решения помогают развиться бизнесу любого направления.</p>
          `
    },
    items: [
      {
        title: 'Комплексное<br> решение',
        descr:
          '<p>Не просто сайт, а готовое решение для бизнеса за 24 дня с гарантией получения заказов</p>',
        btn: {
          text: 'Узнать больше',
          icon:
            '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
          link: '/services/web/ecommerce'
        }
      },
      {
        title: 'РАЗРАБОТКА<br> ИНТЕРНЕТ-МАГАЗИНА',
        descr:
          '<p>Не просто сайт, а готовое решение для бизнеса за 24 дня с гарантией получения заказов</p>',
        btn: {
          text: 'Узнать больше',
          icon:
            '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
          link: '/services/web/ecommerce'
        }
      },
      {
        title: 'РАЗРАБОТКА<br> САЙТА КОМПАНИИ',
        descr:
          '<p>Не просто сайт, а готовое решение для бизнеса за 24 дня с гарантией получения заказов</p>',
        btn: {
          text: 'Узнать больше',
          icon:
            '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
          link: '/services/web/ecommerce'
        }
      },
      {
        title: 'РАЗРАБОТКА<br> КАТАЛОГА',
        descr:
          '<p>Не просто сайт, а готовое решение для бизнеса за 24 дня с гарантией получения заказов</p>',
        btn: {
          text: 'Узнать больше',
          icon:
            '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
          link: '/services/web/ecommerce'
        }
      },
      {
        title: 'РАЗРАБОТКА<br> LANDING PAGE',
        descr:
          '<p>Не просто сайт, а готовое решение для бизнеса за 24 дня с гарантией получения заказов</p>',
        btn: {
          text: 'Узнать больше',
          icon:
            '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
          link: '/services/web/ecommerce'
        }
      },
      {
        title: 'ТЕХНИЧЕСКАЯ<br> ПОДДЕРЖКА',
        descr:
          '<p>Не просто сайт, а готовое решение для бизнеса за 24 дня с гарантией получения заказов</p>',
        btn: {
          text: 'Узнать больше',
          icon:
            '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
          link: '/services/web/ecommerce'
        }
      }
    ],
    process: {
      caption: {
        text: 'ПРОЦЕСС РАБОТЫ'
      },
      items: [
        {
          icon: `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 57.4 56.7"><path d="M16.7 5c-5 0-9 4-9 9s4 9 9 9c1.9 0 3.7-.6 5.1-1.6l3.1 3.3c.2.2.4.3.7.3.6 0 1-.4 1-1 0-.3-.1-.5-.3-.7L23.2 20c1.5-1.6 2.4-3.7 2.4-6.1C25.7 9 21.7 5 16.7 5zm-7 9c0-3.9 3.1-7 7-7s7 3.1 7 7-3.1 7-7 7-7-3.1-7-7z"/><path d="M16.7 28h37c.6 0 1-.4 1-1s-.4-1-1-1h-37c-6.6 0-12-5.4-12-12s5.4-12 12-12h37c.6 0 1-.4 1-1s-.4-1-1-1h-37C9 0 2.7 6.3 2.7 14s6.3 14 14 14zM57.4 55.3c-.2-.2-4.7-4.6-14.5-6.9.5-.8.8-1.6 1.1-2.4h.7c2.2 0 4-1.8 4-4s-1.8-4-4-4v2c1.1 0 2 .9 2 2s-.9 2-2 2h-.2c.1-.7.2-1.3.2-2h-2c0 6.6-6.3 12-14 12s-14-5.4-14-12h-2c0 .7.1 1.3.2 2h-.2c-1.1 0-2-.9-2-2s.9-2 2-2v-2c-2.2 0-4 1.8-4 4s1.8 4 4 4h.7c.3.8.7 1.7 1.1 2.4C4.7 50.7.2 55.1 0 55.3l1.4 1.4s4.6-4.5 14.4-6.5c2.9 3.5 7.6 5.8 12.9 5.8s10-2.3 12.9-5.8c9.7 2 14.3 6.5 14.4 6.5l1.4-1.4z"/><path d="M25.7 38v4c0 1.7 1.3 3 3 3s3-1.3 3-3v-4h-2v4c0 .6-.4 1-1 1s-1-.4-1-1v-4h-2zM37.1 47.8v-2c-6.9 0-7 5-7 5h2c0-.3.2-3 5-3z"/><circle cx="31.7" cy="20" r="1"/><circle cx="35.7" cy="20" r="1"/><circle cx="39.7" cy="20" r="1"/><circle cx="22.2" cy="36.5" r="1.5"/><circle cx="38.2" cy="36.5" r="1.5"/><path d="M41.2 31.2c-3.5-2.3-7-.1-7.1 0l1.1 1.7s2.5-1.6 4.9 0l1.1-1.7zM23.2 31.2c-3.5-2.3-7-.1-7.1 0l1.1 1.7s2.5-1.6 4.9 0l1.1-1.7z"/></svg>`,
          title: 'ИССЛЕДОВАНИЯ',
          text:
            'Проводится анализ рынка в целом. Мониторинг всех возможных конкурентов'
        },
        {
          icon: `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 57.4 56.7"><path d="M57.4 55.3c-.2-.2-4.7-4.6-14.5-6.9.5-.8.8-1.6 1.1-2.4h.7c2.2 0 4-1.8 4-4s-1.8-4-4-4v2c1.1 0 2 .9 2 2s-.9 2-2 2h-.2c.1-.7.2-1.3.2-2h-2c0 6.6-6.3 12-14 12s-14-5.4-14-12h-2c0 .7.1 1.3.2 2h-.2c-1.1 0-2-.9-2-2s.9-2 2-2v-2c-2.2 0-4 1.8-4 4s1.8 4 4 4h.7c.3.8.7 1.7 1.1 2.4C4.7 50.7.2 55.1 0 55.3l1.4 1.4s4.6-4.5 14.4-6.5c2.9 3.5 7.6 5.8 12.9 5.8s10-2.3 12.9-5.8c9.7 2 14.3 6.5 14.4 6.5l1.4-1.4z"/><path d="M28.7 45c1.7 0 3-1.3 3-3v-4h-2v4c0 .6-.4 1-1 1s-1-.4-1-1v-4h-2v4c0 1.7 1.4 3 3 3zM41.3 32.1c-3.5-2.3-7-.1-7.1 0l1.1 1.7s2.5-1.6 4.9 0l1.1-1.7zM16.2 34.2l1.1 1.7s2.5-1.6 4.9 0l1.1-1.7c-3.6-2.4-7-.1-7.1 0z"/><circle cx="21.2" cy="38.5" r="1.5"/><circle cx="38.2" cy="38.5" r="1.5"/><path d="M37.7 46h-2c0 .3-.2 3-5 3v2c6.9 0 7-4.9 7-5zM11.7 27c.1 0 .2 0 .3-.1l6.9-2.3c.1 0 .3-.1.4-.2L37.4 6.7c.2-.2.3-.4.3-.7 0-.3-.1-.5-.3-.7l-5-5c-.2-.2-.4-.3-.7-.3-.3 0-.5.1-.7.3L13.3 18.4c-.1.1-.2.2-.2.4l-2.3 6.9c0 .1-.1.2-.1.3 0 .6.5 1 1 1zm1.6-2.6l1.2-3.5 2.3 2.3-3.5 1.2zm4.5-3L29.9 9.3l1 1-12.2 12-.9-.9zM16.3 20l-.9-1 12-12.2 1 1L16.3 20zM31.7 2.4L35.3 6l-3 2.9-3.5-3.5 2.9-3zM35.7 26c0-.6-.4-1-1-1h-14c-.6 0-1 .4-1 1s.4 1 1 1h14c.6 0 1-.4 1-1z"/><circle cx="38.7" cy="26" r="1"/><circle cx="42.7" cy="26" r="1"/><circle cx="46.7" cy="26" r="1"/></svg>`,
          title: 'дизайн',
          text:
            'Разрабатывается индивидуальный дизайн в соответствии с тематикой товаров или услуг'
        },
        {
          icon: `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 57.4 56.2"><path d="M8.5 21.7h2.1c.1.2.1.3.2.5l-1.5 1.5c-.9.9-.9 2.3 0 3.2l2.6 2.6c.8.8 2.3.8 3.2 0l1.5-1.5c.2.1.3.1.5.2v2.1c0 1.3 1 2.3 2.2 2.3H23c1.2 0 2.2-1 2.2-2.3v-2.1c.2-.1.3-.1.5-.2l1.5 1.5c.9.9 2.3.9 3.2 0l2.6-2.6c.9-.9.9-2.3 0-3.2l-1.5-1.5c.1-.2.1-.3.2-.5h2.1c1.3 0 2.3-1 2.3-2.2v-.8l1.9.9c.9.4 2 0 2.4-.8l.4-.9.3.9c.2.7.9 1.3 1.7 1.3.2 0 .4 0 .6-.1l2.3-.8c.5-.1.8-.5 1-.9.2-.4.3-.9.1-1.4l-.3-.9.9.4c.3.1.5.2.8.2.7 0 1.3-.4 1.6-1l1.1-2.2c.2-.4.2-.9.1-1.4-.2-.5-.5-.8-.9-1l-.9-.4.9-.3c.5-.2.8-.5 1.1-.9.2-.4.3-.9.1-1.4l-.8-2.3c-.3-.9-1.4-1.5-2.3-1.1l-.9.3.6-.9c.4-.9.1-2-.8-2.4L44.9.5c-.9-.4-2 0-2.4.8l-.4.9-.3-.9C41.5.4 40.4-.2 39.5.1l-2.3.8c-.5.1-.8.5-1 .9-.2.4-.3.9-.1 1.4l.3.9-.9-.4c-.9-.4-2-.1-2.4.8L32 6.6c-.1.1-.1.3-.1.4l-1.4-1.4c-.8-.8-2.3-.8-3.2 0l-1.5 1.5c-.2-.1-.3-.1-.5-.2V4.8c0-1.3-1-2.3-2.2-2.3h-3.7c-1.2 0-2.2 1-2.2 2.3v2.1c-.2.1-.3.1-.5.2l-1.5-1.5c-.9-.9-2.3-.9-3.2 0L9.3 8.3c-.4.4-.7 1-.7 1.6 0 .6.2 1.2.7 1.6l1.5 1.5c-.1.2-.1.3-.2.5H8.5c-1.3 0-2.3 1-2.3 2.2v3.7c0 1.2 1 2.3 2.3 2.3zM34.8 5.5l1.5.7c.4.2.9.1 1.2-.2.2-.2.5-.5.8-.7.4-.3.5-.7.4-1.1L38 2.7l1.9-.7.5 1.6c.1.4.6.7 1 .7.3 0 .6 0 .9.1.4.1.9-.1 1.1-.5l.7-1.5 1.9.9-.7 1.5c-.2.4-.1.9.2 1.2l.7.7c.2.3.7.5 1.1.3l1.6-.5.6 1.9-1.6.5c-.4.1-.7.5-.7 1 0 .3 0 .6-.1 1s.1.9.5 1.1l1.5.7-.9 1.8-1.5-.7c-.4-.2-.9-.1-1.2.2-.2.2-.5.5-.8.7-.4.3-.5.7-.4 1.1l.5 1.6-1.9.6-.5-1.6c-.1-.4-.6-.7-1-.7-.3 0-.6 0-.9-.1h-.2c-.4 0-.7.2-.9.6l-.7 1.5-1.7-1 .7-1.5c.2-.4.1-.9-.2-1.2-.3-.2-.5-.5-.7-.7-.3-.4-.7-.5-1.1-.4l-1.5.5h-.1l-.6-1.9 1.6-.5c.4-.1.7-.5.7-1 0-.3 0-.6.1-1 .1-.3-.1-.8-.5-1l-1.5-.7.9-1.8zM8.2 15.7c0-.1.1-.2.3-.2h2.8c.4 0 .8-.3 1-.7l.6-1.5c.2-.4.1-.9-.2-1.2l-2-2c-.1-.1-.1-.2-.1-.2s0-.1.1-.2L13.3 7c.1-.1.2-.1.4 0l2 2c.3.3.8.4 1.2.2.5-.3 1-.5 1.5-.6.4-.1.7-.5.7-1V4.8c0-.1.1-.3.2-.3H23c.1 0 .2.1.2.3v2.8c0 .4.3.8.7 1l1.5.6c.4.2.9.1 1.2-.2l2-2c.2-.2.3-.1.4 0l2.6 2.6c.1.1.1.1.1.2 0 0 0 .1-.1.2l-2 2c-.3.3-.4.8-.2 1.2.3.5.5 1 .6 1.5.1.4.5.7 1 .7h2.4c.2.1.4.1.6.1l.1.1v3.7c0 .1-.1.2-.3.2H31c-.4 0-.8.3-1 .7l-.6 1.5c-.2.4-.1.9.2 1.2l2 2c.1.1.1.3 0 .4L29 27.9c-.1.1-.2.1-.4 0l-2-2c-.3-.3-.8-.4-1.2-.2-.5.3-1 .5-1.5.6-.4.1-.7.5-.7 1v2.8c0 .2-.1.3-.2.3h-3.7c-.1 0-.2-.1-.2-.3v-2.8c0-.4-.3-.8-.7-1l-1.5-.6c-.1-.1-.3-.1-.5-.1-.3 0-.5.1-.7.3l-2 2c-.2.2-.3.1-.4 0l-2.6-2.6c-.1-.1-.1-.3 0-.4l2-2c.3-.3.4-.8.2-1.2-.3-.5-.5-1-.6-1.5-.1-.4-.5-.7-1-.7H8.5c-.1 0-.3-.1-.3-.2v-3.6z"/><path d="M21.2 24.2a6.7 6.7 0 1 0 0-13.4 6.7 6.7 0 0 0 0 13.4zm0-11.4c2.6 0 4.7 2.1 4.7 4.7s-2.1 4.7-4.7 4.7-4.7-2.1-4.7-4.7 2.1-4.7 4.7-4.7zM41.5 14.7c.5 0 1-.1 1.5-.2 2.4-.8 3.8-3.5 3-5.9-.6-1.9-2.4-3.2-4.4-3.2-.5 0-1 .1-1.5.2-2.4.8-3.8 3.5-3 5.9.6 1.9 2.4 3.2 4.4 3.2zm-.8-7.3c.3-.1.6-.1.8-.1 1.2 0 2.2.7 2.5 1.8.5 1.4-.3 2.9-1.7 3.4-.3.1-.6.1-.8.1-1.2 0-2.2-.7-2.5-1.8-.5-1.4.3-2.9 1.7-3.4zM57.4 54.8c-.2-.2-4.7-4.6-14.5-6.9.5-.8.8-1.6 1.1-2.4h.7c2.2 0 4-1.8 4-4s-1.8-4-4-4v2c1.1 0 2 .9 2 2s-.9 2-2 2h-.2c.1-.7.2-1.3.2-2h-2c0 6.6-6.3 12-14 12s-14-5.4-14-12h-2c0 .7.1 1.3.2 2h-.2c-1.1 0-2-.9-2-2s.9-2 2-2v-2c-2.2 0-4 1.8-4 4s1.8 4 4 4h.7c.3.8.7 1.7 1.1 2.4C4.7 50.2.2 54.6 0 54.8l1.4 1.4s4.6-4.5 14.4-6.5c2.9 3.5 7.6 5.8 12.9 5.8s10-2.3 12.9-5.8c9.7 2 14.3 6.5 14.4 6.5l1.4-1.4z"/><path d="M25.7 37.5v4c0 1.7 1.3 3 3 3s3-1.3 3-3v-4h-2v4c0 .6-.4 1-1 1s-1-.4-1-1v-4h-2zM37.7 45.5h-2c0 .3-.2 3-5 3v2c6.9 0 7-4.9 7-5zM21.7 39.5c1.1 0 2-.9 2-2h-4c0 1.1.9 2 2 2zM40.7 37.5h-4c0 1.1.9 2 2 2s2-.9 2-2zM43.2 32.7c-4-2.3-7.8-.1-8 0l1 1.7s3-1.7 6 0l1-1.7zM17.7 34.5h7v2h-7z"/></svg>`,
          title: 'разработка',
          text:
            'Внедряются самые последние стандарты. Сайт будет максимально быстро и корректно работать '
        },
        {
          icon: `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 57.4 52.6"><path d="M57.4 51.2c-.2-.2-4.7-4.6-14.5-6.9.5-.8.8-1.6 1.1-2.4h.7c2.2 0 4-1.8 4-4s-1.8-4-4-4v2c1.1 0 2 .9 2 2s-.9 2-2 2h-.2c.1-.7.2-1.3.2-2h-2c0 6.6-6.3 12-14 12s-14-5.4-14-12h-2c0 .7.1 1.3.2 2h-.2c-1.1 0-2-.9-2-2s.9-2 2-2v-2c-2.2 0-4 1.8-4 4s1.8 4 4 4h.7c.3.8.7 1.7 1.1 2.4C4.7 46.6.2 51 0 51.2l1.4 1.4s4.6-4.5 14.4-6.5c2.9 3.5 7.6 5.8 12.9 5.8s10-2.3 12.9-5.8c9.7 2 14.3 6.5 14.4 6.5l1.4-1.4z"/><path d="M25.7 33.9v4c0 1.7 1.3 3 3 3s3-1.3 3-3v-4h-2v4c0 .6-.4 1-1 1s-1-.4-1-1v-4h-2z"/><circle cx="23.2" cy="35.4" r="1.5"/><circle cx="36.2" cy="32.4" r="1.5"/><path d="M33.7 47c1.7 0 3-1.3 3-3v-1.1c.7 0 1.3.1 1.9.1l.2-2c-.9-.1-8.4-.7-11.1 1.7-.7.6-1 1.4-1 2.2h2c0-.3.1-.5.4-.8.4-.3.9-.6 1.6-.8v.7c0 1.7 1.4 3 3 3zm0-2c-.6 0-1-.4-1-1v-.9c.6-.1 1.3-.1 2-.2V44c0 .6-.4 1-1 1zM28.6 28c6.5 0 11.7-5.4 11.7-12.1 0-6.1-4.8-11-10.7-11-5.4 0-9.7 4.5-9.7 10 0 5 4 9.1 8.8 9.1 4.4 0 8-3.7 8-8.3 0-4.2-3.3-7.5-7.3-7.5-3.7 0-6.7 3.1-6.7 6.9 0 3.5 2.8 6.3 6.1 6.3 3.1 0 5.6-2.6 5.6-5.8h-2c0 2.1-1.6 3.8-3.6 3.8-2.3 0-4.1-1.9-4.1-4.3 0-2.7 2.1-4.9 4.7-4.9 2.9 0 5.3 2.5 5.3 5.5 0 3.5-2.7 6.3-6 6.3-3.8 0-6.8-3.2-6.8-7.1 0-4.4 3.5-8 7.7-8 4.8 0 8.7 4 8.7 9 0 5.6-4.4 10.1-9.7 10.1-6 0-10.9-5.1-10.9-11.3C17.7 7.7 23.2 2 30 2c7.6 0 13.7 6.4 13.7 14.2h2C45.7 7.3 38.6 0 30 0c-7.9 0-14.3 6.6-14.3 14.7C15.7 22 21.5 28 28.6 28z"/></svg>`,
          title: 'ТЕСТИРОВАНИЕ',
          text:
            'Перед запуском, сайт детально проходит тестирование для выявления и исправления ошибок'
        }
      ]
    },
    video: {
      poster:
        '/poster.jpg',
      items: [
        {
          type: 'video/mp4',
          src:
            '/video.mp4'
        }
      ]
    },
    technologies: {
      caption: {
        text: 'технологии'
      },
      items: [
        'WordPress',
        'Laravel',
        'Vue.js',
        'Docker',
        'Node.js',
        'MySQL',
        'OpenCart',
        'Sass',
        'Ajax',
        'Bootstrap',
        'InVision',
        'Photoshop',
        'Axure',
        'Illustrator',
        'Animate CC',
        'PHP',
        'JavaScript',
        'jQuery',
        'CSS',
        'HTML',
        'Less',
        'AdobeXD'
      ]
    }
  }
};

const servicesInnerPage = {
  state: {
    pageTitle: 'Разработка интернет-магазина',
    requestFormContent: {
      caption: {
        text: 'ЗАКАЗАТЬ УСЛУГУ'
      },
      inputs: {
        name: {
          placeholder: 'Имя',
          required: true
        },
        phone: {
          placeholder: 'Телефон',
          required: true,
          mask: '+38 (0##)-###-##-##'
        },
        email: {
          placeholder: 'E-mail',
          required: true
        },
        text: {
          placeholder: 'Расскажите об идеи',
          required: true
        },
        file: {
          placeholder: 'Добавить файл',
          required: false,
          multiple: true,
          label: 'Добавить файл',
          loaded: 'Загружено'
        }
      },
      btn: {
        text: 'ЗАКАЗАТЬ'
      }
    },
    questionFormContent: {
      caption: {
        text: 'ОСТАЛИСЬ ВОПРОСЫ?'
      },
      inputs: {
        name: {
          placeholder: 'Имя',
          required: true
        },
        phone: {
          placeholder: 'Телефон',
          required: true,
          mask: '+38 (0##)-###-##-##'
        },
        email: {
          placeholder: 'E-mail',
          required: true
        },
        text: {
          placeholder: 'Вопрос',
          required: true
        }
      },
      btn: {
        text: 'ОТПРАВИТЬ'
      }
    },
    modalTitle: 'ОСТАЛИСЬ ВОПРОСЫ?',
    caption: {
      text: 'РАЗРАБОТКА<br> ИНТЕРНЕТ-МАГАЗИНА',
      content: `
            <p>Простоту и удобство интернет-магазина для покупателей и менеджеров обеспечивает большое количество реализованных нами функций. Ниже представлены основные из них. <br>Узнайте стоимость и сроки создания интернет-магазина</p>
          `
    },
    tasks: [
      {
        key: 'ГЛАВНАЯ ЗАДАЧА:',
        val: 'интернет-магазин обязан быть понятным, логичным и простым.'
      },
      {
        key: 'ЦЕЛЬ:',
        val: 'заставить пользователя совершить действие.'
      },
      {
        key: 'РЕЗУЛЬТАТ:',
        val: 'высокие ROI и KPI наших клиентов.'
      }
    ],
    popular: {
      caption: {
        text: 'ПОПУЛЯРНЫЙ ФУНКЦИОНАЛ СОВРЕМЕННОГО ИНТЕРНЕТ-МАГАЗИНА:'
      },
      img: {
        src: '/img/popular-functions.png',
        alt: 'ПОПУЛЯРНЫЙ ФУНКЦИОНАЛ СОВРЕМЕННОГО ИНТЕРНЕТ-МАГАЗИНА'
      },
      items: [
        'Разработка уникального дизайна',
        'Мультифункциональный каталог',
        'Корзина заказа',
        'Новостная лента',
        'Карта проезда',
        'Одностраничное оформление заказа',
        'Новинки, акции, хиты продаж со стикерами',
        'Кнопка подняться вверх',
        'Форма обратной связи',
        'Живой поиск',
        'Способы оплаты',
        'Способы доставки',
        'Импорт/экспорт базы всех товаров',
        'Фильтры',
        'Рейтинг товара',
        'Корзина',
        'Валюта',
        'FAQ',
        'Многоязычность',
        'Заказать звонок',
        'Купить в один клик',
        'Список желаемого',
        'Рассылка',
        'Связка с программонй 1С',
        'Индивидуальные функции'
      ]
    },
    faq: {
      caption: {
        text: 'FAQ ПО РАЗРАБОТКЕ ИНТЕРНЕТ-МАГАЗИНА'
      },
      questions: [
        {
          question: 'Какую платформу выберут для разработки моего сайта?',
          answer:
            '<p>В подборе оптимальной платформы, мы отталкиваемся от целей и задач проекта, а потому предлагаем проверенные опытом и многофункциональные CMS. Для сложных кастомных проектов мы используем фреймворк Laravel с открытым исходным кодом, который позволяет полностью реализовать вашу задумку с учетом всех технических сложностей.</p>'
        },
        {
          question: 'Какую платформу выберут для разработки моего сайта?',
          answer:
            '<p>В подборе оптимальной платформы, мы отталкиваемся от целей и задач проекта, а потому предлагаем проверенные опытом и многофункциональные CMS. Для сложных кастомных проектов мы используем фреймворк Laravel с открытым исходным кодом, который позволяет полностью реализовать вашу задумку с учетом всех технических сложностей.</p>'
        },
        {
          question: 'Какую платформу выберут для разработки моего сайта?',
          answer:
            '<p>В подборе оптимальной платформы, мы отталкиваемся от целей и задач проекта, а потому предлагаем проверенные опытом и многофункциональные CMS. Для сложных кастомных проектов мы используем фреймворк Laravel с открытым исходным кодом, который позволяет полностью реализовать вашу задумку с учетом всех технических сложностей.</p>'
        },
        {
          question: 'Какую платформу выберут для разработки моего сайта?',
          answer:
            '<p>В подборе оптимальной платформы, мы отталкиваемся от целей и задач проекта, а потому предлагаем проверенные опытом и многофункциональные CMS. Для сложных кастомных проектов мы используем фреймворк Laravel с открытым исходным кодом, который позволяет полностью реализовать вашу задумку с учетом всех технических сложностей.</p>'
        }
      ],
      video: {
        poster:
          '/poster.jpg',
        items: [
          {
            type: 'video/mp4',
            src:
              '/video.mp4'
          }
        ]
      },
    },
    process: {
      caption: {
        text: 'ПРОЦЕСС РАЗРАБОТКИ ИНТЕРНЕТ-МАГАЗИНА'
      },
      items: [
        {
          number: 1,
          title: 'Сбор требований',
          text: 'Получение брифа и его анализ'
        },
        {
          number: 2,
          title: 'РАЗРАБОТКА ТЗ',
          text: 'Формировка ТЗ с указанием стуктуры сайта'
        },
        {
          number: 3,
          title: 'ДИЗАЙН',
          text: 'Решение по UI и UX с пожеланиями клиента'
        },
        {
          number: 4,
          title: 'ВЕРСТКА',
          text: 'На этапе верстки формируется вся иерархия сайта'
        },
        {
          number: 5,
          title: 'РАЗРАБОТКА',
          text: 'Разворачивание CMS, которая максимально подходит проекту'
        },
        {
          number: 6,
          title: 'ТЕСТИРОВАНИЕ',
          text: 'Отдел QA проверит сайт на работоспособность'
        },
        {
          number: 7,
          title: 'ЗАПОЛНЕНИЕ',
          text: 'Мы всегда осуществим минимальное заполнение сайта контентом'
        },
        {
          number: 8,
          title: 'ТЕХНИЧЕСКАЯ ПОДДЕРЖКА',
          text: 'Помогаем клиентам после сдачи проекта'
        }
      ]
    },
    portfolio: {
      caption: {
        text: 'ПРИМЕРЫ РЕАЛИЗОВАННЫХ НАМИ ПРОЕКТОВ'
      },
      btn: {
        text: 'все работы',
        link: '/portfolio'
      },
      items: [
        {
          title: 'karree',
          description: 'интернет-магазин женской одежды',
          category: 'web',
          img: '/img/portfolio-1.jpg',
          url: '/portfolio/karree'
        },
        {
          title: 'lisoped',
          description: 'интернет-магазин женской одежды',
          category: 'web',
          img: '/img/portfolio-2.jpg',
          url: '/portfolio/lisoped'
        },
        {
          title: '4pets',
          description: 'интернет-магазин женской одежды',
          category: 'web',
          img: '/img/portfolio-3.jpg',
          url: '/portfolio/pets'
        },
        {
          title: 'm1',
          description: 'интернет-магазин одежды',
          category: 'web',
          img: '/img/portfolio-4.jpg',
          url: '/portfolio/mshop'
        }
      ]
    },
    fluid: {
      questionBtn: {
        text: 'ОСТАЛИСЬ ВОПРОСЫ?'
      },
      projectBtn: {
        text: 'заказать услугу'
      }
    }
  }
};

const portfolioInnerPage = {
  state: {
    karree: {
      pageTitle: 'KARREE',
      caption: {
        text: 'KARREE',
        content: `
            <p>интернет-магазин женской одежды</p>
          `
      },
      top: {
        img: {
          src: '/img/karree-1.jpg',
          alt: 'alt'
        },
        items: [
          {
            title: 'КЛИЕНТ',
            text: `
                <p>KARREE - это интернет-магазин, который предлагает широкий ассортимент женской одежды по оптовым и розничным ценам!</p>
              `,
            link: 'karree.com.ua'
          },
          {
            title: 'ЗАДАЧА',
            text: `
                <p>Обновить сайт популярного онлайн-магазина женской одежды KARREE: провести редизайн, увеличить трафик и улучшить функционал для клиентов и администраторов, одновременно сохранив позиции в поисковой выдаче.</p>
              `
          }
        ]
      },
      info: {
        img: {
          src: '/img/karree-2.jpg',
          alt: 'alt'
        },
        items: [
          {
            title: 'КОМАНДА',
            text: `
                <p>PM, UI/UX Designer, front-end, back-end, QA</p>
              `
          },
          {
            title: 'СРОК РЕАЛИЗАЦИИ',
            text: `
                <p>8 недель</p>
              `
          },
          {
            title: 'ТЕХНОЛОГИИ',
            text: `
                <p>Laravel</p>
              `
          },
          {
            title: 'НАПРАВЛЕНИЕ РАБОТЫ',
            text: `
                <p>Создание семантического ядра, Дизайн логотипа, Дизайн сайта, Верстка, Программирование, SEO, Контекстная реклама</p>
              `
          }
        ]
      },
      beforeImages: [
        {
          src: '/img/karree-3.jpg',
          alt: 'alt'
        }
      ],
      done: [
        {
          title: 'ЧТО СДЕЛАЛИ',
          text: `
                <p>Интернет-магазин был реализован с акцентом на качественные и профессиональные фото, благодаря которым можно определить качество выбранной модели одежды. Также использовали весь необходимый функционал, чтобы покупатель смог найти всю необходимую ему информацию.</p>
              `
        }
      ],
      afterImages: [
        {
          src: '/img/karree-4.jpg',
          alt: 'alt'
        }
      ],
      controls: {
        numbers: {
          current: 1,
          total: 7
        },
        prev: {
          link: '#',
          text: 'предыдущий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M88.6 121.3c.8.8 1.8 1.2 2.9 1.2s2.1-.4 2.9-1.2c1.6-1.6 1.6-4.2 0-5.8l-51-51 51-51c1.6-1.6 1.6-4.2 0-5.8s-4.2-1.6-5.8 0l-54 53.9c-1.6 1.6-1.6 4.2 0 5.8l54 53.9z"/></svg>
            `
        },
        next: {
          link: '#',
          text: 'следующий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M40.4 121.3c-.8.8-1.8 1.2-2.9 1.2s-2.1-.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8 0l53.9 53.9c1.6 1.6 1.6 4.2 0 5.8l-53.9 53.9z"/></svg>
            `
        }
      }
    },
    lisoped: {
      pageTitle: 'Lisoped',
      caption: {
        text: 'Lisoped',
        content: `
            <p>интернет-магазин велосипедов</p>
          `
      },
      top: {
        img: {
          src: '/img/lisoped_b_1.png',
          alt: 'alt'
        },
        items: [
          {
            title: 'Lisoped',
            text: `
                <p>Lisoped - это интернет-магазин, который предлагает широкий ассортимент женской одежды по оптовым и розничным ценам!</p>
              `,
            link: 'karree.com.ua'
          },
          {
            title: 'ЗАДАЧА',
            text: `
                <p>Обновить сайт популярного онлайн-магазина женской одежды KARREE: провести редизайн, увеличить трафик и улучшить функционал для клиентов и администраторов, одновременно сохранив позиции в поисковой выдаче.</p>
              `
          }
        ]
      },
      info: {
        img: {
          src: '/img/lisoped_b_2.png',
          alt: 'alt'
        },
        items: [
          {
            title: 'КОМАНДА',
            text: `
                <p>PM, UI/UX Designer, front-end, back-end, QA</p>
              `
          },
          {
            title: 'СРОК РЕАЛИЗАЦИИ',
            text: `
                <p>8 недель</p>
              `
          },
          {
            title: 'ТЕХНОЛОГИИ',
            text: `
                <p>Laravel</p>
              `
          },
          {
            title: 'НАПРАВЛЕНИЕ РАБОТЫ',
            text: `
                <p>Создание семантического ядра, Дизайн логотипа, Дизайн сайта, Верстка, Программирование, SEO, Контекстная реклама</p>
              `
          }
        ]
      },
      beforeImages: [
        {
          src: '/img/lisoped_1.png',
          alt: 'alt'
        }
      ],
      done: [
        {
          title: 'ЧТО СДЕЛАЛИ',
          text: `
                <p>Интернет-магазин был реализован с акцентом на качественные и профессиональные фото, благодаря которым можно определить качество выбранной модели одежды. Также использовали весь необходимый функционал, чтобы покупатель смог найти всю необходимую ему информацию.</p>
              `
        }
      ],
      afterImages: [
        {
          src: '/img/lisoped_2.png',
          alt: 'alt'
        }
      ],
      controls: {
        numbers: {
          current: 2,
          total: 7
        },
        prev: {
          link: '#',
          text: 'предыдущий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M88.6 121.3c.8.8 1.8 1.2 2.9 1.2s2.1-.4 2.9-1.2c1.6-1.6 1.6-4.2 0-5.8l-51-51 51-51c1.6-1.6 1.6-4.2 0-5.8s-4.2-1.6-5.8 0l-54 53.9c-1.6 1.6-1.6 4.2 0 5.8l54 53.9z"/></svg>
            `
        },
        next: {
          link: '#',
          text: 'следующий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M40.4 121.3c-.8.8-1.8 1.2-2.9 1.2s-2.1-.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8 0l53.9 53.9c1.6 1.6 1.6 4.2 0 5.8l-53.9 53.9z"/></svg>
            `
        }
      }
    },
    pets: {
      pageTitle: '4Pets',
      caption: {
        text: '4Pets',
        content: `
            <p>интернет-магазин товаров для животных</p>
          `
      },
      top: {
        img: {
          src: '/img/pets-1.png',
          alt: 'alt'
        },
        items: [
          {
            title: '4Pets',
            text: `
                <p>Lisoped - это интернет-магазин, который предлагает широкий ассортимент женской одежды по оптовым и розничным ценам!</p>
              `,
            link: 'karree.com.ua'
          },
          {
            title: 'ЗАДАЧА',
            text: `
                <p>Обновить сайт популярного онлайн-магазина женской одежды KARREE: провести редизайн, увеличить трафик и улучшить функционал для клиентов и администраторов, одновременно сохранив позиции в поисковой выдаче.</p>
              `
          }
        ]
      },
      info: {
        img: {
          src: '/img/pets-2.png',
          alt: 'alt'
        },
        items: [
          {
            title: 'КОМАНДА',
            text: `
                <p>PM, UI/UX Designer, front-end, back-end, QA</p>
              `
          },
          {
            title: 'СРОК РЕАЛИЗАЦИИ',
            text: `
                <p>8 недель</p>
              `
          },
          {
            title: 'ТЕХНОЛОГИИ',
            text: `
                <p>Laravel</p>
              `
          },
          {
            title: 'НАПРАВЛЕНИЕ РАБОТЫ',
            text: `
                <p>Создание семантического ядра, Дизайн логотипа, Дизайн сайта, Верстка, Программирование, SEO, Контекстная реклама</p>
              `
          }
        ]
      },
      beforeImages: [
        {
          src: '/img/pets-3.png',
          alt: 'alt'
        }
      ],
      done: [
        {
          title: 'ЧТО СДЕЛАЛИ',
          text: `
                <p>Интернет-магазин был реализован с акцентом на качественные и профессиональные фото, благодаря которым можно определить качество выбранной модели одежды. Также использовали весь необходимый функционал, чтобы покупатель смог найти всю необходимую ему информацию.</p>
              `
        }
      ],
      afterImages: [
        {
          src: '/img/pets-4.png',
          alt: 'alt'
        }
      ],
      controls: {
        numbers: {
          current: 3,
          total: 7
        },
        prev: {
          link: '#',
          text: 'предыдущий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M88.6 121.3c.8.8 1.8 1.2 2.9 1.2s2.1-.4 2.9-1.2c1.6-1.6 1.6-4.2 0-5.8l-51-51 51-51c1.6-1.6 1.6-4.2 0-5.8s-4.2-1.6-5.8 0l-54 53.9c-1.6 1.6-1.6 4.2 0 5.8l54 53.9z"/></svg>
            `
        },
        next: {
          link: '#',
          text: 'следующий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M40.4 121.3c-.8.8-1.8 1.2-2.9 1.2s-2.1-.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8 0l53.9 53.9c1.6 1.6 1.6 4.2 0 5.8l-53.9 53.9z"/></svg>
            `
        }
      }
    },
    mshop: {
      pageTitle: 'M1',
      caption: {
        text: 'M1',
        content: `
            <p>интернет-магазин одежды</p>
          `
      },
      top: {
        img: {
          src: '/img/m-1.png',
          alt: 'alt'
        },
        items: [
          {
            title: 'M1',
            text: `
                <p>Lisoped - это интернет-магазин, который предлагает широкий ассортимент женской одежды по оптовым и розничным ценам!</p>
              `,
            link: 'karree.com.ua'
          },
          {
            title: 'ЗАДАЧА',
            text: `
                <p>Обновить сайт популярного онлайн-магазина женской одежды KARREE: провести редизайн, увеличить трафик и улучшить функционал для клиентов и администраторов, одновременно сохранив позиции в поисковой выдаче.</p>
              `
          }
        ]
      },
      info: {
        img: {
          src: '/img/m-2.png',
          alt: 'alt'
        },
        items: [
          {
            title: 'КОМАНДА',
            text: `
                <p>PM, UI/UX Designer, front-end, back-end, QA</p>
              `
          },
          {
            title: 'СРОК РЕАЛИЗАЦИИ',
            text: `
                <p>8 недель</p>
              `
          },
          {
            title: 'ТЕХНОЛОГИИ',
            text: `
                <p>Laravel</p>
              `
          },
          {
            title: 'НАПРАВЛЕНИЕ РАБОТЫ',
            text: `
                <p>Создание семантического ядра, Дизайн логотипа, Дизайн сайта, Верстка, Программирование, SEO, Контекстная реклама</p>
              `
          }
        ]
      },
      beforeImages: [
        {
          src: '/img/m-3.png',
          alt: 'alt'
        }
      ],
      done: [
        {
          title: 'ЧТО СДЕЛАЛИ',
          text: `
                <p>Интернет-магазин был реализован с акцентом на качественные и профессиональные фото, благодаря которым можно определить качество выбранной модели одежды. Также использовали весь необходимый функционал, чтобы покупатель смог найти всю необходимую ему информацию.</p>
              `
        }
      ],
      afterImages: [
        {
          src: '/img/m-4.png',
          alt: 'alt'
        }
      ],
      controls: {
        numbers: {
          current: 4,
          total: 7
        },
        prev: {
          link: '#',
          text: 'предыдущий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M88.6 121.3c.8.8 1.8 1.2 2.9 1.2s2.1-.4 2.9-1.2c1.6-1.6 1.6-4.2 0-5.8l-51-51 51-51c1.6-1.6 1.6-4.2 0-5.8s-4.2-1.6-5.8 0l-54 53.9c-1.6 1.6-1.6 4.2 0 5.8l54 53.9z"/></svg>
            `
        },
        next: {
          link: '#',
          text: 'следующий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M40.4 121.3c-.8.8-1.8 1.2-2.9 1.2s-2.1-.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8 0l53.9 53.9c1.6 1.6 1.6 4.2 0 5.8l-53.9 53.9z"/></svg>
            `
        }
      }
    },
    phuket: {
      pageTitle: 'Phuket',
      caption: {
        text: 'Phuket',
        content: `
            <p>интернет-магазин одежды</p>
          `
      },
      top: {
        img: {
          src: '/img/phuket-1.png',
          alt: 'alt'
        },
        items: [
          {
            title: 'M1',
            text: `
                <p>Lisoped - это интернет-магазин, который предлагает широкий ассортимент женской одежды по оптовым и розничным ценам!</p>
              `,
            link: 'karree.com.ua'
          },
          {
            title: 'ЗАДАЧА',
            text: `
                <p>Обновить сайт популярного онлайн-магазина женской одежды KARREE: провести редизайн, увеличить трафик и улучшить функционал для клиентов и администраторов, одновременно сохранив позиции в поисковой выдаче.</p>
              `
          }
        ]
      },
      info: {
        img: {
          src: '/img/phuket-2.png',
          alt: 'alt'
        },
        items: [
          {
            title: 'КОМАНДА',
            text: `
                <p>PM, UI/UX Designer, front-end, back-end, QA</p>
              `
          },
          {
            title: 'СРОК РЕАЛИЗАЦИИ',
            text: `
                <p>8 недель</p>
              `
          },
          {
            title: 'ТЕХНОЛОГИИ',
            text: `
                <p>Laravel</p>
              `
          },
          {
            title: 'НАПРАВЛЕНИЕ РАБОТЫ',
            text: `
                <p>Создание семантического ядра, Дизайн логотипа, Дизайн сайта, Верстка, Программирование, SEO, Контекстная реклама</p>
              `
          }
        ]
      },
      beforeImages: [
        {
          src: '/img/phuket-3.png',
          alt: 'alt'
        }
      ],
      done: [
        {
          title: 'ЧТО СДЕЛАЛИ',
          text: `
                <p>Интернет-магазин был реализован с акцентом на качественные и профессиональные фото, благодаря которым можно определить качество выбранной модели одежды. Также использовали весь необходимый функционал, чтобы покупатель смог найти всю необходимую ему информацию.</p>
              `
        }
      ],
      afterImages: [
        {
          src: '/img/phuket-4.png',
          alt: 'alt'
        }
      ],
      controls: {
        numbers: {
          current: 5,
          total: 7
        },
        prev: {
          link: '#',
          text: 'предыдущий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M88.6 121.3c.8.8 1.8 1.2 2.9 1.2s2.1-.4 2.9-1.2c1.6-1.6 1.6-4.2 0-5.8l-51-51 51-51c1.6-1.6 1.6-4.2 0-5.8s-4.2-1.6-5.8 0l-54 53.9c-1.6 1.6-1.6 4.2 0 5.8l54 53.9z"/></svg>
            `
        },
        next: {
          link: '#',
          text: 'следующий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M40.4 121.3c-.8.8-1.8 1.2-2.9 1.2s-2.1-.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8 0l53.9 53.9c1.6 1.6 1.6 4.2 0 5.8l-53.9 53.9z"/></svg>
            `
        }
      }
    },
    frime: {
      pageTitle: 'Frime',
      caption: {
        text: 'Frime',
        content: `
            <p>интернет-магазин одежды</p>
          `
      },
      top: {
        img: {
          src: '/img/frime_b_1.png',
          alt: 'alt'
        },
        items: [
          {
            title: 'M1',
            text: `
                <p>Lisoped - это интернет-магазин, который предлагает широкий ассортимент женской одежды по оптовым и розничным ценам!</p>
              `,
            link: 'karree.com.ua'
          },
          {
            title: 'ЗАДАЧА',
            text: `
                <p>Обновить сайт популярного онлайн-магазина женской одежды KARREE: провести редизайн, увеличить трафик и улучшить функционал для клиентов и администраторов, одновременно сохранив позиции в поисковой выдаче.</p>
              `
          }
        ]
      },
      info: {
        img: {
          src: '/img/frime_b_2.png',
          alt: 'alt'
        },
        items: [
          {
            title: 'КОМАНДА',
            text: `
                <p>PM, UI/UX Designer, front-end, back-end, QA</p>
              `
          },
          {
            title: 'СРОК РЕАЛИЗАЦИИ',
            text: `
                <p>8 недель</p>
              `
          },
          {
            title: 'ТЕХНОЛОГИИ',
            text: `
                <p>Laravel</p>
              `
          },
          {
            title: 'НАПРАВЛЕНИЕ РАБОТЫ',
            text: `
                <p>Создание семантического ядра, Дизайн логотипа, Дизайн сайта, Верстка, Программирование, SEO, Контекстная реклама</p>
              `
          }
        ]
      },
      beforeImages: [
        {
          src: '/img/frime_1.png',
          alt: 'alt'
        }
      ],
      done: [
        {
          title: 'ЧТО СДЕЛАЛИ',
          text: `
                <p>Интернет-магазин был реализован с акцентом на качественные и профессиональные фото, благодаря которым можно определить качество выбранной модели одежды. Также использовали весь необходимый функционал, чтобы покупатель смог найти всю необходимую ему информацию.</p>
              `
        }
      ],
      afterImages: [
        {
          src: '/img/frime_2.png',
          alt: 'alt'
        }
      ],
      controls: {
        numbers: {
          current: 6,
          total: 7
        },
        prev: {
          link: '#',
          text: 'предыдущий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M88.6 121.3c.8.8 1.8 1.2 2.9 1.2s2.1-.4 2.9-1.2c1.6-1.6 1.6-4.2 0-5.8l-51-51 51-51c1.6-1.6 1.6-4.2 0-5.8s-4.2-1.6-5.8 0l-54 53.9c-1.6 1.6-1.6 4.2 0 5.8l54 53.9z"/></svg>
            `
        },
        next: {
          link: '#',
          text: 'следующий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M40.4 121.3c-.8.8-1.8 1.2-2.9 1.2s-2.1-.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8 0l53.9 53.9c1.6 1.6 1.6 4.2 0 5.8l-53.9 53.9z"/></svg>
            `
        }
      }
    },
    zlato: {
      pageTitle: 'ЗлатоСрiбло',
      caption: {
        text: 'ЗлатоСрiбло',
        content: `
            <p>интернет-магазин одежды</p>
          `
      },
      top: {
        img: {
          src: '/img/zlato-1.png',
          alt: 'alt'
        },
        items: [
          {
            title: 'M1',
            text: `
                <p>Lisoped - это интернет-магазин, который предлагает широкий ассортимент женской одежды по оптовым и розничным ценам!</p>
              `,
            link: 'karree.com.ua'
          },
          {
            title: 'ЗАДАЧА',
            text: `
                <p>Обновить сайт популярного онлайн-магазина женской одежды KARREE: провести редизайн, увеличить трафик и улучшить функционал для клиентов и администраторов, одновременно сохранив позиции в поисковой выдаче.</p>
              `
          }
        ]
      },
      info: {
        img: {
          src: '/img/zlato-2.png',
          alt: 'alt'
        },
        items: [
          {
            title: 'КОМАНДА',
            text: `
                <p>PM, UI/UX Designer, front-end, back-end, QA</p>
              `
          },
          {
            title: 'СРОК РЕАЛИЗАЦИИ',
            text: `
                <p>8 недель</p>
              `
          },
          {
            title: 'ТЕХНОЛОГИИ',
            text: `
                <p>Laravel</p>
              `
          },
          {
            title: 'НАПРАВЛЕНИЕ РАБОТЫ',
            text: `
                <p>Создание семантического ядра, Дизайн логотипа, Дизайн сайта, Верстка, Программирование, SEO, Контекстная реклама</p>
              `
          }
        ]
      },
      beforeImages: [
        {
          src: '/img/zlato-3.png',
          alt: 'alt'
        }
      ],
      done: [
        {
          title: 'ЧТО СДЕЛАЛИ',
          text: `
                <p>Интернет-магазин был реализован с акцентом на качественные и профессиональные фото, благодаря которым можно определить качество выбранной модели одежды. Также использовали весь необходимый функционал, чтобы покупатель смог найти всю необходимую ему информацию.</p>
              `
        }
      ],
      afterImages: [
        {
          src: '/img/zlato-4.png',
          alt: 'alt'
        }
      ],
      controls: {
        numbers: {
          current: 7,
          total: 7
        },
        prev: {
          link: '#',
          text: 'предыдущий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M88.6 121.3c.8.8 1.8 1.2 2.9 1.2s2.1-.4 2.9-1.2c1.6-1.6 1.6-4.2 0-5.8l-51-51 51-51c1.6-1.6 1.6-4.2 0-5.8s-4.2-1.6-5.8 0l-54 53.9c-1.6 1.6-1.6 4.2 0 5.8l54 53.9z"/></svg>
            `
        },
        next: {
          link: '#',
          text: 'следующий проект',
          icon: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 129 129"><path d="M40.4 121.3c-.8.8-1.8 1.2-2.9 1.2s-2.1-.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8 0l53.9 53.9c1.6 1.6 1.6 4.2 0 5.8l-53.9 53.9z"/></svg>
            `
        }
      }
    }
  }
};

const portfolioPage = {
  state: {
    btn: {
      text: 'ПОКАЗАТЬ ЕЩЕ'
    },
    pageTitle: 'Портфолио',
    directionSelect: {
      defaultVal: 'НАПРАВЛЕНИЕ РАБОТЫ',
      options: ['WEB разработка', 'SMM продвижение', 'SEO продвижение']
    },
    typeSelect: {
      defaultVal: 'ТИП ПРОЕКТА',
      options: ['Интернет магазин']
    },
    caption: {
      text: 'Портфолио',
      content: `<p>Любой может сделать из простого сложное. Мы умеем превратить сложное в простое. За 2 года мы создали более 300 приносящих прибыль проектов, каждый из которых был сделан внимательно, тщательно и с любовью. </p>`
    },
    portfolio: {
      items: [
        {
          title: 'karree',
          description: 'интернет-магазин женской одежды',
          category: 'web',
          img: '/img/portfolio-1.jpg',
          url: '/portfolio/karree'
        },
        {
          title: 'lisoped',
          description: 'интернет-магазин женской одежды',
          category: 'web',
          img: '/img/portfolio-2.jpg',
          url: '/portfolio/lisoped'
        },
        {
          title: '4pets',
          description: 'интернет-магазин женской одежды',
          category: 'web',
          img: '/img/portfolio-3.jpg',
          url: '/portfolio/pets'
        },
        {
          title: 'm1',
          description: 'интернет-магазин одежды',
          category: 'web',
          img: '/img/portfolio-4.jpg',
          url: '/portfolio/mshop'
        },
        {
          title: 'Phuket',
          description: 'интернет-магазин одежды',
          category: 'web',
          img: '/img/portfolio-5.jpg',
          url: '/portfolio/phuket'
        },
        {
          title: 'Frime',
          description: 'интернет-магазин одежды',
          category: 'web',
          img: '/img/portfolio-6.jpg',
          url: '/portfolio/frime'
        },
        {
          title: 'ЗлатоСрiбло',
          description: 'интернет-магазин ювелирных изделий',
          category: 'web',
          img: '/img/portfolio-7.jpg',
          url: '/portfolio/zlato'
        }
      ]
    }
  }
};

const aboutPage = {
  state: {
    pageTitle: 'О студии',
    caption: {
      text: 'О студии'
    },
    bottom: {
      team: {
        label: 'нашА КОМАНДА',
        title: 'Наша команда – это три отдела из настоящих профи',
        content: `
              <p>Мы знаем, насколько крут результат, когда команда – одно целое. Отлаженный механизм, где каждый напряженно идет к решению, преданно, с драйвом и любопытством.</p>
              <p>За 3 года в нашем портфеле более 250 успешно реализованных проектов в области разработки и брендинга.
Нашу команду объединяет дух и мастерство, мы создаем такую атмосферу, где талант сочетается с опытом, а идеи – с экспертностью.</p>
              <p>Поэтому ваши бизнес для нас не очередной проект, это возможность вложить душу и сделать уникальный инструмент продаж. Для вас.</p>
            `,
        btn: {
          text: 'Узнать больше о КОМАНДЕ',
          icon:
            '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
          link: '/about/team'
        },
        img: 'img/p-about-1.jpg'
      },
      office: {
        label: 'наши офисы',
        title: 'Три комфортабельных офиса – 400 м² в центре города',
        content: `
              <p>Здесь вы можете встретиться лично с теми, кто работает над вашим проектом. Задать ключевые для вас вопросы и убедиться том, кто именно стоит по ту сторону результата. Везде вас встретят с улыбкой, сервисом и компетентным подходом.</p>
              <p>И тут не обошлось без творчества, ведь каждый этаж – новое цветовое решение. Верхний – для топ-менеджмента, первый – под столовую. На остальных этажах рабочая обстановка – столы по застекленному периметру, конференц-залы, комнаты отдыха и переговорные на продольной оси в центре помещения.</p>
              <p>Все это воссоздано с особой атмосферой домашнего уюта, которая кроется в деталях. К тому же, у нас удобно работать в любой точке офиса.</p>
            `,
        btn: {
          text: 'Узнать больше об офисах',
          icon:
            '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
          link: '/about/office'
        },
        img: 'img/p-about-2.jpg'
      },
      awards: {
        label: 'наши награды',
        title:
          'Мы знаем, что клиенту нужны не награды, а эффективные решения, но...',
        content: `
              <p>когда они приносят не только деньги, но и получают общественное признание, это бесценно. Награды напоминают нам о том, что мы идем в правильном направлении, задаем стандарты на рынке.</p>
              <p>Делаем эталонные продукты и удачно синтезируем стратегический веб-маркетинг с креативом.</p>
            `,
        btn: {
          text: 'Узнать больше о НАГРАДАХ',
          icon:
            '<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" viewBox="0 0 129 129" enable-background="new 0 0 129 129"><g><path d="m40.4,121.3c-0.8,0.8-1.8,1.2-2.9,1.2s-2.1-0.4-2.9-1.2c-1.6-1.6-1.6-4.2 0-5.8l51-51-51-51c-1.6-1.6-1.6-4.2 0-5.8 1.6-1.6 4.2-1.6 5.8,0l53.9,53.9c1.6,1.6 1.6,4.2 0,5.8l-53.9,53.9z"/></g></svg>',
          link: '/about/awards'
        },
        img: 'img/p-about-3.jpg'
      }
    },
    advantages: [
      {
        icon: `
              <svg width="48" height="50" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 86.2 87.7"><path d="M53.8 18.9C53.8 6.4 45.5.8 45.1.5l-.7-.5-.7.5C35 7 35.1 18.4 35.1 18.9v29.7L26 61.1v15.2h9.1v2.8c0 .7.6 1.3 1.3 1.3h6.9v7.3h2.5v-7.3h6.9c.7 0 1.3-.6 1.3-1.3v-2.8h9V61.1l-9.1-12.5V18.9zm-2.5 20.2H37.6v-19h13.7v19zm-13.7 2.5h13.7v12.8H37.6V41.6zm6.9-38.5c1.8 1.5 6.4 6.1 6.8 14.5H37.7c.2-2.8 1.3-9.9 6.8-14.5zm-16 70.7V61.9l6.6-9.1v21h-6.6zm9.1 4.1v-21h13.7v21H37.6zm22.9-16v11.8h-6.6v-21l6.6 9.2z"/><path d="M44.5 34.8c2.9 0 5.3-2.4 5.3-5.3s-2.4-5.3-5.3-5.3-5.2 2.4-5.2 5.3 2.3 5.3 5.2 5.3zm0-8c1.5 0 2.8 1.2 2.8 2.8s-1.2 2.8-2.8 2.8c-1.5 0-2.8-1.2-2.8-2.8s1.3-2.8 2.8-2.8zM40.2 59.5h2.5v11h-2.5zM40.2 72h2.5v3h-2.5zM38.3 83.4h2.5v4.3h-2.5zM48.1 83.4h2.5v4.3h-2.5zM40.2 44.9h2.5v7h-2.5zM7.4 72.9c0 .5 0 1 .1 1.6C3.3 75 0 78.7 0 83.1h2.5c0-3.4 2.8-6.2 6.2-6.2h.2l1.9.1-.5-1.7c-.2-.8-.3-1.6-.3-2.4 0-4.9 4-8.9 8.9-8.9 1.4 0 2.8.3 4.1 1l1.1-2.2c-1.6-.8-3.4-1.3-5.2-1.3-6.3-.1-11.5 5.1-11.5 11.4zM77.6 68.5c-.6-6.4-6-11.4-12.5-11.4v2.5c5.6 0 10.1 4.5 10.1 10V71l1.5-.1h.2c3.8 0 6.9 3.1 6.9 6.9h2.5c-.1-4.9-3.9-8.9-8.7-9.3zM26 25.5h2.5V41H26zM19 37.5h2.5v14.3H19zM59.8 25.5h2.5V41h-2.5zM66.8 37.5h2.5v14.3h-2.5z"/></svg>
            `,
        title: 'НАША МИССИЯ',
        content: `
              <p>Заряжаем сайты дизайном, вызывающим восторг и доверие</p>
            `
      },
      {
        icon: `
              <svg width="43" height="40" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 60 56"><path d="M53 34c-1.7 0-3-1.3-3-3 0-.6-.4-1-1-1s-1 .4-1 1c0 1.7-1.3 3-3 3-.6 0-1 .4-1 1s.4 1 1 1c1.7 0 3 1.3 3 3 0 .6.4 1 1 1s1-.4 1-1c0-1.7 1.3-3 3-3 .6 0 1-.4 1-1s-.4-1-1-1zm-4 2c-.3-.4-.6-.7-1-1 .4-.3.7-.6 1-1 .3.4.6.7 1 1-.4.3-.7.6-1 1zM23 46c-1.7 0-3-1.3-3-3 0-.6-.4-1-1-1s-1 .4-1 1c0 1.7-1.3 3-3 3-.6 0-1 .4-1 1s.4 1 1 1c1.7 0 3 1.3 3 3 0 .6.4 1 1 1s1-.4 1-1c0-1.7 1.3-3 3-3 .6 0 1-.4 1-1s-.4-1-1-1zm-4 2c-.3-.4-.6-.7-1-1 .4-.3.7-.6 1-1 .3.4.6.7 1 1-.4.3-.7.6-1 1zM16 8c-.3 0-.6.2-.8.4l-8 12v.5L7 21V21.3s0 .1.1.1v.1l22 26h.1c.1.1.2.1.2.2h.1c.2.1.5.1.8 0h.1c.1 0 .2-.1.2-.2h.1l22-26v-.1s0-.1.1-.1v-.6-.1-.1-.1l-8-12c-.2-.2-.5-.4-.8-.4H16zm.5 2h7.2l-2.5 10H9.9l6.6-10zm6.9 12h13.3L30 43.6 23.4 22zm-2.1 0l6.3 20.6L10.2 22h11.1zm11.1 20.6L38.7 22h11.1L32.4 42.6zM50.1 20H38.8l-2.5-10h7.2l6.6 10zM34.2 10l2.5 10H23.3l2.5-10h8.4zM31 5V1c0-.6-.4-1-1-1s-1 .4-1 1v4c0 .6.4 1 1 1s1-.4 1-1zM30 50c-.6 0-1 .4-1 1v4c0 .6.4 1 1 1s1-.4 1-1v-4c0-.6-.4-1-1-1zM5 27H1c-.6 0-1 .4-1 1s.4 1 1 1h4c.6 0 1-.4 1-1s-.4-1-1-1zM59 27h-4c-.6 0-1 .4-1 1s.4 1 1 1h4c.6 0 1-.4 1-1s-.4-1-1-1zM49.7 44.3c-.4-.4-1-.4-1.4 0s-.4 1 0 1.4l4 4c.4.4 1 .4 1.4 0s.4-1 0-1.4l-4-4zM10.3 44.3l-4 4c-.4.4-.4 1 0 1.4.4.4 1 .4 1.4 0l4-4c.4-.4.4-1 0-1.4-.4-.4-1-.4-1.4 0zM7.7 4.3c-.4-.4-1-.4-1.4 0-.4.4-.4 1 0 1.4l4 4c.4.4 1 .4 1.4 0s.4-1 0-1.4l-4-4zM49.7 9.7l4-4c.4-.4.4-1 0-1.4-.4-.4-1-.4-1.4 0l-4 4c-.4.4-.4 1 0 1.4.4.4 1 .4 1.4 0z"/></svg>
            `,
        title: 'НАШИ ПРИОРИТЕТЫ',
        content: `
              <p>Ответственность, инновации, дедлайны, клиентоориентированность</p>
            `
      },
      {
        icon: `
              <svg width="44" height="44" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 60 60"><path d="M11.8 22.2l2-2.6c.1-.2.2-.4.2-.6v-8c0-3-2.2-5.5-5.1-5.9C8.5 2.2 6 0 3 0H0v2h3c2.2 0 4 1.8 4 4 0 .6.4 1 1 1 2.2 0 4 1.8 4 4v7.7L9.5 22H9c-.6 0-1 .4-1 1v6H5V17c0-.6-.4-1-1-1H0v2h3v12c0 .6.4 1 1 1h5c.6 0 1-.4 1-1v-6c2.8 0 5 2.2 5 5v3c0 2.8-2.2 5-5 5H9c-.6 0-1 .4-1 1v13c0 3.9-3.1 7-7 7H0v2h1c5 0 9-4 9-9V39c3.9 0 7-3.1 7-7v-3c0-3.2-2.1-5.9-5.2-6.8zM19 29h4v2h-4zM19.307 22.723l1.415-1.414 2.97 2.97-1.415 1.414zM19.308 37.278l2.97-2.97 1.414 1.414-2.97 2.97zM50 36c0 .6.4 1 1 1h4c.6 0 1-.4 1-1v-.4l3.4-1.7c.3-.2.6-.5.6-.9v-6c0-.4-.2-.7-.6-.9L56 24.4V24c0-.6-.4-1-1-1h-4c-.6 0-1 .4-1 1H39.3L34 20.5V20c0-.6-.4-1-1-1h-4c-.6 0-1 .4-1 1v6h-2c-.6 0-1 .4-1 1v6c0 .6.4 1 1 1h2v6c0 .6.4 1 1 1h4c.6 0 1-.4 1-1v-.5l5.3-3.5H42v3.2c-1.2.4-2 1.5-2 2.8h-2c-1.7 0-3 1.3-3 3v9c0 1.7 1.3 3 3 3h21c.6 0 1-.4 1-1V45c0-.6-.4-1-1-1h-4.6l-4.7-4.7c-.2-.2-.4-.3-.7-.3h-1v-3h2zm8-8.4v4.8l-2 1v-6.8l2 1zM54 25v10h-2V25h2zm-27 7v-4h1v4h-1zm3 7V21h2v18h-2zm4-16.1l4 2.7v8.9l-4 2.7V22.9zm6 3.1h10v8H40v-8zm13.3 19.7c.2.2.4.3.7.3h4v9H38c-.6 0-1-.4-1-1v-9c0-.6.4-1 1-1h3c.6 0 1-.4 1-1v-1c0-.6.4-1 1-1h5.6l4.7 4.7zM46 39h-2v-3h2v3z"/></svg>
            `,
        title: 'НАШ ЛОЗУНГ',
        content: `
              <p>“Your potential. Our Passion”<br> Ваши возможности, наша страсть.</p>
            `
      }
    ],
    question: {
      video: {
        icon: {
          text: 'Смотреть видео',
          svg: `
              <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 384"><path d="M39.4 384h304.9c28.4 0 39.7-11.4 39.7-40.1V304l128 80V160l-128 80c0-17.3.3-32.6-.1-47.9-.4-17.9-13.2-30.9-30.6-32-4.6-.3-9.3-.1-14-.1h-52.8c42.5-12.2 69.2-47 65.1-86-4.4-41.9-35.6-71.8-77-73.9-37.2-1.8-73 26.1-80.5 63-4.5 21.9-.6 42.5 11.7 61.1 12.3 18.8 30.4 29.8 52 35.3H92.9c46.5-14.4 71.3-47.5 66.5-87-5-41.1-35.4-70-76.4-72.4C46.3-2 10.8 24.5 2.6 61.7.4 72.4.2 83.4 2.1 94.2c1.8 10.5 5.8 20.4 11.6 29.3 6.2 9 14.1 16.8 23.1 23 8.4 5.9 18.8 8.9 29 13.4H37.3C12.3 160 0 172.3 0 197.5v146.9c0 28 11.6 39.6 39.4 39.6z"/></svg>
            `
        },
        poster:
          '/poster.jpg',
        items: [
          {
            type: 'video/mp4',
            src:
              '/video.mp4'
          }
        ]
      },
      info: {
        caption: 'ПОЧЕМУ СТОИТ ВЫБРАТЬ ART MARKS',
        content: `
              <p>Мы не лучше и не хуже других. Просто для нас работа – это ценный вклад, страсть, которая движет нами. </p>
              <p>Это часть души.</p>
              <p>Поэтому мы знаем, как важно для вас ваше дело, и добросовестно стараемся помочь.</p>
            `
      }
    },
    instagram: {
      logo: `
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 2500 706"><path d="M143.2 0c-22.9 0-52.5 24.2-70 40.4C34.8 74.5 0 137.3 0 187.6c0 71.6 60.9 98.6 76.3 98.6 5.1 0 9.4-2.6 9.4-9.5 0-5.4-3.4-9.9-6.8-14.5-14.1-21.5-18.6-42.1-18.6-69.8 0-57.8 26.7-110.8 48.8-135.1 4.1-4.4 13.3-13.9 16.1-13.9 2.7 0 3.4 2.2 3.4 9.1L125.9 431c0 59.2-17.1 82.7-17.1 96.6 0 6.1 2.7 7.7 7.7 7.7 24 0 47.8-29.2 54.6-39.9 21-36.2 26.1-64.5 26.1-146.1v-318c0-8.6-2.4-12.3-10.6-17.6C174.7 6.1 161 0 143.2 0zm685.1 1.1c-11.3 0-16.1 5.9-16.6 24.1l-2.5 75.5-66-2.3c-4-.1-5.8 1.2-7.6 4.7-5.6 10.5-8.6 18.7-8.6 32.5 0 11.2 5.1 12.4 9.6 12.4l68.7 2-.2 144.2c0 30.6-19.3 70.3-53.5 103.3 0 0 2.9-10 2.8-20.4 0-29.6-19-56.4-44.4-75.4l-62-46.6c13-15 35-44.8 35-70 0-19.5-12.3-27.7-35.1-27.7-32.3 0-69.7 29.6-69.7 73.4 0 16 7.1 30.4 17.9 41.4-14.9 28.3-36 65.6-51.7 92.1-11.8 20.3-31.9 51.4-43.7 51.4-8.7 0-12.8-13.7-12.8-66.6 0-43.9 3.1-91.6 4.7-137.4 0-10.5-1.7-20.2-15.4-29.7-12.5-8-28-19.3-44-19.3-35.5 0-59.6 32.6-76.2 64.5-17.1 33.1-26.4 60.9-39.5 101.4l1.4-139.1c.4-9.9-2.1-13.8-10-17.1-10.3-4.4-25.5-9.4-38.9-9.4-11.2 0-12.6 4.8-12.6 16.7l-1.5 166.9-.2 64.4c0 58.1 7.3 67.7 41.7 67.7 19.1 0 25.2-2.2 25.6-18.1.5-10.5 5.5-35.9 12.3-61.4 19.8-75.2 43.4-134.7 83.9-180 4.2-4.4 7.5-2.8 6.8 3.4 0 0-6.4 101.8-6.4 143.4 0 74 11.4 112.7 48.2 112.7 36.2 0 71.7-46.4 91-77.8l62.2-104c40.3 34.3 68.4 60.9 68.4 93.3 0 20.1-12.7 39.8-32 39.8-24.2 0-39.6-25.5-55.9-25.5-13.6 0-30.9 26.2-30.9 41 0 14 30.6 33.9 85.5 33.9 81.1 0 124.5-55.6 150.6-117.2 5 73.1 34.1 115.8 79.6 115.8 29.8 0 64.2-37.7 79.9-83.6 0 0 1.5 11.9 13.4 36.4 16.4 31.9 41.3 46.6 72.2 46.6 38.5 0 71.4-23.3 91.5-62.5 3 29.7 27.9 62.3 68 62.3 25.1 0 48-19.3 63.1-51 0 0 19.5 52.4 75.8 52.4 31.6 0 69.1-29.3 78.1-50.6l1 31-83.6 77.1c-24.3 23.6-50.1 57.4-50.1 94.9 0 47.7 45 75.1 84.6 75.1 41.2 0 68.5-26.1 83.5-47.9 18.8-28.3 26.8-81.6 26.8-133.7l-1.9-78.4c56.3-61.9 100.5-147.6 120.1-208.1l42.8-1.1c8.3-.6 7.9 2.7 6.7 7.5-7.5 31.8-14.1 67.7-14.1 103.6 0 59.2 13.6 85 33.2 106 17 17.6 34 23.6 51.8 23.6 34.9 0 56.8-28.8 63.7-47 16.4 31.9 40.5 46.8 71.4 46.8 38.5 0 71.4-23.3 91.5-62.5 3 29.7 27.9 62.3 68 62.3 29.9 0 47.3-17.3 60.9-49.8.3 10.5.7 21.6 1 32.1.4 5.4 4.7 8.8 8.6 10.2 12.7 4.8 23.9 7.2 33.9 7.2 26.1 0 31.8-5.4 31.8-22.5 0-28.2.8-72.7 8.8-108.5 8.5-35.6 21.3-75.9 39-104 1.6-2.9 5.5-2.1 5.7 1.4 2.5 60 6.6 161.6 22.3 187.9 7.8 12.5 19.8 21.7 37.8 21.7 8.4 0 18.8-3.6 21.4-5.8 2.7-2.1 4-4.4 3.9-8.7 0-76.7 23.9-151 47.9-200.9.7-1.5 2.5-1.6 2.5.4l-1.3 55.3c0 90.8 6.5 148.1 51.9 175.7 8.9 5 19 7.6 29.2 7.6 23.2 0 44.2-13 54.6-33.8 8.5-16.2 16.4-47.4 16.4-65 0-6.8.1-18-11.1-18-6.1 0-9.8 4.5-11.3 11.4-3.6 14.8-6.5 27.5-12 42.2-5.3 14-13.2 22.1-22.6 22.1-11 0-16.6-8.7-19.8-14-14-21.4-15.2-70.6-15.2-111.7l3.4-105.7c0-8.7-3.7-19.2-17.1-26.9-9.1-5.2-32-15-46-15-13 0-19.3 7.4-24 18.2-8.8 19.4-38.3 95.7-46.2 157.7-.3 1.6-2.3 2-2.5-.1-4.1-43.8-6.2-96.7-6.2-132.3 0-10.8-2.6-26.2-25.5-36.2-11.1-4.6-20.3-7.4-31.5-7.4-13.9 0-16.9 6.8-21.9 15.8-15.8 29.1-26.7 67.1-43 115.1l.2-109.7c0-5.1-3.1-11.8-12.1-13.7-22.3-5.1-32.7-7.5-41.5-7.5-6.4 0-9.9 5.1-9.9 10.6l-1.2 187c-4.3 22.9-21.8 77.5-46.6 77.5-20.4 0-29.9-20.6-29.9-106.9l3.7-140.3c0-8.9-5.8-12.6-14.3-16.3-12.1-4.8-21.8-6.7-34.1-6.7-15.5 0-20.8 7.4-17.6 25.2-17-23-34-35.7-64-35.7-60.3 0-105.7 72.5-105.7 177.8-.6 29.5 6.5 58.9 6.5 58.9-5.5 24.5-18.3 44.5-36 44.5-22.3 0-36.6-31.6-36.6-86.3 0-54.9 20.9-116.8 20.9-133.6 0-19.5-12.8-31.9-35.4-31.9-11.3 0-53.4 9.5-75 12.7 0 0 2.4-10.3 2.3-18.3 0-19.2-9-31.3-31.4-31.3-27.4 0-47.5 19.6-47.5 52.9 0 15 8.6 28.8 20 36.3-14.8 61.8-38.9 107.7-74.4 159.1l3-207.8c0-6.8-1.8-11-15-16.1-7-3-18.4-6.5-32.8-6.5-20.8 0-19.5 14.9-18.3 26-9.5-16.9-30.4-37-62.6-37-87.7 0-114.7 133.8-101.5 228.8 0 11.6-11.3 52.7-36.9 52.7-20.4 0-29.9-20.6-29.9-106.9l3.7-140.3c0-8.9-5.9-12.6-14.3-16.3-12.1-4.8-21.7-6.7-34-6.7-15.5 0-20.8 7.4-17.6 25.2-17-23-34-35.7-64-35.7-60.3 0-106.3 66.3-106.3 171.6 0 40.2-34.6 101.6-58.9 101.6-13.5 0-27.8-24.8-27.8-88 .1-43.1 5.9-189.9 5.9-189.9l84.7-1.4c4 0 6.4-4.5 7.9-7.2 3.9-7.9 5.8-13.2 5.8-22.6 0-8.5-1.7-11.6-12.6-12.3L882 103l3.6-78.7c.3-5-2.7-8.2-8.2-10.6C861 7.3 841 1.1 828.3 1.1zm256.5 206.2c22.6 0 45.5 20.6 45.5 93.7 0 92-33.5 134.9-59.3 134.9-24.2 0-42.5-34.1-42.5-101.1-.1-67.9 17.8-127.5 56.3-127.5zm813.6 0c22.6 0 45.5 20.6 45.5 93.7 0 92-33.5 134.9-59.3 134.9-24.2 0-42.5-34.1-42.5-101.1 0-67.9 17.9-127.5 56.3-127.5zm-516.1.4c29.5 0 42.5 30.4 42.5 89.3 0 88.8-26.4 139.4-58.5 139.4-20.5 0-44-33.6-42.8-99.7.1-42.3 13.9-129 58.8-129zm50 297.1v35c0 116.1-30.9 135.9-55.8 135.9-9.4 0-32.5-7.1-32.5-35.8 0-40.2 42-85.8 55-99.9l33.3-35.2z"/></svg>

          `
    },
    answers: [
      {
        title: 'Все говорят, что нужен сайт, но я сомневаюсь',
        content: `
              <p>Ваш продукт или услуга может действительно прекрасно продаваться без сайта.</p>
              <p>И если это так – мы откровенно вам об этом скажем и объясним свою позицию, предложив выгодную альтернативу.</p>
            `
      },
      {
        title: 'Не доверяете<br> подрядчикам? ',
        content: `
              <p>Одни советуют не экономить на сайте и продвижении. Другие говорят не переплачивать за “имя” студии. Третьи советуют фрилансера.</p>
              <p>Есть вариант – получить максимальную выгоду за нужный бюджет.</p>
            `
      },
      {
        title: 'Делаете сайт впервые или уже имели неприятный опыт?',
        content: `
              <p>В этом деле важно найти партнера – который дополнит ваш опыт, а не решит за вас, что делать. </p>
              <p>Который защитит от ошибки и вовремя посоветует лучший вариант. Который искренне желает вашего успеха так же, как вы. </p>
            `
      }
    ],
    top: {
      left: {
        year: '2016',
        caption:
          'Все начиналось с пары стульев, нескольких ноутбуков и бесконечного энтузиазма и…',
        content: `
              <p>больного сердца от однообразных сайтов и страничек Вконтакте, с творцов по натуре, но с тягой к технологиям и e-commerce.</p>
              <p>Почему  в Харькове все еще нет команды, которая могла бы дать грамотное комплексное решение всех проблем бизнеса в интернете? Почему нет тех «своих ребят», которым можно доверить себя, свое дело и ответственность за результат?</p>
              <p>Это было лето 2016. Когда мы решили – этому городу нужен герой!  И создали компанию, которая порвет все шаблоны и станет проводником любого бизнеса в бесконечный цифровой мир.</p>
            `
      },
      right: {
        now: 'СЕЙЧАС',
        img: {
          src: 'img/about-artmarks.png',
          alt: 'ArtMarks'
        },
        items: [
          {
            title: '3 года работы',
            content: `
                  <p>2016 год: № 200 в Украине, №50 – в Харькове<br>2017 год: топ-50 в Украине, №16 в Харькове<br>2018 год: топ-40 в Украине, №5 в Харькове</p>
                `,
            icon: `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 53 56"><linearGradient id="dark-blue-gradient"><stop offset="0%" stop-color="#972fda"></stop><stop offset="100%" stop-color="#322fb8"></stop></linearGradient><path d="M53 35v-2H42c-.6 0-1 .4-1 1h-4v-8c0-.6-.4-1-1-1-3.3 0-6 2.7-6 6v3h-2v-8.3c3.5-.6 6.6-2.3 9-4.7 7.2 0 13-5.8 13-13V4c0-.6-.4-1-1-1h-7V1c0-.6-.4-1-1-1H9c-.6 0-1 .4-1 1v2H1c-.6 0-1 .4-1 1v4c0 7.2 5.8 13 13 13 2.4 2.4 5.5 4.1 9 4.7V34h-1c-1.7 0-3 1.3-3 3 0 .8.3 1.5.8 2-.5.5-.8 1.2-.8 2s.3 1.5.8 2c-.5.5-.8 1.2-.8 2s.3 1.5.8 2c-.5.5-.8 1.2-.8 2 0 .4.1.7.2 1.1-2.4.4-4.2 2.4-4.2 4.9 0 .6.4 1 1 1h20c.6 0 1-.4 1-1 0-1.1-.4-2.2-1-3h6c0 .6.4 1 1 1h11v-2h-6V35h6zM20 49c0-.6.4-1 1-1h8c.6 0 1 .4 1 1s-.4 1-1 1h-8c-.6 0-1-.4-1-1zm0-4c0-.6.4-1 1-1h8c.6 0 1 .4 1 1s-.4 1-1 1h-8c-.6 0-1-.4-1-1zm0-4c0-.6.4-1 1-1h8c.6 0 1 .4 1 1s-.4 1-1 1h-8c-.6 0-1-.4-1-1zM48 5v3c0 5.4-4 10-9.2 10.8C40.8 16 42 12.6 42 9V5h6zM2 8V5h6v4c0 3.7 1.2 7.1 3.2 9.8C6 18 2 13.4 2 8zm8 1V2h30v7c0 8.3-6.7 15-15 15S10 17.3 10 9zm14 16.9c.3 0 .7.1 1 .1.3 0 .7 0 1-.1V34h-2v-8.1zM21 36h8c.6 0 1 .4 1 1s-.4 1-1 1h-8c-.6 0-1-.4-1-1s.4-1 1-1zm12.8 18H16.2c.4-1.2 1.5-2 2.8-2h12c1.3 0 2.4.8 2.8 2zm-2-4c.1-.3.2-.6.2-1 0-.8-.3-1.5-.8-2 .5-.5.8-1.2.8-2s-.3-1.5-.8-2c.5-.5.8-1.2.8-2s-.3-1.5-.8-2c.5-.5.8-1.2.8-2 0-.5-.1-.9-.3-1.3.2-.2.3-.4.3-.7v-4c0-1.9 1.3-3.4 3-3.9V35c0 .6.4 1 1 1h5v14h-9.2zM43 35h2v16h-2V35z"/><path d="M32 15c0-3.9-3.1-7-7-7s-7 3.1-7 7 3.1 7 7 7 7-3.1 7-7zm-12 0c0-2.8 2.2-5 5-5s5 2.2 5 5-2.2 5-5 5-5-2.2-5-5zM20 4h2v2h-2zM24 4h2v2h-2zM28 4h2v2h-2z"/></svg>`
          },
          {
            title: 'более 50 сотрудников',
            content: `
                  <p>Которые уже не помещаются на тех трех стульях. Теперь мы получаем награды, задаем стандарты и помогаем других продвигаться к результату.</p>
                `,
            icon: `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 56 56"><path d="M12 24c3.3 0 6-2.7 6-6s-2.7-6-6-6-6 2.7-6 6 2.7 6 6 6zm0-10c2.2 0 4 1.8 4 4s-1.8 4-4 4-4-1.8-4-4 1.8-4 4-4zM44 24c3.3 0 6-2.7 6-6s-2.7-6-6-6-6 2.7-6 6 2.7 6 6 6zm0-10c2.2 0 4 1.8 4 4s-1.8 4-4 4-4-1.8-4-4 1.8-4 4-4zM54 26v13c0 1.7-1.3 3-3 3V31c0-2.8-2.2-5-5-5h-5c-.6 0-1 .4-1 1v6h-8c-.6 0-1 .4-1 1v3h-6v-3c0-.6-.4-1-1-1h-8v-6c0-.6-.4-1-1-1h-5c-2.8 0-5 2.2-5 5v11c-1.7 0-3-1.3-3-3V26H0v13c0 2 1.2 3.8 3 4.6V56h2V44h10v11c0 .6.4 1 1 1h5V39h14v17h5c.6 0 1-.4 1-1V44h10v12h2V43.6c1.8-.8 3-2.5 3-4.6V26h-2zM20 37h-8v-6h-2v7c0 .6.4 1 1 1h7c.6 0 1 .4 1 1v14h-2V43c0-.6-.4-1-1-1H7V31c0-1.7 1.3-3 3-3h4v6c0 .6.4 1 1 1h8v2h-3zm20 5c-.6 0-1 .4-1 1v11h-2V40c0-.6.4-1 1-1h7c.6 0 1-.4 1-1v-7h-2v6H33v-2h8c.6 0 1-.4 1-1v-6h4c1.7 0 3 1.3 3 3v11h-9zM19 10v3c0 .4.3.8.7.9.1 0 .2.1.3.1.3 0 .6-.1.8-.4l2.7-3.6H31c1.7 0 3-1.3 3-3V3c0-1.7-1.3-3-3-3H19c-1.7 0-3 1.3-3 3v4c0 1.7 1.3 3 3 3zm-1-7c0-.6.4-1 1-1h12c.6 0 1 .4 1 1v4c0 .6-.4 1-1 1h-8c-.3 0-.6.1-.8.4L21 10V9c0-.6-.4-1-1-1h-1c-.6 0-1-.4-1-1V3z"/><path d="M20 4h10v2H20zM27 25h6v2h-6z"/><path d="M26 21c-1.7 0-3 1.3-3 3v4c0 1.7 1.3 3 3 3h8c1.7 0 3-1.3 3-3v-.7l1.8-2.7c.2-.3.2-.7 0-1-.1-.4-.4-.6-.8-.6h-1.2c-.4-1.2-1.5-2-2.8-2h-8zm9 3c0 .6.4 1 1 1h.1l-1 1.4c0 .2-.1.4-.1.6v1c0 .6-.4 1-1 1h-8c-.6 0-1-.4-1-1v-4c0-.6.4-1 1-1h8c.6 0 1 .4 1 1zM23 16h2v2h-2zM27 16h2v2h-2zM31 16h2v2h-2z"/></svg>`
          },
          {
            title: '3 комфортных офиса',
            content: `
                  <p>Уют, комфортное рабочее пространство и свободная обстановка – в такой атмосфере хочется не просто работать, а творить.</p>
                `,
            icon: `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 56 56"><path d="M55.1 29l.9-4.8c.1-.3 0-.6-.2-.8-.2-.3-.5-.4-.8-.4h-3v-3.2c1.2-.4 2-1.5 2-2.8v-2c0-.6-.4-1-1-1h-4c-.6 0-1 .4-1 1v2c0 1.3.8 2.4 2 2.8V23h-3c-.3 0-.6.1-.8.4-.2.2-.2.5-.2.8l.9 4.8H36v-2h5c1.7 0 3-1.3 3-3V14c0-1.7-1.3-3-3-3H23c-1.7 0-3 1.3-3 3v10c0 1.7 1.3 3 3 3h5v2h-8v-1c0-1.1-.9-2-2-2h-3c-1.1 0-2 .9-2 2v1h-1.1c-.4-2.1-2.1-3.7-4.2-3.9l-3.2-6.4C5.4 18.1 6 17.1 6 16c0-.8-.3-1.5-.8-2l1.9-.9c-.1.3-.1.6-.1.9 0 .6.4 1 1 1h8c.6 0 1-.4 1-1 0-1.6-.8-3.1-2-4V9c0-1.7-1.3-3-3-3S9 7.3 9 9v.9L2.7 13c-1.5.2-2.7 1.4-2.7 3 0 1.4 1 2.6 2.3 2.9l3.2 6.3c-1.7.5-3 2-3.4 3.7H1c-.6 0-1 .4-1 1v4c0 .6.4 1 1 1h2v20c0 .6.4 1 1 1h5c.6 0 1-.4 1-1V35h36v20c0 .6.4 1 1 1h5c.6 0 1-.4 1-1V35h2c.6 0 1-.4 1-1v-4c0-.5-.4-1-.9-1zM50 16h2v1c0 .6-.4 1-1 1s-1-.4-1-1v-1zm-1.8 9h5.6l-.8 4h-4l-.8-4zM23 13h18c.6 0 1 .4 1 1v7H22v-7c0-.6.4-1 1-1zm-1 11v-1h20v1c0 .6-.4 1-1 1H23c-.6 0-1-.4-1-1zm8 3h4v2h-4v-2zm-15 1h3v1h-3v-1zM9.2 13c.4-1.2 1.5-2 2.8-2s2.4.8 2.8 2H9.2zM12 8c.6 0 1 .4 1 1v.1c-.3-.1-.7-.1-1-.1s-.7 0-1 .1V9c0-.6.4-1 1-1zm-9 7c.6 0 1 .4 1 1s-.4 1-1 1-1-.4-1-1 .4-1 1-1zm4 12c1.3 0 2.4.8 2.8 2H4.2c.4-1.2 1.5-2 2.8-2zm1 27H5V35h3v19zm43 0h-3V35h3v19zm3-21H2v-2H54v2z"/><path d="M35 40c0-1.7-1.3-3-3-3h-8c-1.7 0-3 1.3-3 3s1.3 3 3 3h.6L21 54.7V56h2v-.8L26.7 43h.3v13h2V43h.3L33 55.2v.8h2v-1-.3L31.4 43h.6c1.7 0 3-1.3 3-3zm-12 0c0-.6.4-1 1-1h8c.6 0 1 .4 1 1s-.4 1-1 1h-8c-.6 0-1-.4-1-1zM55 0H45c-.6 0-1 .4-1 1v8c0 .6.4 1 1 1h10c.6 0 1-.4 1-1V1c0-.6-.4-1-1-1zm-1 2v3l-2.4-1.8c-.4-.3-1-.3-1.3.1l-1.5 1.5-1.4-.7c-.4-.2-.8-.1-1.2.2l-.2.3V2h8zm-8 6v-.6l1.2-1.2 1.4.7c.4.2.8.1 1.2-.2l1.4-1.4L54 7.5V8h-8zM26.313 18.273l4.03-4.03 1.415 1.414-4.03 4.03zM32.313 18.273l4.03-4.03 1.414 1.414-4.03 4.03z"/></svg>`
          },
          {
            title: '4 отдела',
            content: `
                  <p>Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation.</p>
                `,
            icon: `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 57 57"><path d="M39 13c3.3 0 6-2.7 6-6s-2.7-6-6-6-6 2.7-6 6 2.7 6 6 6zm0-10c2.2 0 4 1.8 4 4s-1.8 4-4 4h-.3c.8-.7 1.3-1.8 1.3-3h-2c0 1-.7 1.8-1.7 2-.8-.8-1.3-1.8-1.3-3 0-2.2 1.8-4 4-4zM8 25c3.3 0 6-2.7 6-6s-2.7-6-6-6-6 2.7-6 6 2.7 6 6 6zm0-10c2.2 0 4 1.8 4 4 0 1.2-.5 2.2-1.3 3-1-.2-1.7-1-1.7-2H7c0 1.2.5 2.2 1.3 3H8c-2.2 0-4-1.8-4-4s1.8-4 4-4z"/><path d="M56.3 2.1l-6-2c-.3-.2-.6-.1-.9.1-.2.2-.4.5-.4.8v13H35c-.2 0-.5.1-.6.2l-6 5-.3.3-2.8 5.7-6.3 2.7-5.6-1.9H5c-2.8 0-5 2.2-5 5v11c0 .6.4 1 1 1h3v12H0v2h14c.6 0 1-.4 1-1v-5h14c.6 0 1-.4 1-1v-5h11c.6 0 1-.4 1-1v-5h14v-2h-2v-8c0-2.8-2.2-5-5-5h-4v-4h5c2.8 0 5-2.2 5-5V9c0-.6-.4-1-1-1h-3V5.7l5.3-1.8c.4-.1.7-.5.7-.9s-.3-.8-.7-.9zM40.5 16l-.5 1.3-.5-1.3h1zM14 49c-.6 0-1 .4-1 1v5h-2V43h5v6h-2zm4 0v-7c0-.6-.4-1-1-1h-7c-.6 0-1 .4-1 1v13H6V32H4v9H2V31c0-1.7 1.3-3 3-3h3v7h2v-7h2.8l5.8 1.9c.2.1.5.1.7 0l6.2-2.7.6.9.3.5-6.6 3.4-6.7-1c-.3 0-.6 0-.8.2-.2.2-.3.5-.3.8v5c0 .6.4 1 1 1h5c1.7 0 3 1.3 3 3v8h-3zm11-6c-.6 0-1 .4-1 1v5h-5v-8c0-2.8-2.2-5-5-5h-4v-2.8l5.9.8c.2 0 .4 0 .6-.1l8-4c.1-.1.3-.2.4-.3l3.9-5.9L35 22v21h-6zm18-6h-5v-6h5v6zm6-22c0 1.7-1.3 3-3 3h-6c-.6 0-1 .4-1 1v6c0 .6.4 1 1 1h5c1.7 0 3 1.3 3 3v8h-3v-7c0-.6-.4-1-1-1h-7c-.6 0-1 .4-1 1v13h-3V20c0-.4-.2-.7-.6-.9-.3-.2-.7-.1-1 .1l-4 3c-.1.1-.2.1-.2.2L28 27.2l-.8-1.3 2.6-5.3 5.6-4.6h2l1.7 4.4c.2.4.5.6.9.6s.8-.2.9-.6l1.7-4.4H50c.6 0 1-.4 1-1v-5h2v5zM51 3.6V2.4l1.8.6-1.8.6zM24 5h2v2h-2zM20 5h2v2h-2zM16 5h2v2h-2z"/></svg>`
          }
        ]
      }
    }
  }
};

const aboutTeam = {
  state: {
    pageTitle: 'Наша команда',
    img: {
      src: '/img/p-team-artmarks.png',
      alt: 'ArtMarks'
    },
    caption: {
      text: 'НАША КОМАНДА',
      content: `
            <p>Мы работаем вместе, напряженно, преданно, с любовью, драйвом, страстью и любопытством. Будучи фанатиками родственными по духу, мы сочетаем в себе творчество с мастерством, талант с опытом, и свежие идеи с экспертностью.</p>
          `
    },
    team: [
      {
        name: 'артур',
        position: 'Учредитель, создатель компании',
        img: '/img/p-team-1.jpg',
        socials: [
          {
            icon:
              '<svg width="16" height="16" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 96.124 96.123"><path d="M72.089.02L59.624 0C45.62 0 36.57 9.285 36.57 23.656v10.907H24.037a1.96 1.96 0 0 0-1.96 1.961v15.803a1.96 1.96 0 0 0 1.96 1.96H36.57v39.876a1.96 1.96 0 0 0 1.96 1.96h16.352a1.96 1.96 0 0 0 1.96-1.96V54.287h14.654a1.96 1.96 0 0 0 1.96-1.96l.006-15.803a1.963 1.963 0 0 0-1.961-1.961H56.842v-9.246c0-4.444 1.059-6.7 6.848-6.7l8.397-.003a1.96 1.96 0 0 0 1.959-1.96V1.98A1.96 1.96 0 0 0 72.089.02z"/></svg>',
            url: 'http://facebook.com'
          },
          {
            icon:
              '<svg width="12" height="12" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 438.536 438.535"><path d="M5.424 145.895H99.64v282.932H5.424zM408.842 171.739c-19.791-21.604-45.967-32.408-78.512-32.408-11.991 0-22.891 1.475-32.695 4.427-9.801 2.95-18.079 7.089-24.838 12.419-6.755 5.33-12.135 10.278-16.129 14.844-3.798 4.337-7.512 9.389-11.136 15.104v-40.232h-93.935l.288 13.706c.193 9.139.288 37.307.288 84.508 0 47.205-.19 108.777-.572 184.722h93.931V270.942c0-9.705 1.041-17.412 3.139-23.127 4-9.712 10.037-17.843 18.131-24.407 8.093-6.572 18.13-9.855 30.125-9.855 16.364 0 28.407 5.662 36.117 16.987 7.707 11.324 11.561 26.98 11.561 46.966V428.82h93.931V266.664c-.007-41.688-9.897-73.328-29.694-94.925zM53.103 9.708c-15.796 0-28.595 4.619-38.4 13.848C4.899 32.787 0 44.441 0 58.529 0 72.42 4.758 84.034 14.275 93.358c9.514 9.325 22.078 13.99 37.685 13.99h.571c15.99 0 28.887-4.661 38.688-13.99 9.801-9.324 14.606-20.934 14.417-34.829-.19-14.087-5.047-25.742-14.561-34.973C81.562 14.323 68.9 9.708 53.103 9.708z"/></svg>',
            url: 'http://linkedin.com'
          },
          {
            icon:
              '<svg width="16" height="16" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path d="M373.659 0H138.341C62.06 0 0 62.06 0 138.341v235.318C0 449.94 62.06 512 138.341 512h235.318C449.94 512 512 449.94 512 373.659V138.341C512 62.06 449.94 0 373.659 0zm96.977 373.659c0 53.473-43.503 96.977-96.977 96.977H138.341c-53.473 0-96.977-43.503-96.977-96.977V138.341c0-53.473 43.503-96.977 96.977-96.977h235.318c53.473 0 96.977 43.503 96.977 96.977v235.318z"/><path d="M370.586 238.141c-3.64-24.547-14.839-46.795-32.386-64.342-17.547-17.546-39.795-28.746-64.341-32.385a114.73 114.73 0 0 0-33.682 0c-30.336 4.499-57.103 20.541-75.372 45.172-18.269 24.631-25.854 54.903-21.355 85.237 4.499 30.335 20.541 57.102 45.172 75.372 19.996 14.831 43.706 22.619 68.153 22.619 5.667 0 11.375-.418 17.083-1.265 30.336-4.499 57.103-20.541 75.372-45.172 18.27-24.63 25.855-54.901 21.356-85.236zm-102.795 89.491c-19.405 2.882-38.77-1.973-54.527-13.66-15.757-11.687-26.019-28.811-28.896-48.216-2.878-19.405 1.973-38.77 13.66-54.527 11.688-15.757 28.811-26.019 48.217-28.897a73.42 73.42 0 0 1 21.545.001c32.231 4.779 57.098 29.645 61.878 61.877 5.94 40.058-21.817 77.482-61.877 83.422zM400.049 111.951a20.83 20.83 0 0 0-14.625-6.058 20.826 20.826 0 0 0-14.625 6.058 20.814 20.814 0 0 0-6.058 14.625 20.814 20.814 0 0 0 6.058 14.625 20.83 20.83 0 0 0 14.625 6.058 20.826 20.826 0 0 0 14.625-6.058 20.83 20.83 0 0 0 6.058-14.625 20.826 20.826 0 0 0-6.058-14.625z"/></svg>',
            url: 'http://instagram.com'
          }
        ]
      },
      {
        name: 'ИВАН',
        position: 'Соучредитель, СЕО',
        img: '/img/p-team-1.jpg'
      },
      {
        name: 'ДИМА',
        position: 'Руководитель отдела WEB-разработки',
        img: '/img/p-team-1.jpg',
        socials: [
          {
            icon:
              '<svg width="16" height="16" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 96.124 96.123"><path d="M72.089.02L59.624 0C45.62 0 36.57 9.285 36.57 23.656v10.907H24.037a1.96 1.96 0 0 0-1.96 1.961v15.803a1.96 1.96 0 0 0 1.96 1.96H36.57v39.876a1.96 1.96 0 0 0 1.96 1.96h16.352a1.96 1.96 0 0 0 1.96-1.96V54.287h14.654a1.96 1.96 0 0 0 1.96-1.96l.006-15.803a1.963 1.963 0 0 0-1.961-1.961H56.842v-9.246c0-4.444 1.059-6.7 6.848-6.7l8.397-.003a1.96 1.96 0 0 0 1.959-1.96V1.98A1.96 1.96 0 0 0 72.089.02z"/></svg>',
            url: 'http://facebook.com'
          },
          {
            icon:
              '<svg width="12" height="12" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 438.536 438.535"><path d="M5.424 145.895H99.64v282.932H5.424zM408.842 171.739c-19.791-21.604-45.967-32.408-78.512-32.408-11.991 0-22.891 1.475-32.695 4.427-9.801 2.95-18.079 7.089-24.838 12.419-6.755 5.33-12.135 10.278-16.129 14.844-3.798 4.337-7.512 9.389-11.136 15.104v-40.232h-93.935l.288 13.706c.193 9.139.288 37.307.288 84.508 0 47.205-.19 108.777-.572 184.722h93.931V270.942c0-9.705 1.041-17.412 3.139-23.127 4-9.712 10.037-17.843 18.131-24.407 8.093-6.572 18.13-9.855 30.125-9.855 16.364 0 28.407 5.662 36.117 16.987 7.707 11.324 11.561 26.98 11.561 46.966V428.82h93.931V266.664c-.007-41.688-9.897-73.328-29.694-94.925zM53.103 9.708c-15.796 0-28.595 4.619-38.4 13.848C4.899 32.787 0 44.441 0 58.529 0 72.42 4.758 84.034 14.275 93.358c9.514 9.325 22.078 13.99 37.685 13.99h.571c15.99 0 28.887-4.661 38.688-13.99 9.801-9.324 14.606-20.934 14.417-34.829-.19-14.087-5.047-25.742-14.561-34.973C81.562 14.323 68.9 9.708 53.103 9.708z"/></svg>',
            url: 'http://linkedin.com'
          },
          {
            icon:
              '<svg width="16" height="16" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path d="M373.659 0H138.341C62.06 0 0 62.06 0 138.341v235.318C0 449.94 62.06 512 138.341 512h235.318C449.94 512 512 449.94 512 373.659V138.341C512 62.06 449.94 0 373.659 0zm96.977 373.659c0 53.473-43.503 96.977-96.977 96.977H138.341c-53.473 0-96.977-43.503-96.977-96.977V138.341c0-53.473 43.503-96.977 96.977-96.977h235.318c53.473 0 96.977 43.503 96.977 96.977v235.318z"/><path d="M370.586 238.141c-3.64-24.547-14.839-46.795-32.386-64.342-17.547-17.546-39.795-28.746-64.341-32.385a114.73 114.73 0 0 0-33.682 0c-30.336 4.499-57.103 20.541-75.372 45.172-18.269 24.631-25.854 54.903-21.355 85.237 4.499 30.335 20.541 57.102 45.172 75.372 19.996 14.831 43.706 22.619 68.153 22.619 5.667 0 11.375-.418 17.083-1.265 30.336-4.499 57.103-20.541 75.372-45.172 18.27-24.63 25.855-54.901 21.356-85.236zm-102.795 89.491c-19.405 2.882-38.77-1.973-54.527-13.66-15.757-11.687-26.019-28.811-28.896-48.216-2.878-19.405 1.973-38.77 13.66-54.527 11.688-15.757 28.811-26.019 48.217-28.897a73.42 73.42 0 0 1 21.545.001c32.231 4.779 57.098 29.645 61.878 61.877 5.94 40.058-21.817 77.482-61.877 83.422zM400.049 111.951a20.83 20.83 0 0 0-14.625-6.058 20.826 20.826 0 0 0-14.625 6.058 20.814 20.814 0 0 0-6.058 14.625 20.814 20.814 0 0 0 6.058 14.625 20.83 20.83 0 0 0 14.625 6.058 20.826 20.826 0 0 0 14.625-6.058 20.83 20.83 0 0 0 6.058-14.625 20.826 20.826 0 0 0-6.058-14.625z"/></svg>',
            url: 'http://instagram.com'
          }
        ]
      },
      {
        name: 'АРТЕМ',
        position: 'Таргетолог',
        img: '/img/p-team-1.jpg'
      },
      {
        name: 'Эля',
        position: 'Офис-менеджер',
        img: '/img/p-team-1.jpg'
      },
      {
        name: 'ВИКА',
        position: 'Project Manager (SMM)',
        img: '/img/p-team-1.jpg'
      },
      {
        name: 'Руслан',
        position: 'Back-End Developer ',
        img: '/img/p-team-1.jpg'
      },
      {
        name: 'ЛЕНА',
        position: 'Фотограф',
        img: '/img/p-team-1.jpg'
      },
      {
        name: 'АНДРЕЙ',
        position: 'Back-End Developer',
        img: '/img/p-team-1.jpg'
      },
      {
        name: 'АНДРЕЙ',
        position: 'Project Manager (WEB)',
        img: '/img/p-team-1.jpg'
      },
      {
        name: 'МАША',
        position: 'Аккаунт менеджер',
        img: '/img/p-team-1.jpg'
      },
      {
        name: 'ВИКА',
        position: 'Project Manager (SMM)',
        img: '/img/p-team-1.jpg'
      },
      {
        name: 'ОЛЯ',
        position: 'Digital Designer',
        img: '/img/p-team-1.jpg'
      },
      {
        name: 'КОСТЯ',
        position: 'Front-End Developer',
        img: '/img/p-team-1.jpg'
      }
    ]
  }
};

const blogPage = {
  state: {
    pageTitle: 'Блог',
    select: {
      defaultVal: 'Выберите рубрику',
      options: ['WEB разработка', 'SMM продвижение', 'SEO продвижение']
    },
    search: {
      placeholder: 'Поиск по статьям',
      icon: `<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 512 512"><path d="M495 466.2L377.2 348.4c29.2-35.6 46.8-81.2 46.8-130.9C424 103.5 331.5 11 217.5 11 103.4 11 11 103.5 11 217.5S103.4 424 217.5 424c49.7 0 95.2-17.5 130.8-46.7L466.1 495c8 8 20.9 8 28.9 0 8-7.9 8-20.9 0-28.8zm-277.5-83.3C126.2 382.9 52 308.7 52 217.5S126.2 52 217.5 52C308.7 52 383 126.3 383 217.5s-74.3 165.4-165.5 165.4z"/></svg>`
    },
    btn: {
      text: 'ПОКАЗАТЬ ЕЩЕ'
    },
    items: [
      {
        link: '/blog/5types',
        mainImg: '/img/blog-item.jpg',
        title: '5 видов вкусного контента, который ждут читатели',
        views: '172',
        date: '21.12.2018',
        tags: ['SMM', 'Маркетинг']
      },
      {
        link: '/blog/5types',
        mainImg: '/img/blog-item.jpg',
        title: '5 видов вкусного контента, который ждут читатели',
        views: '172',
        date: '21.12.2018',
        tags: ['SMM', 'Маркетинг']
      },
      {
        link: '/blog/5types',
        mainImg: '/img/blog-item.jpg',
        title: '5 видов вкусного контента, который ждут читатели',
        views: '172',
        date: '21.12.2018',
        tags: ['SMM', 'Маркетинг']
      },
      {
        link: '/blog/5types',
        mainImg: '/img/blog-item.jpg',
        title: '5 видов вкусного контента, который ждут читатели',
        views: '172',
        date: '21.12.2018',
        tags: ['SMM', 'Маркетинг']
      },
      {
        link: '/blog/5types',
        mainImg: '/img/blog-item.jpg',
        title: '5 видов вкусного контента, который ждут читатели',
        views: '172',
        date: '21.12.2018',
        tags: ['SMM', 'Маркетинг']
      }
    ],
    caption: {
      text: 'БЛОГ'
    }
  }
};

const blogItemPage = {
  state: {
    similar: {
      caption: {
        text: 'ПОХОЖИЕ СТАТЬИ'
      },
      items: [
        {
          mainImg: '/img/blog-item.jpg',
          title:
            'Как с помощью подарков заставить покупателя надолго остаться с вами?',
          link: '/blog/another'
        },
        {
          mainImg: '/img/blog-item.jpg',
          title:
            'Как с помощью подарков заставить покупателя надолго остаться с вами?',
          link: '/blog/another'
        },
        {
          mainImg: '/img/blog-item.jpg',
          title:
            'Как с помощью подарков заставить покупателя надолго остаться с вами?',
          link: '/blog/another'
        },
        {
          mainImg: '/img/blog-item.jpg',
          title:
            'Как с помощью подарков заставить покупателя надолго остаться с вами?',
          link: '/blog/another'
        }
      ]
    },
    categories: {
      caption: {
        text: 'ДРУГИЕ РУБРИКИ'
      },
      items: ['SMM', 'Маркетинг']
    },
    main: {
      pageTitle: '5 видов вкусного контента, который ждут читатели',
      mainImg: '/img/blog-item.jpg',
      title: '5 видов вкусного контента, который ждут читатели',
      views: '172',
      date: '21.12.2018',
      tags: ['SMM', 'Маркетинг'],
      content: `
          <p>«О чем написать в блоге, чтобы было интересно?». Типичный вопрос, который задают себе маркетологи и копирайтеры, когда подходит время для новой публикации. На практике, даже опытные блогеры и писатели задают себе этот вопрос, правда быстро находят выход из ситуации.</p>
          <p>Мы уже писали о «вечнозеленом контенте». На этот раз предлагаем вам 5 видов контента, который по достоинству будет оценен вашими пользователями.</p>
          <h3>1. Контент, который вдохновляет и мотивирует</h3>
          <p>Нет ничего увлекательней, чем читать истории, которые заставляют поверить в себя, переступить через жизненные неудачи и продолжать добиваться поставленных целей ради заветной мечты.</p>
          <ul>
            <li>План для написания контента такого рода:</li>
            <li>- вдохновляющее вступление</li>
            <li>- четкий план действий для достижения цели</li>
            <li>- указание направления, напутствия</li>
          </ul>
          <p>Главная цель — не поднять настроение, а заставить действовать и сделать шаг навстречу своим целям.</p>
          <img src="/img/blog-item-1.jpg" alt="alt">
          <h3>2. Контент, который раскрывает секреты и тайны</h3>
          <p>Понимать, что есть секрет и постепенно раскрывать его — приятный процесс, который любят все интернет-пользователи. Нет,мы не предлагаем вам разоблачить план по захвату мира. Вполне хватит информации, которая не лежит на поверхности и не слишком очевидна. </p>
          <p>Почему бы не затронуть тему, которая на первый взгляд может показаться вам не интересной и не полезной для читателя? Мы уверены, что при эффектной подаче в индивидуальном стиле вы удивите пользователей, предоставив им информацию, о которой они не знали раньше.</p>
          <img src="/img/blog-item-2.jpg" alt="alt">
          <h3>3. Контент, который рассказывает истории</h3>
          <p>Да, это то, о чем вы подумали. Король контента — давно полюбившийся всеми сторителлинг. Не относитесь к своим читателям как к безликой массе. Ваши публикации должны затрагивать каждого. Хорошая, искренняя история притягивает к себе «правильную» читательскую аудиторию, которая на долго останется с вами. Главное условие: пишите искренне и от души, делитесь положительными эмоциями и своими достижениями.</p>
          <img src="/img/blog-item-3.jpg" alt="alt">
          <h3>4. Контент, который визуализирует информацию</h3>
          <p>Все любят картинки. Особенно пользователям по душе, когда изображение несет в себе полезную информацию, визуализирует данные. Инфографика — вид контента, который больше всего ожидают от вас читатели.</p>
          <p>У вас может возникнуть вопрос: как создавать визуальный контент, если вы не дизайнер, а PowerPoint мягко говоря уже не «катит»?</p>
          <p>В таком случае у вас есть 2 варианта: обратиться на помощь к штатному дизайнеру, который воплотит вашу задумку или в случае его отсутствия, поработать с полезными приложениями-инструментами.</p>
          <img src="/img/blog-item-4.jpg" alt="alt">
          <h3>5. Контент, который помогает моментально «брать и делать»</h3>
          <p>Последний в списке, но не по важности вид контента, который несет в себе пожалуй самую большую ценность. Подумайте, часто ли вам встречались публикации, после прочтения которых вы моментально могли перейти к применению прочитанного на практике? </p>
          <p>Возьмите за правило 2 раза в месяц публиковать материал, который содержит в себе большой обзор по конкретной тематике, чек-лист, пошаговое руководство или FAQ. Контент такого типа должен помогать найти ответы на вопросы, которые волнуют ваших читателей.</p>
          <img src="/img/blog-item-5.jpg" alt="alt">
        `
    }
  }
};

const aboutOffice = {
  state: {
    pageTitle: 'Наши офисы',
    caption: {
      text: 'НАШИ ОФИСЫ'
    },
    items: [
      {
        img: '/img/office-1.jpg',
        alt: 'alt'
      },
      {
        img: '/img/office-2.jpg',
        alt: 'alt',
        centered: true
      },
      {
        img: '/img/office-3.jpg',
        alt: 'alt'
      },
      {
        img: '/img/office-5.jpg',
        alt: 'alt',
        centered: true
      },
      {
        img: '/img/office-4.jpg',
        alt: 'alt'
      },
      {
        img: '/img/office-6.jpg',
        alt: 'alt'
      },
      {
        img: '/img/office-7.jpg',
        alt: 'alt',
        centered: true
      }
    ]
  }
};

const aboutAwards = {
  state: {
    pageTitle: 'Наши награды',
    caption: {
      text: 'Наши награды'
    },
    certificates: [
      {
        img: '/img/certificate-1.jpg',
        alt: 'alt'
      },
      {
        img: '/img/certificate-2.jpg',
        alt: 'alt'
      },
      {
        img: '/img/certificate-3.jpg',
        alt: 'alt'
      },
      {
        img: '/img/certificate-4.jpg',
        alt: 'alt'
      },
      {
        img: '/img/certificate-5.jpg',
        alt: 'alt'
      }
    ]
  }
};

const contactsPage = {
  state: {
    pageTitle: 'Контакты',
    caption: {
      text: 'Контакты'
    },
    form: {
      caption: {
        text: 'ОСТАЛИСЬ ВОПРОСЫ?<br> МЫ С РАДОСТЬЮ ВАМ ПОМОЖЕМ'
      },
      inputs: {
        name: {
          placeholder: 'Имя',
          required: true
        },
        phone: {
          placeholder: 'Телефон',
          required: true,
          mask: '+38 (0##)-###-##-##'
        },
        email: {
          placeholder: 'E-mail',
          required: true
        },
        text: {
          placeholder: 'Вопрос',
          required: true
        },
        file: {
          placeholder: 'Добавить файл',
          required: false,
          multiple: true,
          label: 'Добавить файл',
          loaded: 'Загружено'
        }
      },
      btn: {
        text: 'отправить'
      }
    },
    map: {
      zoom: 17,
      mapTypeId: 'roadmap',
      center: {
        lat: 49.985442,
        lng: 36.234196
      },
      options: {
        disableDefaultUI: true
      },
      icon: '/img/placeholder-filled-point.png'
    },
    top: {
      background: '/img/contacts-top.jpg',
      title: 'СВЯЖИТЕСЬ С НАМИ',
      phones: {
        title: 'телефоны:',
        items: ['(096) 600-47-56', '(099) 517-60-86', '(063) 944-54-90']
      },
      email: {
        title: 'email:',
        values: [
          {
            value: 'info@art-marks.net',
            href: 'mailto:info@art-marks.net'
          }
        ]
      },
      skype: {
        title: 'skype:',
        values: [
          {
            value: 'artmarks.ua',
            href: 'skype:artmarks.ua?chat'
          }
        ]
      }
    },
    bottom: {
      title: 'НАШ АДРЕС',
      address: {
        values: ['г. Харьков, ул. Кузнечная, 9']
      },
      schedule: {
        title: 'график работы:',
        values: ['Пн-Пт: 09:00-18:00', 'Сб-Вс: выходные']
      }
    }
  }
};

const briefsPage = {
  state: {
    pageTitle: 'Брифы',
    caption: {
      text: 'БРИФЫ',
      content: `<p>Данный документ поможет Вам как можно точнее сформулировать желания и потребности на счет разработки сайта, так же он станет гарантом профессионального и успешного сайта, а это в Ваших интересах. Качественное заполнение брифа занимает большое количество времени, но мы постарались максимально минимизировать количество возникающих у Вас вопросов и описали каждую страницу и элемент отдельно</p>`
    },
    briefs: {
      web: {
        title: 'Web',
        titleColor: '#f1f0fd',
        links: [
          {
            top: 'Бриф на разработку сайта компании',
            items: [
              {
                link: 'http://kmmc.in/wp-content/uploads/2014/01/lesson2.pdf',
                isDownload: false,
                isBlank: true,
                isAbsoluteLink: true,
                text: 'Заполнить online'
              },
              {
                link: '/img/test.pdf',
                isDownload: true,
                isBlank: false,
                isAbsoluteLink: true,
                text: 'Скачать документ Microsoft Word'
              }
            ]
          },
          {
            top: 'Бриф на разработку интернет-магазина',
            items: [
              {
                link: 'http://kmmc.in/wp-content/uploads/2014/01/lesson2.pdf',
                isDownload: false,
                isBlank: true,
                isAbsoluteLink: true,
                text: 'Заполнить online'
              },
              {
                link: '/img/test.pdf',
                isDownload: true,
                isBlank: false,
                isAbsoluteLink: true,
                text: 'Скачать документ Microsoft Word'
              }
            ]
          },
          {
            top: 'Бриф на разработку landing page',
            items: [
              {
                link: 'http://kmmc.in/wp-content/uploads/2014/01/lesson2.pdf',
                isDownload: false,
                isBlank: true,
                isAbsoluteLink: true,
                text: 'Заполнить online'
              },
              {
                link: '/img/test.pdf',
                isDownload: true,
                isBlank: false,
                isAbsoluteLink: true,
                text: 'Скачать документ Microsoft Word'
              }
            ]
          }
        ]
      },
      smm: {
        title: 'smm',
        titleColor: '#e2f6fd',
        links: [
          {
            top: 'Бриф на SMM продвижение',
            items: [
              {
                link: 'http://kmmc.in/wp-content/uploads/2014/01/lesson2.pdf',
                isDownload: false,
                isBlank: true,
                isAbsoluteLink: true,
                text: 'Заполнить online'
              },
              {
                link: '/img/test.pdf',
                isDownload: true,
                isBlank: false,
                isAbsoluteLink: true,
                text: 'Скачать документ Microsoft Word'
              }
            ]
          },
          {
            top: 'Бриф на фирменный стиль',
            items: [
              {
                link: 'http://kmmc.in/wp-content/uploads/2014/01/lesson2.pdf',
                isDownload: false,
                isBlank: true,
                isAbsoluteLink: true,
                text: 'Заполнить online'
              },
              {
                link: '/img/test.pdf',
                isDownload: true,
                isBlank: false,
                isAbsoluteLink: true,
                text: 'Скачать документ Microsoft Word'
              }
            ]
          },
          {
            top: 'Бриф на логотип',
            items: [
              {
                link: 'http://kmmc.in/wp-content/uploads/2014/01/lesson2.pdf',
                isDownload: false,
                isBlank: true,
                isAbsoluteLink: true,
                text: 'Заполнить online'
              },
              {
                link: '/img/test.pdf',
                isDownload: true,
                isBlank: false,
                isAbsoluteLink: true,
                text: 'Скачать документ Microsoft Word'
              }
            ]
          }
        ]
      },
      seo: {
        title: 'seo',
        titleColor: '#e4f9f1',
        links: [
          {
            top: 'Бриф на SEO продвижение',
            items: [
              {
                link: 'http://kmmc.in/wp-content/uploads/2014/01/lesson2.pdf',
                isDownload: false,
                isBlank: true,
                isAbsoluteLink: true,
                text: 'Заполнить online'
              },
              {
                link: '/img/test.pdf',
                isDownload: true,
                isBlank: false,
                isAbsoluteLink: true,
                text: 'Скачать документ Microsoft Word'
              }
            ]
          }
        ]
      }
    }
  }
};

const errorPage = {
  state: {
    menu: [
      {
        text: 'Услуги',
        link: '/services'
      },
      {
        text: 'Портфолио',
        link: '/portfolio'
      },
      {
        text: 'Блог',
        link: '/blog'
      }
    ],
    title: 'ВОЗМОЖНО ЭТО НЕ ТО, ЧТО ВЫ ИСКАЛИ',
    info: `
        <p>Ой, здесь ничего нет! Мы надеемся, что одна из нижеприведенных<br> ссылок поможет вам найти то, что вы искали</p>
      `,
    img: `
        <svg class="error-img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1800 616.9"><style>.error-img .st0{fill:#6cdd6c}.error-img .st1{fill:#50aa50}.error-img .st2{fill:#405b91}.error-img .st3{fill:#fff}.error-img .st4{fill:#415b91}.error-img .st6{fill-rule:evenodd;clip-rule:evenodd;fill:#415b91}.error-img .st7{fill:#b6d0fb}.error-img .st8{fill:#3f5b91}</style><path class="st0" d="M1013.9 577.4c-1.3-4.1-4.1-8-8.2-9.3-4.1-1.3-9.3.7-10.6 4.8-3.8-3.1-9.5-.6-12.6 3.2-4.9 6.2-1.1 16.5-.3 17.1.9.7 3.3.6 3.3.6l36.6-.2s6.7-.5 9.8-1.7c6.2-2.5 10.5-13.2 6.5-18.6-2.7-3.7-8.1-4.4-12.5-3.1s-8.5 4.2-12 7.2"/><path class="st1" d="M985 595.1c-.9 0-2.6-.1-3.5-.9-1.4-1.2-5.1-12.2.1-18.8 2.2-2.8 5.5-4.7 8.5-5 1.6-.2 3.1.1 4.4.8.8-1.4 2-2.6 3.6-3.4 2.4-1.3 5.3-1.5 7.8-.7 3.6 1.2 6.7 4.2 8.4 8.4 3.6-2.9 7.5-5.1 11.1-6.3 4.4-1.4 10.6-.9 13.8 3.5 1.9 2.5 2.3 6.3 1.2 10.2-1.3 4.8-4.6 8.8-8.2 10.2-3.2 1.3-9.9 1.8-10.2 1.8l-36.7.2h-.3zm6.1-22.4h-.7c-2.4.3-5.1 1.9-6.9 4.1-4.3 5.5-1.1 14.6-.4 15.5.2.1 1.4.3 2.3.2l36.7-.2s6.5-.5 9.4-1.6c2.9-1.2 5.6-4.6 6.7-8.6.9-3.3.6-6.2-.8-8.1-2.6-3.4-7.6-3.8-11.2-2.6-3.8 1.2-7.9 3.7-11.6 6.9-.3.3-.7.4-1.1.3-.4-.1-.7-.4-.8-.8-1.3-4.2-4.1-7.4-7.4-8.5-1.9-.6-4.1-.4-6 .6-1.5.8-2.6 2-3 3.4-.1.4-.4.7-.8.8-.4.1-.8 0-1.1-.2-.9-.8-2-1.2-3.3-1.2zM975.4 576c-1 2-1.5 4.3-1.2 6.5.1 1.1 1.9 1.2 1.8 0-.2-2 .1-3.9 1-5.6.5-1-1-1.9-1.6-.9zM970.2 577.5c-.6 2-.6 4.1-.2 6.2.2 1.1 2 .7 1.7-.5-.4-1.8-.3-3.5.2-5.2.3-1.2-1.4-1.7-1.7-.5zM980.3 573.8c1.2 0 1.2-1.8 0-1.8-1.1 0-1.1 1.8 0 1.8z"/><path class="st1" d="M985.5 582.6v1.6c0 1.2 1.8 1.2 1.8 0v-1.6c0-1.2-1.8-1.2-1.8 0zM1016.1 585.4v.8c0 1.2 1.8 1.2 1.8 0v-.8c0-1.2-1.8-1.2-1.8 0zM1012.7 583.2l.4.4c.8.8 2.1-.5 1.3-1.3l-.4-.4c-.8-.8-2.1.5-1.3 1.3z"/><path class="st2" d="M497.6 543.2h-61.4c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h61.4c1.3 0 2.4 1.1 2.4 2.4 0 1.4-1.1 2.4-2.4 2.4z"/><path class="st3" d="M1037.9 330.4h-1.8c0-1.4-1.2-2.6-2.6-2.6-1.4 0-2.6 1.2-2.6 2.6h-1.8c0-2.4 2-4.4 4.4-4.4 2.5 0 4.4 2 4.4 4.4zM1044.2 228.4h-1.8c0-1.4-1.2-2.6-2.6-2.6-1.4 0-2.6 1.2-2.6 2.6h-1.8c0-2.4 2-4.4 4.4-4.4 2.4 0 4.4 1.9 4.4 4.4z"/><path class="st4" d="M826 582h-83.4l1.4-2.4c5.5-13 6-24.1 5.2-36.8l-.2-1.6 70.3-.2v1.4c.1 8.2 2.3 26.8 5.6 37.4l1.1 2.2zm-76.2-3.9h69.7c-2.7-10.1-4.5-24.8-4.9-33.2l-60.4.2c.6 11.3-.1 21.5-4.4 33z"/><path class="st4" d="M718.7 544.9c-63.3 0-114.6-.3-116.9-1.1-5.4-1.9-12.5-9.4-12.6-14.8-.2-11.5.1-27.2-.3-45.4-1.1-54.3-1.1-121.8 0-171.6.2-7.6 4.8-13.4 12.3-13.4h.2l365.1.5c7.7.1 13.9 6.4 14.1 14.2.3 12.1 0 23.7 0 36.7 0 62 1 86.5.3 159.1 0 2-.1 4.2-.2 6.5-.5 10.8.9 24.3-13 27-6.8 1.4-145.9 2.3-249 2.3zM601.2 302.4c-5.5 0-8.3 4.3-8.5 9.8-1.1 47.7-1 115 0 171.2.3 18.2.1 33.9.3 45.5.1 3.4 5.7 9.6 10 11.2 7.8 1.6 355 .4 363.9-1.3 10.9-2.2 9.6-12.8 10.1-23.2.1-2.4.1-5 .1-7.2.6-59 .4-102.9.4-157.8 0-12.6-.6-25.1-.9-37.3-.1-5.7-4.6-10.3-10.3-10.4l-365-.5h-.1z"/><path class="st5" d="M956.3 311.6l-343.9-.5c-6.2-.1-10.9 4-10.8 9.5.4 77.8-.5 142 0 180.9.1 3.8 7.4 9.4 11.8 10.8 5.2 1.6 332.1.4 340.1-1 14.3-2.5 13.1-17.1 13.1-26.6 0-61.5.6-107.9.4-163-.1-5.5-4.5-10-10.7-10.1z" fill-rule="evenodd" clip-rule="evenodd" fill="#b6d0fb"/><path class="st3" d="M738.2 446.5h-11.7v10.6h-23.1v-10.6h-32v-11.7l23.2-60.4h31.9v59.7h11.7v12.4zm-34.8-12.4v-32.7l-10.8 32.7h10.8zM889.9 446.5h-11.7v10.6h-23.1v-10.6h-32v-11.7l23.2-60.4h31.9v59.7h11.7v12.4zm-34.8-12.4v-32.7l-10.8 32.7h10.8zM745.2 415.9c0-13.3 3.5-23.6 10.4-30.9 6.9-7.3 15.1-11 24.7-11 9.9 0 18.3 3.8 25 11.4 6.7 7.6 10.1 17.8 10.1 30.6 0 13.5-3.5 23.8-10.4 31.1-7 7.3-15.2 10.9-24.7 10.9-9.9 0-18.2-3.8-25-11.4-6.8-7.7-10.1-17.9-10.1-30.7zm26.5 0c0 10.2.8 16.9 2.3 20 1.5 3.2 3.6 4.7 6.3 4.7 2.7 0 4.8-1.7 6.3-5 1.4-3.2 2.2-9.8 2.2-19.7 0-10.3-.8-17-2.3-20.1-1.6-3-3.7-4.6-6.3-4.6-2.6 0-4.6 1.5-6.2 4.6-1.5 3.1-2.3 9.8-2.3 20.1z"/><path class="st4" d="M855.9 596.2H712.8c-5.7 0-8.7-4.5-8.7-8.9s3-8.9 8.7-8.9h143.1c5.7 0 8.7 4.5 8.7 8.9-.1 4.4-3 8.9-8.7 8.9zm-143.1-13.9c-3.8 0-4.8 3.1-4.8 5s1 5 4.8 5h143.1c3.8 0 4.8-3.1 4.8-5s-1-5-4.8-5H712.8z"/><path class="st6" d="M613.1 526.3c-.8 0-.8 0 0 0"/><path class="st4" d="M613.1 531.3c6.4 0 6.4-10 0-10s-6.4 10 0 10z"/><path class="st6" d="M633.2 526.3c-.8 0-.8 0 0 0"/><path class="st4" d="M633.2 531.3c6.4 0 6.4-10 0-10s-6.4 10 0 10z"/><path class="st6" d="M653.4 526.3c-.9 0-.9 0 0 0"/><path class="st4" d="M653.4 531.3c6.4 0 6.4-10 0-10s-6.5 10 0 10z"/><path class="st6" d="M784.3 306.3c-.4 0-.4 0 0 0"/><path class="st4" d="M784.3 308.7c3 0 3-4.7 0-4.7s-3 4.7 0 4.7z"/><path class="st7" d="M1187.9 586.7h-49.3l19-62.3h11.4zM1134.5 586.7h57.5v7.1h-57.5z"/><path class="st4" d="M1143.4 571.1l-4.8 15.6h49.3l-4.7-15.6zM1148.1 555.6h30.4l-4.8-15.6h-20.9z"/><g id="XMLID_11_"><path class="st7" d="M1208.1 593.4h10.9V551h56.2v42.4h10.9V551h11.6v-33.8h-9.2v-3.1h-15.9v3.1h-49.8v-3.1h-15.9v3.1h-10.1V551h11.4v42.4zm86.1-72.6v.1l-6.7 26.6h-12l6.8-26.8h11.9zm-31.4 26.7h-12l6.8-26.8h12l-6.8 26.8zm-24.6 0h-12l6.8-26.8h12l-6.8 26.8zm-29.9-26.7h12l-6.8 26.8h-12l6.8-26.8z" id="XMLID_493_"/></g><path class="st7" d="M669.9 179.3l3.3-3.3c.7-.7.7-1.7 0-2.4l-2.9-2.9c-.7-.7-.8-1.9-.4-2.7l2.3-5.6c.3-.9 1.2-1.6 2.2-1.6h4c.9 0 1.7-.8 1.7-1.7v-4.6c0-.9-.8-1.7-1.7-1.7h-4c-.9 0-1.9-.7-2.2-1.6l-2.3-5.6c-.5-.8-.3-2 .4-2.7l2.9-2.9c.7-.7.7-1.7 0-2.4l-3.3-3.3c-.7-.7-1.7-.7-2.4 0l-2.9 2.9c-.7.7-1.9.8-2.7.4l-5.7-2.3c-.9-.3-1.6-1.2-1.6-2.2v-4c0-.9-.8-1.7-1.7-1.7h-4.6c-.9 0-1.7.8-1.7 1.7v4c0 .9-.7 1.9-1.6 2.2l-5.7 2.3c-.8.4-2 .3-2.7-.4l-2.9-2.9c-.7-.7-1.7-.7-2.4 0l-3.3 3.3c-.7.7-.7 1.7 0 2.4l2.9 2.9c.7.7.8 1.9.4 2.7l-2.3 5.6c-.3.9-1.3 1.6-2.2 1.6h-4c-.9 0-1.7.8-1.7 1.7v4.6c0 .9.8 1.7 1.7 1.7h4c.9 0 1.9.7 2.2 1.6l2.3 5.6c.5.8.3 2-.4 2.7l-2.9 2.9c-.7.7-.7 1.7 0 2.4l3.3 3.3c.7.7 1.7.7 2.4 0l2.9-2.9c.7-.7 1.9-.8 2.7-.4l5.7 2.3c.9.3 1.6 1.2 1.6 2.2v4.1c0 .9.8 1.7 1.7 1.7h4.6c.9 0 1.7-.8 1.7-1.7v-4.1c0-.9.7-1.9 1.6-2.2l5.7-2.3c.8-.5 2-.3 2.7.4l2.9 2.9c.7.6 1.7.6 2.4 0zm-19.3-9c-7.5 0-13.6-6.1-13.6-13.6s6.1-13.6 13.6-13.6 13.6 6.1 13.6 13.6-6.1 13.6-13.6 13.6zM701.3 192.1l-.8-2.8c-.2-.6-.8-.9-1.3-.7l-2.4.7c-.6.2-1.3-.1-1.6-.6l-2.4-2.9c-.4-.4-.5-1.2-.2-1.7l1.2-2.2c.3-.5.1-1.2-.4-1.4l-2.5-1.4c-.5-.3-1.1-.1-1.4.4l-1.2 2.2c-.3.5-1 .8-1.5.7l-3.8-.4c-.6 0-1.2-.4-1.4-1l-.7-2.4c-.2-.6-.8-.9-1.3-.7l-2.8.8c-.6.2-.9.8-.7 1.3l.7 2.4c.2.6-.1 1.3-.6 1.6l-2.9 2.4c-.4.4-1.2.5-1.7.2l-2.2-1.2c-.5-.3-1.2-.1-1.4.4l-1.4 2.5c-.3.5-.1 1.2.4 1.4l2.2 1.2c.5.3.8 1 .7 1.5l-.4 3.8c0 .6-.4 1.2-1 1.4l-2.4.7c-.6.2-.9.8-.7 1.3l.8 2.7c.2.6.8.9 1.3.7l2.4-.7c.6-.2 1.3.1 1.6.6l2.4 2.9c.4.4.5 1.2.3 1.7L673 210c-.3.5-.1 1.1.4 1.4l2.5 1.4c.5.3 1.2.1 1.4-.4l1.2-2.2c.3-.5 1-.8 1.5-.7l3.8.4c.6 0 1.2.4 1.4 1l.7 2.4c.2.6.8.9 1.3.7l2.8-.8c.6-.2.9-.8.7-1.3l-.7-2.4c-.2-.6.1-1.3.6-1.6l2.9-2.4c.4-.4 1.2-.5 1.7-.3l2.2 1.2c.5.3 1.2.1 1.4-.4l1.4-2.5c.3-.5.1-1.2-.4-1.4l-2.2-1.2c-.5-.3-.8-1-.7-1.5l.4-3.8c0-.6.4-1.2 1-1.4l2.4-.7c.4-.3.7-.9.6-1.4zm-10.6 7.9c-2.2 4.1-7.3 5.6-11.4 3.4-4.1-2.2-5.6-7.3-3.4-11.4 2.2-4.1 7.3-5.6 11.4-3.4 4.1 2.2 5.6 7.3 3.4 11.4z"/><path class="st2" d="M838.5 245.2h-76c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h76c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1.1 2.4-2.4 2.4zM683.8 279.7H561.1c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h122.7c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1 2.4-2.4 2.4zM1272.3 345h-122.7c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h122.7c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1.1 2.4-2.4 2.4zM1320.5 598.6H392c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h928.5c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1.1 2.4-2.4 2.4z"/><path class="st7" d="M979.9 214.8c-5.2 0-10.1 2-13.8 5.7-6.3 6.3-7.5 16-3 23.7l.3.5-19.7 19.7s-1 .9-1 2.2c0 1 .5 2 1.5 3 1.1 1.1 2.2 1.6 3.3 1.6 1.4 0 2.3-.8 2.3-.8l19.7-19.7.5.3c3 1.7 6.4 2.7 9.9 2.7 5.2 0 10.1-2 13.8-5.7 7.6-7.6 7.6-20 0-27.6-3.7-3.6-8.6-5.6-13.8-5.6zm0 33.2c-7.6 0-13.7-6.1-13.7-13.7s6.2-13.7 13.7-13.7c7.6 0 13.7 6.1 13.7 13.7s-6.1 13.7-13.7 13.7z"/><path class="st7" d="M972.7 237.2h14.1v-3.6h-14.1v3.6z"/><path class="st2" d="M617.9 594.2c-1.3 0-2.4-1.1-2.4-2.4V405.6c0-1.3 1.1-2.4 2.4-2.4 1.3 0 2.4 1.1 2.4 2.4v186.2c0 1.3-1 2.4-2.4 2.4zM661.2 594.2c-1.3 0-2.4-1.1-2.4-2.4V405.6c0-1.3 1.1-2.4 2.4-2.4s2.4 1.1 2.4 2.4v186.2c0 1.3-1.1 2.4-2.4 2.4z"/><path class="st2" d="M661.2 420.7h-43.3c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h43.3c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1.1 2.4-2.4 2.4zM661.2 442h-43.3c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h43.3c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1.1 2.4-2.4 2.4zM661.2 463.3h-43.3c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h43.3c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1.1 2.4-2.4 2.4zM661.2 484.5h-43.3c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h43.3c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1.1 2.4-2.4 2.4zM661.2 505.8h-43.3c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h43.3c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1.1 2.4-2.4 2.4zM661.2 527.1h-43.3c-1.3 0-2.4-1.1-2.4-2.4s1.1-2.4 2.4-2.4h43.3c1.3 0 2.4 1.1 2.4 2.4s-1.1 2.4-2.4 2.4zM661.2 548.3h-43.3c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h43.3c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1.1 2.4-2.4 2.4zM661.2 569.6h-43.3c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h43.3c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1.1 2.4-2.4 2.4z"/><g><path class="st2" d="M559 414.6c-1.3 0-2.4-1.1-2.4-2.4v-9.4c0-1.3 1.1-2.4 2.4-2.4 1.3 0 2.4 1.1 2.4 2.4v9.4c0 1.3-1.1 2.4-2.4 2.4z"/><path class="st2" d="M563.7 409.9h-9.4c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h9.4c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1 2.4-2.4 2.4z"/></g><g><path class="st2" d="M492.9 158.7c-1.3 0-2.4-1.1-2.4-2.4v-9.4c0-1.3 1.1-2.4 2.4-2.4 1.3 0 2.4 1.1 2.4 2.4v9.4c.1 1.3-1 2.4-2.4 2.4z"/><path class="st2" d="M497.6 154h-9.4c-1.3 0-2.4-1.1-2.4-2.4s1.1-2.4 2.4-2.4h9.4c1.3 0 2.4 1.1 2.4 2.4s-1 2.4-2.4 2.4z"/></g><g><path class="st2" d="M187.5-1.2c-1.3 0-2.4-1.1-2.4-2.4V-13c0-1.3 1.1-2.4 2.4-2.4 1.3 0 2.4 1.1 2.4 2.4v9.4c0 1.3-1.1 2.4-2.4 2.4z"/><path class="st2" d="M192.2-5.9h-9.4c-1.3 0-2.4-1.1-2.4-2.4s1.1-2.4 2.4-2.4h9.4c1.3 0 2.4 1.1 2.4 2.4s-1.1 2.4-2.4 2.4z"/></g><g><path class="st2" d="M270.9 248.7c-.9 0-1.6-.7-1.6-1.6v-6.2c0-.9.7-1.6 1.6-1.6.9 0 1.6.7 1.6 1.6v6.2c0 .9-.8 1.6-1.6 1.6z"/><path class="st2" d="M274 245.6h-6.2c-.9 0-1.6-.7-1.6-1.6s.7-1.6 1.6-1.6h6.2c.9 0 1.6.7 1.6 1.6s-.8 1.6-1.6 1.6z"/></g><g><path class="st2" d="M181.8 322.4c-1.3 0-2.4-1.1-2.4-2.4v-9.4c0-1.3 1.1-2.4 2.4-2.4 1.3 0 2.4 1.1 2.4 2.4v9.4c.1 1.3-1 2.4-2.4 2.4z"/><path class="st2" d="M186.6 317.7h-9.4c-1.3 0-2.4-1.1-2.4-2.4 0-1.3 1.1-2.4 2.4-2.4h9.4c1.3 0 2.4 1.1 2.4 2.4 0 1.3-1.1 2.4-2.4 2.4z"/></g><g><path class="st2" d="M185.5 616.9c-1.3 0-2.4-1.1-2.4-2.4v-9.4c0-1.3 1.1-2.4 2.4-2.4 1.3 0 2.4 1.1 2.4 2.4v9.4c0 1.3-1 2.4-2.4 2.4z"/><path class="st2" d="M190.2 612.2h-9.4c-1.3 0-2.4-1.1-2.4-2.4s1.1-2.4 2.4-2.4h9.4c1.3 0 2.4 1.1 2.4 2.4s-1 2.4-2.4 2.4z"/></g><g><path class="st2" d="M1506.9 611.8c-1 0-1.8-.8-1.8-1.8v-7c0-1 .8-1.8 1.8-1.8s1.8.8 1.8 1.8v7c-.1 1-.9 1.8-1.8 1.8z"/><path class="st2" d="M1510.3 608.3h-7c-1 0-1.8-.8-1.8-1.8s.8-1.8 1.8-1.8h7c1 0 1.8.8 1.8 1.8s-.8 1.8-1.8 1.8z"/></g><g><path class="st2" d="M1458 337.2c-.5 0-.8-.4-.8-.8v-3.2c0-.5.4-.8.8-.8s.8.4.8.8v3.2c0 .5-.4.8-.8.8z"/><path class="st2" d="M1459.6 335.6h-3.2c-.5 0-.8-.4-.8-.8s.4-.8.8-.8h3.2c.5 0 .8.4.8.8s-.4.8-.8.8z"/></g><g><path class="st2" d="M1201.5 170.3c-.6 0-1-.5-1-1.2v-4.6c0-.7.5-1.2 1-1.2s1 .5 1 1.2v4.6c0 .7-.4 1.2-1 1.2z"/><path class="st2" d="M1203.5 168h-4.1c-.6 0-1-.5-1-1.2s.5-1.2 1-1.2h4.1c.6 0 1 .5 1 1.2.1.7-.4 1.2-1 1.2z"/></g><g><path class="st2" d="M1550.5-15.8c-.9 0-1.6-.8-1.6-1.7v-6.8c0-1 .7-1.7 1.6-1.7.9 0 1.6.8 1.6 1.7v6.8c-.1.9-.8 1.7-1.6 1.7z"/><path class="st2" d="M1553.5-19.2h-6.1c-.9 0-1.6-.8-1.6-1.7 0-1 .7-1.7 1.6-1.7h6.1c.9 0 1.6.8 1.6 1.7 0 1-.7 1.7-1.6 1.7z"/></g><g><path class="st2" d="M1663.3 228.3c-.9 0-1.6-.8-1.6-1.7v-6.8c0-1 .7-1.7 1.6-1.7.9 0 1.6.8 1.6 1.7v6.8c0 .9-.7 1.7-1.6 1.7z"/><path class="st2" d="M1666.4 224.9h-6.1c-.9 0-1.6-.8-1.6-1.7 0-1 .7-1.7 1.6-1.7h6.1c.9 0 1.6.8 1.6 1.7-.1.9-.8 1.7-1.6 1.7z"/></g><g><path class="st2" d="M776.4 78c-1.3 0-2.4-1.1-2.4-2.4v-9.4c0-1.3 1.1-2.4 2.4-2.4 1.3 0 2.4 1.1 2.4 2.4v9.4c0 1.3-1.1 2.4-2.4 2.4z"/><path class="st2" d="M781.1 73.3h-9.4c-1.3 0-2.4-1.1-2.4-2.4s1.1-2.4 2.4-2.4h9.4c1.3 0 2.4 1.1 2.4 2.4s-1.1 2.4-2.4 2.4z"/></g><g><path class="st2" d="M852.6 565.2c-.2 0-.4 0-.7-.1l-9-2.6c-1.3-.4-2-1.7-1.7-3 .4-1.3 1.7-2 3-1.7l9 2.6c1.3.4 2 1.7 1.7 3-.3 1.1-1.3 1.8-2.3 1.8z"/><path class="st2" d="M846.8 568.5c-.2 0-.4 0-.7-.1-1.3-.4-2-1.7-1.7-3l2.6-9c.4-1.3 1.7-2 3-1.7 1.3.4 2 1.7 1.7 3l-2.6 9c-.3 1.1-1.3 1.8-2.3 1.8z"/></g><g><path class="st2" d="M805 281c-.2 0-.4 0-.7-.1l-9-2.6c-1.3-.4-2-1.7-1.7-3 .4-1.3 1.7-2 3-1.7l9 2.6c1.3.4 2 1.7 1.7 3-.2 1.1-1.2 1.8-2.3 1.8z"/><path class="st2" d="M799.2 284.2c-.2 0-.4 0-.7-.1-1.3-.4-2-1.7-1.7-3l2.6-9c.4-1.3 1.7-2 3-1.7 1.3.4 2 1.7 1.7 3l-2.6 9c-.3 1.1-1.2 1.8-2.3 1.8z"/></g><g><ellipse transform="rotate(-45.001 798.703 191.907)" class="st7" cx="798.7" cy="191.9" rx="33.6" ry="33.6"/><circle class="st3" cx="798.7" cy="191.9" r="25.2"/><path class="st2" d="M798.7 218c-14.4 0-26.1-11.7-26.1-26.1 0-14.4 11.7-26.1 26.1-26.1s26.1 11.7 26.1 26.1c0 14.4-11.7 26.1-26.1 26.1zm0-50.3c-13.3 0-24.2 10.8-24.2 24.2s10.8 24.2 24.2 24.2c13.3 0 24.2-10.8 24.2-24.2s-10.9-24.2-24.2-24.2z"/><path class="st2" d="M798.7 192.9c-.5 0-1-.4-1-1v-12.8c0-.5.4-1 1-1 .5 0 1 .4 1 1v12.8c0 .5-.5 1-1 1z"/><path class="st2" d="M813.7 192.9h-15c-.5 0-1-.4-1-1 0-.5.4-1 1-1h15c.5 0 1 .4 1 1 0 .5-.5 1-1 1z"/><g><path class="st2" d="M799.7 169.6c0 .5-.4 1-1 1s-1-.4-1-1c0-.5.4-1 1-1s1 .4 1 1z"/><circle class="st2" cx="814.5" cy="176.1" r="1"/><path class="st2" d="M821 192.9c-.5 0-1-.4-1-1 0-.5.4-1 1-1 .5 0 1 .4 1 1 0 .5-.4 1-1 1z"/><circle class="st2" cx="814.5" cy="207.7" r="1"/><path class="st2" d="M797.7 214.2c0-.5.4-1 1-1s1 .4 1 1-.4 1-1 1-1-.4-1-1zM782.2 207c.4-.4 1-.4 1.4 0 .4.4.4 1 0 1.4-.4.4-1 .4-1.4 0-.4-.4-.4-1 0-1.4z"/><circle class="st2" cx="776.4" cy="191.9" r="1"/><path class="st2" d="M783.6 175.4c.4.4.4 1 0 1.4-.4.4-1 .4-1.4 0-.4-.4-.4-1 0-1.4.4-.4 1-.4 1.4 0z"/></g><g><path class="st2" d="M847.8 179.1h-14.1c-.5 0-1-.4-1-1 0-.5.4-1 1-1h14.1c.5 0 1 .4 1 1 0 .5-.4 1-1 1zM847.8 206.7h-14.1c-.5 0-1-.4-1-1s.4-1 1-1h14.1c.5 0 1 .4 1 1s-.4 1-1 1zM865.3 192.9H839c-.5 0-1-.4-1-1 0-.5.4-1 1-1h26.3c.5 0 1 .4 1 1 0 .5-.4 1-1 1z"/></g></g><g><path class="st3" d="M895.7 555.6h15.6v15.6h-15.6z"/><path class="st4" d="M912.5 572.4h-18v-18h18v18zm-15.6-2.5h13.2v-13.2h-13.2v13.2z"/><g><path class="st2" d="M931 559h-14.1c-.5 0-1-.4-1-1 0-.5.4-1 1-1H931c.5 0 1 .4 1 1s-.5 1-1 1zM936.3 569.7h-19.1c-.7 0-1.3-.4-1.3-1 0-.5.6-1 1.3-1h19.1c.7 0 1.3.4 1.3 1 0 .5-.6 1-1.3 1zM943.2 564h-26.3c-.5 0-1-.4-1-1 0-.5.4-1 1-1h26.3c.5 0 1 .4 1 1s-.4 1-1 1z"/></g></g><g><path class="st3" d="M569.293 342.655h-15.6v-15.6h15.6z"/><path class="st4" d="M570.5 343.8h-18v-18h18v18zm-15.5-2.4h13.2v-13.2H555v13.2z"/><g><path class="st2" d="M534 330.5h14.1c.5 0 1-.4 1-1 0-.5-.4-1-1-1H534c-.5 0-1 .4-1 1 .1.5.5 1 1 1zM528.8 341.1h19.1c.7 0 1.3-.4 1.3-1 0-.5-.6-1-1.3-1h-19.1c-.7 0-1.3.4-1.3 1-.1.6.5 1 1.3 1zM521.8 335.5h26.3c.5 0 1-.4 1-1 0-.5-.4-1-1-1h-26.3c-.5 0-1 .4-1 1s.5 1 1 1z"/></g></g><g><path class="st8" d="M1028.7 385.6h4.8v207.9h-4.8z"/><path class="st7" d="M1039.9 410.7h-17.4c-3.4 0-6.2-2.8-6.2-6.2V369c0-3.4 2.8-6.2 6.2-6.2h17.4c3.4 0 6.2 2.8 6.2 6.2v35.6c-.1 3.3-2.9 6.1-6.2 6.1z"/><path class="st8" d="M1050.6 396.8c1.7.3 3.4.5 5.1.8 1.1.2 1.6-1.6.5-1.7-1.7-.3-3.4-.5-5.1-.8-1.1-.2-1.6 1.5-.5 1.7zM1050.4 385.7c1.3-.2 2.7-.3 4-.1 1.2.1 1.2-1.7 0-1.8-1.5-.1-3-.1-4.5.2-1.1.2-.6 1.9.5 1.7zM1049.9 375.6c1.3-.5 2.6-1 3.9-1.6 1.1-.4.6-2.2-.5-1.7-1.3.5-2.6 1-3.9 1.6-1.1.4-.6 2.2.5 1.7zM1005.4 398.5c1.3-.2 2.6-.5 3.9-.9 1.1-.4.6-2.1-.5-1.7-1.3.4-2.6.7-3.9.9-1.1.1-.6 1.8.5 1.7zM1003.1 385.6c1.7 0 3.3.3 4.9.8 1.1.3 1.6-1.4.5-1.7-1.8-.5-3.6-.8-5.4-.8-1.2-.1-1.2 1.7 0 1.7zM1004.7 370.7l3.9 1.2c1.1.4 1.6-1.4.5-1.7l-3.9-1.2c-1.2-.4-1.6 1.3-.5 1.7z"/><path class="st2" d="M1019.9 596.3l3.2-27.8h15.7l3.6 27.4z"/></g><g><path class="st0" d="M576.3 463.2c-.7-4.4-3.8-15.8-10.7-12.2-11.1 5.8 2.3 28-11.1 31.9-.7-8.8-2.6-14.9-6.6-14.6-8.2.7-6 19.9-6.2 24.2-.1 4.3-.3 8.7-.5 13.1-9.7 1.7-7.8-23.5-13.7-27-9.2-5.4-11.1 6.7-10.9 12.3.4 9.5 3 20.9 11.9 26 2.9 1.7 8.1 3.5 12.2 3.2 0 7.6.3 15.2 1.5 22.4 0 .1.1.1.2 0l5.4.3v.1c0 2.4 3.7 2.4 3.7 0 .1-4.6 2.9-27.1 3.2-46.2 4.3.6 9.8-1.4 12.9-3.7 9.3-6.8 10.4-19.3 8.7-29.8z"/><path class="st1" d="M549.6 545.7c-.5 0-1.1-.1-1.6-.4-.6-.4-1-.9-1.2-1.5l-4-.2h-1.5l-.2-.9c-1.1-6.1-1.6-13-1.6-21.5-4.5 0-9.3-2.1-11.7-3.4-9.5-5.4-12-17.6-12.4-26.8-.2-3.7.6-11.4 4.8-13.9 2.1-1.3 4.7-1 7.6.7 2.8 1.7 3.9 6.9 5.2 12.9 1.7 8.1 3.2 14 7 14.1l.1-2c.2-3.5.3-6.9.4-10.2 0-.7 0-1.7-.1-2.9-.3-7.5-.7-21.6 7.2-22.3 1.2-.1 2.3.2 3.3 1.1 2.2 1.9 3.6 6.2 4.3 13.1 5-2.2 4.7-8 4.4-14.7-.3-6.7-.6-13.7 5.3-16.7 1.9-1 3.7-1.1 5.4-.2 4.9 2.5 6.6 12.1 6.8 13.2 1.3 8.1 1.9 22.8-9 30.8-3 2.2-8.2 4.2-12.5 4-.3 12.5-1.6 26.2-2.4 35.4-.4 4.6-.8 8.2-.8 9.7 0 1.1-.5 1.9-1.4 2.4-.3.1-.9.2-1.4.2zm-6.5-4.2l5.8.3v1c0 .5.2.6.3.7.3.2.7.2 1 0 .2-.1.4-.3.4-.7 0-1.6.3-5.1.8-9.9.9-9.4 2.2-23.7 2.4-36.4v-1.2l1.2.2c4 .6 9.2-1.3 12.1-3.5 10-7.3 9.5-21.2 8.2-28.8-.5-3.3-2.4-10.1-5.7-11.7-1.1-.5-2.2-.5-3.6.2-4.7 2.5-4.5 8.5-4.2 14.8.3 7 .7 14.9-7.1 17.2l-1.2.4-.1-1.3c-.7-8.8-2.4-12-3.7-13-.5-.5-1.1-.6-1.8-.6-6 .5-5.5 13.8-5.3 20.2 0 1.3.1 2.4.1 3-.1 3.4-.3 6.8-.4 10.3l-.2 3.7-.8.1c-6.6 1.2-8.5-7.7-10.1-15.6-1.1-5.1-2.2-10.3-4.2-11.5-2.2-1.3-4.1-1.6-5.5-.7-3.1 1.8-4 8.4-3.8 12.1.4 8.7 2.7 20.2 11.4 25.1 3 1.7 7.9 3.4 11.6 3.1l1.1-.1v1.1c-.1 8.6.3 15.4 1.3 21.5z"/><path class="st4" d="M565.6 593.9h-39.3c-2.1 0-3.8-1.4-4.2-3.4l-8.9-45.9 3.7-.7 8.9 45.9c.1.4.4.4.5.4h39.3c.1 0 .4 0 .5-.4l8.9-45.9 3.7.7-8.9 45.9c-.4 2-2.1 3.4-4.2 3.4z"/><path class="st7" d="M513.5 529.8h65.3c1.1 0 2 1.2 2 2.7v9.9c0 1.5-.9 2.7-2 2.7h-65.3c-1.1 0-2-1.2-2-2.7v-9.9c0-1.4.9-2.7 2-2.7z"/><path class="st2" d="M578.9 546.3h-65.3c-1.7 0-3.1-1.7-3.1-3.8v-9.9c0-2.1 1.4-3.8 3.1-3.8h65.3c1.7 0 3.1 1.7 3.1 3.8v9.9c-.1 2.1-1.5 3.8-3.1 3.8zm-65.4-15.4c-.5 0-1 .7-1 1.7v9.9c0 1 .5 1.7 1 1.7h65.3c.5 0 1-.7 1-1.7v-9.9c0-1-.5-1.7-1-1.7h-65.3z"/><path class="st7" d="M578.9 546.1h-65.3c-1.6 0-2.9-1.6-2.9-3.6v-9.9c0-2 1.3-3.6 2.9-3.6h65.3c1.6 0 2.9 1.6 2.9 3.6v9.9c-.1 2-1.4 3.6-2.9 3.6zm-65.4-15.4c-.6 0-1.2.8-1.2 1.9v9.9c0 1.1.6 1.9 1.2 1.9h65.3c.6 0 1.2-.8 1.2-1.9v-9.9c0-1.1-.6-1.9-1.2-1.9h-65.3z"/><path class="st2" d="M578.9 547.1h-65.3c-2.2 0-3.9-2.1-3.9-4.6v-9.9c0-2.6 1.8-4.6 3.9-4.6h65.3c2.2 0 3.9 2.1 3.9 4.6v9.9c0 2.6-1.8 4.6-3.9 4.6zm-65.2-15.4c-.1.1-.3.4-.3.9v9.9c0 .5.2.8.3.9h65.2c-.1 0 .1-.3.1-.8v-9.9c0-.5-.2-.8-.3-.9l-65-.1z"/><path class="st1" d="M520.7 490.9c1.1.1 2.1.3 3.2.4 1.2.1 1.1-1.7 0-1.8-1.1-.1-2.1-.3-3.2-.4-1.2-.2-1.2 1.6 0 1.8zM525.4 476.6v1.6c0 1.2 1.8 1.2 1.8 0v-1.6c0-1.2-1.8-1.2-1.8 0zM531.7 493.2c.8-.4 1.6-.9 2.4-1.3 1-.6.1-2.1-.9-1.6-.8.4-1.6.9-2.4 1.3-1.1.6-.1 2.2.9 1.6zM522.4 514.1c.9-.7 1.9-1.3 2.8-2 .9-.7 0-2.2-.9-1.6-.9.7-1.9 1.3-2.8 2-1 .7-.1 2.3.9 1.6zM515.6 498.5c.7.3 1.3.5 2 .8 1.1.4 1.6-1.3.5-1.7-.7-.3-1.3-.5-2-.8-1.1-.5-1.6 1.3-.5 1.7zM528.7 506.9c.4 0 .7.2 1 .6.7.9 2-.4 1.3-1.3-.6-.7-1.3-1-2.2-1.1-1.2-.1-1.2 1.7-.1 1.8zM532.7 515.4c-.2 1.3-.1 2.4.4 3.5s2 .1 1.6-.9c-.3-.7-.4-1.4-.3-2.1.2-1.1-1.5-1.6-1.7-.5zM542.2 515.8c.5.1 1.1.3 1.6.4 1.1.3 1.6-1.4.5-1.7-.5-.1-1.1-.3-1.6-.4-1.2-.4-1.6 1.4-.5 1.7zM548 498c-.1 1 .3 2 1.1 2.6.9.7 2.2-.5 1.3-1.3-.5-.4-.6-.8-.6-1.4.1-1.1-1.7-1.1-1.8.1zM545.7 485c-.5.7-.6 1.5-.5 2.3.2 1.1 1.9.7 1.7-.5-.1-.4 0-.7.3-.9.7-.9-.8-1.8-1.5-.9zM555.6 490.3v1.6c0 1.2 1.8 1.2 1.8 0v-1.6c0-1.2-1.8-1.2-1.8 0zM538.7 487.5c.4.3.8.5 1.2.8 1 .6 1.9-.9.9-1.6-.4-.3-.8-.5-1.2-.8-.9-.7-1.8.9-.9 1.6zM541.8 472.4c.4.4.5.8.6 1.4.1 1.2 1.9 1.2 1.8 0-.1-1-.4-1.9-1.1-2.6-.8-1-2.1.3-1.3 1.2zM546.4 466.9v2.4c0 1.2 1.8 1.2 1.8 0v-2.4c0-1.1-1.8-1.1-1.8 0zM557.6 477.6l.8.8c.8.8 2.1-.4 1.3-1.3-.3-.3-.5-.6-.8-.8-.9-.8-2.1.4-1.3 1.3zM559.4 466.8c.8 0 1.6.1 2.4.1 1.2.1 1.2-1.7 0-1.8-.8 0-1.6-.1-2.4-.1-1.2-.1-1.2 1.7 0 1.8zM561.9 452.3l1.6 1.6c.8.8 2.1-.5 1.3-1.3l-1.6-1.6c-.8-.8-2.1.4-1.3 1.3zM568.9 447.6v2.8c0 1.2 1.8 1.2 1.8 0v-2.8c0-1.2-1.8-1.2-1.8 0zM572.2 464.6c.3-.4.5-.8.8-1.2.6-1-.9-1.9-1.6-.9-.3.4-.5.8-.8 1.2-.6.9 1 1.8 1.6.9zM566.1 482.4c.7-.3 1.3-.5 2-.8 1.1-.4.6-2.2-.5-1.7-.7.3-1.3.5-2 .8-1.1.3-.6 2.1.5 1.7zM574.1 479.8c.7-.1 1.3-.3 2-.4 1.1-.2.7-2-.5-1.7-.7.1-1.3.3-2 .4-1.1.2-.7 2 .5 1.7z"/><g><path class="st1" d="M568.9 488.3v.4c0 1.2 1.8 1.2 1.8 0v-.4c0-1.2-1.8-1.2-1.8 0z"/></g><g><path class="st1" d="M553.3 516c.4-.3.8-.5 1.2-.8 1-.6.1-2.2-.9-1.6-.4.3-.8.5-1.2.8-.9.7 0 2.3.9 1.6z"/></g><g><path class="st1" d="M552.3 522.7c.7-.7 1.5-1.1 2.5-1.3 1.1-.3.7-2-.5-1.7-1.3.3-2.3.9-3.3 1.8-.8.7.4 2 1.3 1.2z"/></g><g><path class="st1" d="M544.8 523.8c.1.3.3.5.4.8.5 1 2.1.1 1.6-.9-.1-.3-.3-.5-.4-.8-.5-1-2.1-.1-1.6.9z"/></g><g><path class="st1" d="M537.9 525.8c1 .5 2 .7 3.1.4 1.1-.2.7-2-.5-1.7-.6.1-1.2 0-1.7-.3-1-.5-1.9 1-.9 1.6z"/></g><g><path class="st1" d="M552.9 508.6c1.2-.2 2.4-.3 3.6-.5 1.1-.1 1.2-2 0-1.8-1.2.2-2.4.3-3.6.5-1.1.1-1.1 1.9 0 1.8z"/></g></g><g><path class="st4" d="M894.4 104.1h2.6v168.8h-2.6z"/><path class="st4" d="M906.4 273c0 5.9-4.8 10.7-10.7 10.7-5.9 0-10.7-4.8-10.7-10.7 0-5.9 4.8-10.7 10.7-10.7 5.9-.1 10.7 4.7 10.7 10.7z"/><path class="st4" d="M895.9 308.9c-.2 0-3.7 0-6.2-2.6-1.7-1.7-2.6-4.1-2.6-7 0-.8.6-1.4 1.4-1.4.8 0 1.4.6 1.4 1.4 0 2.2.6 3.9 1.7 5 1.7 1.7 4.2 1.8 4.2 1.8 4 0 7.3-3.3 7.3-7.3s-3.3-7.3-7.3-7.3c-.8 0-1.4-.6-1.4-1.4v-7.9c0-.8.6-1.4 1.4-1.4s1.4.6 1.4 1.4v6.6c4.9.7 8.7 4.9 8.7 10 .1 5.6-4.5 10.1-10 10.1z"/><path class="st4" d="M839.6 315.5c-.5-.1-1-.5-1.1-1.1-.1-.7.4-1.4 1.1-1.5l58-8.5c.7-.1 1.4.4 1.5 1.1.1.7-.4 1.4-1.1 1.5l-58 8.5h-.4z"/><path class="st4" d="M950.9 334.8c-.1 0-.3-.1-.4-.1l-53.3-27.8c-.6-.3-.9-1.1-.6-1.8.3-.6 1.1-.9 1.8-.6l53.3 27.8c.6.3.9 1.1.6 1.8-.2.5-.8.8-1.4.7z"/><path class="st3" d="M928.7 443.1l-120.7-21c-9.4-1.6-15.6-10.5-14-19.9l12.2-70.1c2.1-12 7.5-22.1 25.4-17.9l118.6 20.6c15.9 2.8 31.7 3.4 23.8 33.7l-8.4 48.6c-2 35.9-19.6 29-36.9 26z"/><path class="st4" d="M948.5 448.1c-.9 0-1.8-.1-2.7-.2l-141.1-24.5c-4.2-.7-7.9-3.1-10.3-6.6-2.5-3.5-3.4-7.7-2.7-11.9l14-80.8c1.5-8.7 9.8-14.5 18.5-13l141.1 24.5c4.2.7 7.9 3.1 10.3 6.6 2.5 3.5 3.4 7.7 2.7 11.9l-14 80.8c-1.4 7.7-8.1 13.2-15.8 13.2zm-127-133.7c-5.9 0-11.1 4.2-12.2 10.3l-14 80.8c-.6 3.3.2 6.5 2.1 9.2 1.9 2.7 4.7 4.5 8 5.1l141.1 24.5c6.7 1.2 13.1-3.3 14.3-10.1l14-80.8c.6-3.3-.2-6.5-2.1-9.2-1.9-2.7-4.7-4.5-8-5.1l-141.1-24.5c-.7-.1-1.4-.2-2.1-.2z"/><path class="st7" d="M943.9 437l-140.3-24.4c-2-.4-3.4-2.3-3.1-4.3l13.8-79.3c.9-4.9 5.5-8.2 10.5-7.4l133.8 23.3c6.3 1.1 10.6 7.1 9.5 13.5l-12.2 70.1c-1 5.7-6.4 9.5-12 8.5z"/><path class="st2" d="M946.8 439.2c-.6 0-1.3-.1-1.9-.2l-136.4-23.7c-2.9-.5-5.4-2.1-7-4.5-1.7-2.4-2.3-5.3-1.8-8.1l12.9-74.1c1-5.9 6.7-9.9 12.6-8.9l136.4 23.7c5.9 1 9.9 6.7 8.9 12.6l-12.9 74.1c-.5 2.9-2.1 5.4-4.5 7-1.9 1.4-4.1 2.1-6.3 2.1zm-1.3-3.7c1.9.3 3.8-.1 5.4-1.2 1.6-1.1 2.6-2.8 3-4.7l12.9-74.1c.7-3.9-2-7.7-5.9-8.4l-136.4-23.7c-3.9-.7-7.7 2-8.4 5.9l-12.9 74.1c-.3 1.9.1 3.8 1.2 5.4 1.1 1.6 2.8 2.6 4.7 3l136.4 23.7z"/><path class="st3" d="M880.5 426l35.5-32.5 19.6 42.1z"/><path class="st4" d="M937.7 437.2l-59.8-10.4 38.5-35.3 21.3 45.7zm-54.5-12l50.4 8.8-17.9-38.5-32.5 29.7z"/><g><path class="st3" d="M810.4 413.8l62.9-57.6 34.8 74.6z"/><path class="st4" d="M910.1 432.4l-102.3-17.8 65.9-60.4 36.4 78.2zm-97-19.3l92.9 16.1-33.1-71-59.8 54.9z"/></g><g><path class="st3" d="M948 367.2c-.8 4.8-5.4 8-10.2 7.2-4.8-.8-8-5.4-7.2-10.2s5.4-8 10.2-7.2c4.8.8 8 5.4 7.2 10.2z"/><path class="st4" d="M939.4 375.6c-.6 0-1.2 0-1.7-.1-5.4-.9-9.1-6.1-8.1-11.6.5-2.6 1.9-4.9 4.1-6.5 2.2-1.5 4.8-2.1 7.5-1.7 2.6.5 4.9 1.9 6.5 4.1 1.5 2.2 2.1 4.8 1.7 7.5-.5 2.6-1.9 4.9-4.1 6.5-1.9 1.2-3.9 1.8-5.9 1.8zm-.1-17.5c-1.5 0-3.1.5-4.3 1.4-1.7 1.2-2.8 2.9-3.1 4.9-.3 2 .1 4 1.3 5.7 1.2 1.7 2.9 2.8 4.9 3.1 2 .3 4-.1 5.7-1.3 1.7-1.2 2.8-2.9 3.1-4.9.7-4.1-2.1-8.1-6.2-8.8-.5-.1-.9-.1-1.4-.1z"/></g><g><path class="st7" d="M872.7 98.4h131.7v14.5H872.7z"/></g><g><path class="st4" d="M1118.9 398.2h-43.7V11.5h43.7v386.7zm-39.4-4.4h35.1v-378h-35.1v378z"/><path class="st4" d="M1118.3 53.9h-42.6V11.3h42.6v42.6zm-38.2-4.4h33.9V15.7h-33.9v33.8z"/><path class="st4" d="M1076.279 15.015l3.11-3.111 38.255 38.254-3.111 3.111z"/><path class="st4" d="M1076.352 50.16l38.254-38.254 3.11 3.111-38.253 38.255z"/><path class="st4" d="M1118.3 92.2h-42.6V49.5h42.6v42.7zm-38.2-4.4h33.9V53.9h-33.9v33.9z"/><path class="st4" d="M1076.312 53.304l3.111-3.11 38.254 38.253-3.111 3.111z"/><path class="st4" d="M1076.382 88.447l38.255-38.254 3.11 3.111-38.253 38.254z"/><path class="st4" d="M1118.3 130.4h-42.6V87.8h42.6v42.6zm-38.2-4.4h33.9V92.2h-33.9V126z"/><path class="st4" d="M1076.338 91.586l3.112-3.111 38.254 38.254-3.112 3.111z"/><path class="st4" d="M1076.369 126.695l38.254-38.254 3.111 3.112-38.254 38.254z"/><path class="st4" d="M1118.3 168.7h-42.6V126h42.6v42.7zm-38.2-4.4h33.9v-33.9h-33.9v33.9z"/><path class="st4" d="M1076.3 129.805l3.112-3.112 38.254 38.255-3.111 3.11z"/><path class="st4" d="M1076.373 164.95l38.254-38.254 3.112 3.111-38.254 38.254z"/><g><path class="st4" d="M1118.3 206.9h-42.6v-42.6h42.6v42.6zm-38.2-4.3h33.9v-33.9h-33.9v33.9z"/><path class="st4" d="M1076.334 168.094l3.11-3.111 38.255 38.254-3.111 3.111z"/><path class="st4" d="M1076.358 203.2l38.254-38.254 3.111 3.112-38.254 38.254z"/></g><g><path class="st4" d="M1118.3 245.2h-42.6v-42.6h42.6v42.6zm-38.2-4.4h33.9v-33.9h-33.9v33.9z"/><path class="st4" d="M1076.29 206.305l3.111-3.112 38.254 38.255-3.111 3.11z"/><path class="st4" d="M1076.388 241.488l38.254-38.254 3.11 3.111L1079.5 244.6z"/></g><g><path class="st4" d="M1118.3 283.5h-42.6v-42.6h42.6v42.6zm-38.2-4.4h33.9v-33.9h-33.9v33.9z"/><path class="st4" d="M1076.324 244.597l3.112-3.111 38.254 38.254-3.111 3.111z"/><path class="st4" d="M1076.347 279.705l38.254-38.254 3.111 3.112-38.254 38.254z"/></g><g><path class="st4" d="M1118.3 321.7h-42.6v-42.6h42.6v42.6zm-38.2-4.4h33.9v-33.9h-33.9v33.9z"/><path class="st4" d="M1076.283 282.81l3.111-3.111 38.254 38.254-3.11 3.111z"/><path class="st4" d="M1076.377 317.993l38.254-38.254 3.111 3.111-38.254 38.255z"/></g><g><path class="st4" d="M1118.3 360h-42.6v-42.6h42.6V360zm-38.2-4.4h33.9v-33.9h-33.9v33.9z"/><path class="st4" d="M1076.316 321.1l3.11-3.111 38.255 38.254-3.111 3.111z"/><path class="st4" d="M1076.407 356.281l38.254-38.254 3.11 3.111-38.253 38.254z"/></g><g><path class="st4" d="M1118.3 398.2h-42.6v-42.6h42.6v42.6zm-38.2-4.4h33.9V360h-33.9v33.8z"/><path class="st4" d="M1076.342 359.377l3.111-3.11 38.254 38.253-3.11 3.112z"/><path class="st4" d="M1076.32 394.408l38.26-38.25 3.11 3.113-38.259 38.248z"/></g><g><path class="st4" d="M1194.5 91.6h-42.6V49h42.6v42.6zm-38.3-4.4h33.9V53.3h-33.9v33.9z"/><path class="st4" d="M1152.51 87.914l38.25-38.26 3.111 3.111-38.249 38.26z"/><path class="st4" d="M1152.47 52.654l3.11-3.111 38.255 38.254-3.111 3.111z"/><path class="st4" d="M1156.2 91.6h-42.6V49h42.6v42.6zm-38.2-4.4h33.9V53.3H1118v33.9z"/><path class="st4" d="M1114.223 87.944l38.248-38.26 3.112 3.111-38.249 38.26z"/><path class="st4" d="M1114.18 52.682l3.112-3.11 38.254 38.253-3.111 3.111z"/><g><path class="st4" d="M1118 91.6h-42.6V49h42.6v42.6zm-38.3-4.4h33.9V53.3h-33.9v33.9z"/></g><g><path class="st4" d="M1079.7 91.6h-42.6V49h42.6v42.6zm-38.3-4.4h33.9V53.3h-33.9v33.9z"/><path class="st4" d="M1037.682 87.892l38.254-38.254 3.111 3.111-38.254 38.254z"/><path class="st4" d="M1037.678 52.674l3.111-3.112 38.254 38.254-3.111 3.112z"/></g><g><path class="st4" d="M1041.4 91.6h-42.6V49h42.6v42.6zm-38.2-4.4h33.9V53.3h-33.9v33.9z"/><path class="st4" d="M999.464 87.85l38.254-38.254 3.111 3.11-38.254 38.255z"/><path class="st4" d="M999.397 52.711l3.111-3.11 38.254 38.253-3.11 3.112z"/></g><g><path class="st4" d="M1003.2 91.6h-42.6V49h42.6v42.6zm-38.3-4.4h33.9V53.3h-33.9v33.9z"/><path class="st4" d="M962.7 91.6h-38.3c-.9 0-1.7-.5-2-1.4-.3-.8-.2-1.8.5-2.4L960.5 49l3.7 3.7-34.5 34.5h32.1l37.6-37.6 3.1 3.1L964.3 91c-.4.4-1 .6-1.6.6z"/><path class="st4" d="M961.175 52.665l3.111-3.111 38.255 38.254-3.112 3.111z"/></g></g><g><path class="st4" d="M1119 440.8h-43.8v-42.6h43.8v42.6zm-39.3-4.4h34.8v-33.9h-34.8v33.9z"/><path class="st4" d="M1115.1 440.2l-39.3-38.3 3.2-3.1 39.3 38.3z"/><path class="st4" d="M1079 440.2l-3.2-3.1 39.3-38.3 3.2 3.1z"/></g><g><path class="st4" d="M1119 593.8h-43.8v-42.6h43.8v42.6zm-39.3-4.3h34.8v-33.9h-34.8v33.9z"/><path class="st4" d="M1115.1 593.2l-39.3-38.3 3.2-3.1 39.3 38.3z"/><path class="st4" d="M1079 593.2l-3.2-3.1 39.3-38.3 3.2 3.1z"/></g><g><path class="st4" d="M1119 475.4h-43.8v-42.6h43.8v42.6zm-39.3-4.3h34.8v-33.9h-34.8v33.9z"/><path class="st4" d="M1115.1 474.8l-39.3-38.3 3.2-3.1 39.3 38.3z"/><path class="st4" d="M1079 474.8l-3.2-3.1 39.3-38.3 3.2 3.1z"/></g><g><path class="st4" d="M1119 513.7h-43.8v-42.6h43.8v42.6zm-39.3-4.4h34.8v-33.9h-34.8v33.9z"/><path class="st4" d="M1115.1 513.1l-39.3-38.3 3.2-3.1 39.3 38.3z"/><path class="st4" d="M1079 513.1l-3.2-3.1 39.3-38.3 3.2 3.1z"/></g><g><path class="st4" d="M1119 552h-43.8v-42.6h43.8V552zm-39.3-4.4h34.8v-33.9h-34.8v33.9z"/><path class="st4" d="M1115.1 551.3l-39.3-38.2 3.2-3.1 39.3 38.2z"/><path class="st4" d="M1079 551.3l-3.2-3.1 39.3-38.2 3.2 3.1z"/></g></g></g><g><path class="st2" d="M629.8 243.3c4.7 0 4.7-7.3 0-7.3-4.6.1-4.6 7.3 0 7.3z"/></g><g><path class="st2" d="M1023 167.6c4.7 0 4.7-7.3 0-7.3-4.6 0-4.7 7.3 0 7.3z"/></g><g><path class="st2" d="M1185.8 423.4h1.6M1185.8 427h1.6c1.9 0 3.7-1.7 3.6-3.6-.1-2-1.6-3.6-3.6-3.6h-1.6c-1.9 0-3.7 1.7-3.6 3.6 0 1.9 1.5 3.6 3.6 3.6z"/></g><g><path class="st2" d="M486.4 480.2c4.7 0 4.7-7.3 0-7.3-4.6 0-4.6 7.3 0 7.3zM320.8 408.7c4.7 0 4.7-7.3 0-7.3s-4.7 7.3 0 7.3z"/></g><g><path class="st2" d="M832.9 132.1c4.7 0 4.7-7.3 0-7.3-4.7.1-4.7 7.3 0 7.3z"/></g></svg>
      `
  }
};

const store = () =>
  new Vuex.Store({
    modules: {
      homePage,
      global,
      servicesPage,
      servicesCategoryPage,
      servicesInnerPage,
      portfolioPage,
      portfolioInnerPage,
      aboutPage,
      aboutTeam,
      aboutOffice,
      aboutAwards,
      contactsPage,
      briefsPage,
      discussProject,
      blogPage,
      blogItemPage,
      errorPage
    }
  });

export default store;
